/* automatically generated by rust-bindgen 0.70.0 */

pub const __GNUC_VA_LIST: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const X86_EFLAGS_TEST_NT: u64 = 274877906944;
pub const X86_EFLAGS_TEST_DF: u64 = 549755813888;
pub const X86_EFLAGS_UNDEFINED_OF: u64 = 1099511627776;
pub const X86_EFLAGS_UNDEFINED_SF: u64 = 2199023255552;
pub const X86_EFLAGS_UNDEFINED_ZF: u64 = 4398046511104;
pub const X86_EFLAGS_UNDEFINED_PF: u64 = 8796093022208;
pub const X86_EFLAGS_UNDEFINED_AF: u64 = 17592186044416;
pub const X86_EFLAGS_UNDEFINED_CF: u64 = 35184372088832;
pub const X86_EFLAGS_RESET_RF: u64 = 70368744177664;
pub const X86_EFLAGS_TEST_RF: u64 = 140737488355328;
pub const X86_EFLAGS_TEST_IF: u64 = 281474976710656;
pub const X86_EFLAGS_TEST_TF: u64 = 562949953421312;
pub const X86_EFLAGS_TEST_AF: u64 = 1125899906842624;
pub const X86_EFLAGS_RESET_ZF: u64 = 2251799813685248;
pub const X86_EFLAGS_SET_OF: u64 = 4503599627370496;
pub const X86_EFLAGS_SET_SF: u64 = 9007199254740992;
pub const X86_EFLAGS_SET_ZF: u64 = 18014398509481984;
pub const X86_EFLAGS_SET_AF: u64 = 36028797018963968;
pub const X86_EFLAGS_SET_PF: u64 = 72057594037927936;
pub const X86_EFLAGS_RESET_0F: u64 = 144115188075855872;
pub const X86_EFLAGS_RESET_AC: u64 = 288230376151711744;
pub const X86_FPU_FLAGS_MODIFY_C0: u32 = 1;
pub const X86_FPU_FLAGS_MODIFY_C1: u32 = 2;
pub const X86_FPU_FLAGS_MODIFY_C2: u32 = 4;
pub const X86_FPU_FLAGS_MODIFY_C3: u32 = 8;
pub const X86_FPU_FLAGS_RESET_C0: u32 = 16;
pub const X86_FPU_FLAGS_RESET_C1: u32 = 32;
pub const X86_FPU_FLAGS_RESET_C2: u32 = 64;
pub const X86_FPU_FLAGS_RESET_C3: u32 = 128;
pub const X86_FPU_FLAGS_SET_C0: u32 = 256;
pub const X86_FPU_FLAGS_SET_C1: u32 = 512;
pub const X86_FPU_FLAGS_SET_C2: u32 = 1024;
pub const X86_FPU_FLAGS_SET_C3: u32 = 2048;
pub const X86_FPU_FLAGS_UNDEFINED_C0: u32 = 4096;
pub const X86_FPU_FLAGS_UNDEFINED_C1: u32 = 8192;
pub const X86_FPU_FLAGS_UNDEFINED_C2: u32 = 16384;
pub const X86_FPU_FLAGS_UNDEFINED_C3: u32 = 32768;
pub const X86_FPU_FLAGS_TEST_C0: u32 = 65536;
pub const X86_FPU_FLAGS_TEST_C1: u32 = 131072;
pub const X86_FPU_FLAGS_TEST_C2: u32 = 262144;
pub const X86_FPU_FLAGS_TEST_C3: u32 = 524288;
pub const M680X_OPERAND_COUNT: u32 = 9;
pub const M680X_OFFSET_NONE: u32 = 0;
pub const M680X_OFFSET_BITS_5: u32 = 5;
pub const M680X_OFFSET_BITS_8: u32 = 8;
pub const M680X_OFFSET_BITS_9: u32 = 9;
pub const M680X_OFFSET_BITS_16: u32 = 16;
pub const M680X_IDX_INDIRECT: u32 = 1;
pub const M680X_IDX_NO_COMMA: u32 = 2;
pub const M680X_IDX_POST_INC_DEC: u32 = 4;
pub const M680X_FIRST_OP_IN_MNEM: u32 = 1;
pub const M680X_SECOND_OP_IN_MNEM: u32 = 2;
pub const TRICORE_OP_COUNT: u32 = 8;
pub const MAX_IMPL_W_REGS: u32 = 20;
pub const MAX_IMPL_R_REGS: u32 = 20;
pub const MAX_NUM_GROUPS: u32 = 8;
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
pub type wchar_t = cty::c_int;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: cty::c_int,
    pub rem: cty::c_int,
}
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: cty::c_long,
    pub rem: cty::c_long,
}
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: cty::c_longlong,
    pub rem: cty::c_longlong,
}
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const cty::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const cty::c_char) -> cty::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const cty::c_char) -> cty::c_longlong;
}
extern "C" {
    pub fn strtod(__nptr: *const cty::c_char, __endptr: *mut *mut cty::c_char) -> f64;
}
extern "C" {
    pub fn strtof(__nptr: *const cty::c_char, __endptr: *mut *mut cty::c_char) -> f32;
}
extern "C" {
    pub fn strtold(__nptr: *const cty::c_char, __endptr: *mut *mut cty::c_char) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: cty::c_long) -> *mut cty::c_char;
}
extern "C" {
    pub fn a64l(__s: *const cty::c_char) -> cty::c_long;
}
pub type __u_char = cty::c_uchar;
pub type __u_short = cty::c_ushort;
pub type __u_int = cty::c_uint;
pub type __u_long = cty::c_ulong;
pub type __int8_t = cty::c_schar;
pub type __uint8_t = cty::c_uchar;
pub type __int16_t = cty::c_short;
pub type __uint16_t = cty::c_ushort;
pub type __int32_t = cty::c_int;
pub type __uint32_t = cty::c_uint;
pub type __int64_t = cty::c_long;
pub type __uint64_t = cty::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = cty::c_long;
pub type __u_quad_t = cty::c_ulong;
pub type __intmax_t = cty::c_long;
pub type __uintmax_t = cty::c_ulong;
pub type __dev_t = cty::c_ulong;
pub type __uid_t = cty::c_uint;
pub type __gid_t = cty::c_uint;
pub type __ino_t = cty::c_ulong;
pub type __ino64_t = cty::c_ulong;
pub type __mode_t = cty::c_uint;
pub type __nlink_t = cty::c_ulong;
pub type __off_t = cty::c_long;
pub type __off64_t = cty::c_long;
pub type __pid_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [cty::c_int; 2usize],
}
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = cty::c_long;
pub type __rlim_t = cty::c_ulong;
pub type __rlim64_t = cty::c_ulong;
pub type __id_t = cty::c_uint;
pub type __time_t = cty::c_long;
pub type __useconds_t = cty::c_uint;
pub type __suseconds_t = cty::c_long;
pub type __suseconds64_t = cty::c_long;
pub type __daddr_t = cty::c_int;
pub type __key_t = cty::c_int;
pub type __clockid_t = cty::c_int;
pub type __timer_t = *mut cty::c_void;
pub type __blksize_t = cty::c_long;
pub type __blkcnt_t = cty::c_long;
pub type __blkcnt64_t = cty::c_long;
pub type __fsblkcnt_t = cty::c_ulong;
pub type __fsblkcnt64_t = cty::c_ulong;
pub type __fsfilcnt_t = cty::c_ulong;
pub type __fsfilcnt64_t = cty::c_ulong;
pub type __fsword_t = cty::c_long;
pub type __ssize_t = cty::c_long;
pub type __syscall_slong_t = cty::c_long;
pub type __syscall_ulong_t = cty::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut cty::c_char;
pub type __intptr_t = cty::c_long;
pub type __socklen_t = cty::c_uint;
pub type __sig_atomic_t = cty::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = cty::c_ulong;
pub type ushort = cty::c_ushort;
pub type uint = cty::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = cty::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [cty::c_ulong; 16usize],
}
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = cty::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: cty::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> cty::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: cty::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> cty::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: cty::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: cty::c_uint,
    pub __high: cty::c_uint,
}
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: cty::c_int,
    pub __count: cty::c_uint,
    pub __owner: cty::c_int,
    pub __nusers: cty::c_uint,
    pub __kind: cty::c_int,
    pub __spins: cty::c_short,
    pub __elision: cty::c_short,
    pub __list: __pthread_list_t,
}
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: cty::c_uint,
    pub __writers: cty::c_uint,
    pub __wrphase_futex: cty::c_uint,
    pub __writers_futex: cty::c_uint,
    pub __pad3: cty::c_uint,
    pub __pad4: cty::c_uint,
    pub __cur_writer: cty::c_int,
    pub __shared: cty::c_int,
    pub __rwelision: cty::c_schar,
    pub __pad1: [cty::c_uchar; 7usize],
    pub __pad2: cty::c_ulong,
    pub __flags: cty::c_uint,
}
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [cty::c_uint; 2usize],
    pub __g_size: [cty::c_uint; 2usize],
    pub __g1_orig_size: cty::c_uint,
    pub __wrefs: cty::c_uint,
    pub __g_signals: [cty::c_uint; 2usize],
}
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = cty::c_uint;
pub type __thrd_t = cty::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: cty::c_int,
}
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = cty::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [cty::c_char; 4usize],
    pub __align: cty::c_int,
}
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [cty::c_char; 4usize],
    pub __align: cty::c_int,
}
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = cty::c_uint;
pub type pthread_once_t = cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [cty::c_char; 56usize],
    pub __align: cty::c_long,
}
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [cty::c_char; 40usize],
    pub __align: cty::c_long,
}
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [cty::c_char; 48usize],
    pub __align: cty::c_longlong,
}
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [cty::c_char; 56usize],
    pub __align: cty::c_long,
}
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [cty::c_char; 8usize],
    pub __align: cty::c_long,
}
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [cty::c_char; 32usize],
    pub __align: cty::c_long,
}
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [cty::c_char; 4usize],
    pub __align: cty::c_int,
}
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
extern "C" {
    pub fn random() -> cty::c_long;
}
extern "C" {
    pub fn srandom(__seed: cty::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: cty::c_uint,
        __statebuf: *mut cty::c_char,
        __statelen: usize,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut cty::c_char) -> *mut cty::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: cty::c_int,
    pub rand_deg: cty::c_int,
    pub rand_sep: cty::c_int,
    pub end_ptr: *mut i32,
}
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> cty::c_int;
}
extern "C" {
    pub fn srandom_r(__seed: cty::c_uint, __buf: *mut random_data) -> cty::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: cty::c_uint,
        __statebuf: *mut cty::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> cty::c_int;
}
extern "C" {
    pub fn setstate_r(__statebuf: *mut cty::c_char, __buf: *mut random_data) -> cty::c_int;
}
extern "C" {
    pub fn rand() -> cty::c_int;
}
extern "C" {
    pub fn srand(__seed: cty::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut cty::c_uint) -> cty::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut cty::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> cty::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut cty::c_ushort) -> cty::c_long;
}
extern "C" {
    pub fn mrand48() -> cty::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut cty::c_ushort) -> cty::c_long;
}
extern "C" {
    pub fn srand48(__seedval: cty::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut cty::c_ushort) -> *mut cty::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut cty::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [cty::c_ushort; 3usize],
    pub __old_x: [cty::c_ushort; 3usize],
    pub __c: cty::c_ushort,
    pub __init: cty::c_ushort,
    pub __a: cty::c_ulonglong,
}
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> cty::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut cty::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> cty::c_int;
}
extern "C" {
    pub fn lrand48_r(__buffer: *mut drand48_data, __result: *mut cty::c_long) -> cty::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut cty::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut cty::c_long,
    ) -> cty::c_int;
}
extern "C" {
    pub fn mrand48_r(__buffer: *mut drand48_data, __result: *mut cty::c_long) -> cty::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut cty::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut cty::c_long,
    ) -> cty::c_int;
}
extern "C" {
    pub fn srand48_r(__seedval: cty::c_long, __buffer: *mut drand48_data) -> cty::c_int;
}
extern "C" {
    pub fn seed48_r(__seed16v: *mut cty::c_ushort, __buffer: *mut drand48_data) -> cty::c_int;
}
extern "C" {
    pub fn lcong48_r(__param: *mut cty::c_ushort, __buffer: *mut drand48_data) -> cty::c_int;
}
extern "C" {
    pub fn malloc(__size: cty::c_ulong) -> *mut cty::c_void;
}
extern "C" {
    pub fn calloc(__nmemb: cty::c_ulong, __size: cty::c_ulong) -> *mut cty::c_void;
}
extern "C" {
    pub fn realloc(__ptr: *mut cty::c_void, __size: cty::c_ulong) -> *mut cty::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut cty::c_void);
}
extern "C" {
    pub fn reallocarray(__ptr: *mut cty::c_void, __nmemb: usize, __size: usize)
        -> *mut cty::c_void;
}
extern "C" {
    pub fn alloca(__size: cty::c_ulong) -> *mut cty::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut cty::c_void,
        __alignment: usize,
        __size: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn aligned_alloc(__alignment: cty::c_ulong, __size: cty::c_ulong) -> *mut cty::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> cty::c_int;
}
extern "C" {
    pub fn at_quick_exit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> cty::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(__status: cty::c_int, __arg: *mut cty::c_void),
        >,
        __arg: *mut cty::c_void,
    ) -> cty::c_int;
}
extern "C" {
    pub fn exit(__status: cty::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: cty::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: cty::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const cty::c_char,
        __value: *const cty::c_char,
        __replace: cty::c_int,
    ) -> cty::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn clearenv() -> cty::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn mkstemps(__template: *mut cty::c_char, __suffixlen: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn system(__command: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn realpath(__name: *const cty::c_char, __resolved: *mut cty::c_char) -> *mut cty::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const cty::c_void, arg2: *const cty::c_void) -> cty::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const cty::c_void,
        __base: *const cty::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn qsort(__base: *mut cty::c_void, __nmemb: usize, __size: usize, __compar: __compar_fn_t);
}
extern "C" {
    pub fn abs(__x: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn labs(__x: cty::c_long) -> cty::c_long;
}
extern "C" {
    pub fn llabs(__x: cty::c_longlong) -> cty::c_longlong;
}
extern "C" {
    pub fn div(__numer: cty::c_int, __denom: cty::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: cty::c_long, __denom: cty::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(__numer: cty::c_longlong, __denom: cty::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn gcvt(__value: f64, __ndigit: cty::c_int, __buf: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn qgcvt(__value: u128, __ndigit: cty::c_int, __buf: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
        __buf: *mut cty::c_char,
        __len: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
        __buf: *mut cty::c_char,
        __len: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
        __buf: *mut cty::c_char,
        __len: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: cty::c_int,
        __decpt: *mut cty::c_int,
        __sign: *mut cty::c_int,
        __buf: *mut cty::c_char,
        __len: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn mblen(__s: *const cty::c_char, __n: usize) -> cty::c_int;
}
extern "C" {
    pub fn mbtowc(__pwc: *mut wchar_t, __s: *const cty::c_char, __n: usize) -> cty::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut cty::c_char, __wchar: wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const cty::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut cty::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut cty::c_char,
        __tokens: *const *mut cty::c_char,
        __valuep: *mut *mut cty::c_char,
    ) -> cty::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: cty::c_int) -> cty::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: cty::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: cty::c_uint,
    pub __wchb: [cty::c_char; 4usize],
}
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = cty::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: cty::c_int,
    pub _IO_read_ptr: *mut cty::c_char,
    pub _IO_read_end: *mut cty::c_char,
    pub _IO_read_base: *mut cty::c_char,
    pub _IO_write_base: *mut cty::c_char,
    pub _IO_write_ptr: *mut cty::c_char,
    pub _IO_write_end: *mut cty::c_char,
    pub _IO_buf_base: *mut cty::c_char,
    pub _IO_buf_end: *mut cty::c_char,
    pub _IO_save_base: *mut cty::c_char,
    pub _IO_backup_base: *mut cty::c_char,
    pub _IO_save_end: *mut cty::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: cty::c_int,
    pub _flags2: cty::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: cty::c_ushort,
    pub _vtable_offset: cty::c_schar,
    pub _shortbuf: [cty::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut cty::c_void,
    pub __pad5: usize,
    pub _mode: cty::c_int,
    pub _unused2: [cty::c_char; 20usize],
}
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::__pad5"][::std::mem::offset_of!(_IO_FILE, __pad5) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn rename(__old: *const cty::c_char, __new: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: cty::c_int,
        __old: *const cty::c_char,
        __newfd: cty::c_int,
        __new: *const cty::c_char,
    ) -> cty::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn tempnam(__dir: *const cty::c_char, __pfx: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fopen(__filename: *const cty::c_char, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const cty::c_char,
        __modes: *const cty::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: cty::c_int, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(__s: *mut cty::c_void, __len: usize, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(__bufloc: *mut *mut cty::c_char, __sizeloc: *mut usize) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut cty::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut cty::c_char,
        __modes: cty::c_int,
        __n: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut cty::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn printf(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn sprintf(__s: *mut cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut cty::c_char,
        __maxlen: cty::c_ulong,
        __format: *const cty::c_char,
        ...
    ) -> cty::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut cty::c_char,
        __maxlen: cty::c_ulong,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: cty::c_int,
        __fmt: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn dprintf(__fd: cty::c_int, __fmt: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn fscanf(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn scanf(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn sscanf(__s: *const cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(__stream: *mut FILE, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(__s: *const cty::c_char, __format: *const cty::c_char, ...) -> cty::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const cty::c_char, __arg: *mut __va_list_tag) -> cty::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const cty::c_char,
        __format: *const cty::c_char,
        __arg: *mut __va_list_tag,
    ) -> cty::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getchar() -> cty::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> cty::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fputc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putchar(__c: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putw(__w: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fgets(__s: *mut cty::c_char, __n: cty::c_int, __stream: *mut FILE) -> *mut cty::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __delimiter: cty::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __delimiter: cty::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut cty::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const cty::c_char, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn puts(__s: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn ungetc(__c: cty::c_int, __stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut cty::c_void,
        __size: cty::c_ulong,
        __n: cty::c_ulong,
        __stream: *mut FILE,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const cty::c_void,
        __size: cty::c_ulong,
        __n: cty::c_ulong,
        __s: *mut FILE,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut cty::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const cty::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(__stream: *mut FILE, __off: cty::c_long, __whence: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> cty::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(__stream: *mut FILE, __off: __off_t, __whence: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn perror(__s: *const cty::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn popen(__command: *const cty::c_char, __modes: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: cty::c_int) -> cty::c_int;
}
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = cty::c_schar;
pub type int_fast16_t = cty::c_long;
pub type int_fast32_t = cty::c_long;
pub type int_fast64_t = cty::c_long;
pub type uint_fast8_t = cty::c_uchar;
pub type uint_fast16_t = cty::c_ulong;
pub type uint_fast32_t = cty::c_ulong;
pub type uint_fast64_t = cty::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: cty::c_long,
    pub rem: cty::c_long,
}
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const cty::c_char,
        __endptr: *mut *mut cty::c_char,
        __base: cty::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: cty::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: cty::c_int,
    ) -> uintmax_t;
}
pub type csh = usize;
pub const cs_arch_CS_ARCH_ARM: cs_arch = 0;
pub const cs_arch_CS_ARCH_ARM64: cs_arch = 1;
pub const cs_arch_CS_ARCH_MIPS: cs_arch = 2;
pub const cs_arch_CS_ARCH_X86: cs_arch = 3;
pub const cs_arch_CS_ARCH_PPC: cs_arch = 4;
pub const cs_arch_CS_ARCH_SPARC: cs_arch = 5;
pub const cs_arch_CS_ARCH_SYSZ: cs_arch = 6;
pub const cs_arch_CS_ARCH_XCORE: cs_arch = 7;
pub const cs_arch_CS_ARCH_M68K: cs_arch = 8;
pub const cs_arch_CS_ARCH_TMS320C64X: cs_arch = 9;
pub const cs_arch_CS_ARCH_M680X: cs_arch = 10;
pub const cs_arch_CS_ARCH_EVM: cs_arch = 11;
pub const cs_arch_CS_ARCH_MOS65XX: cs_arch = 12;
pub const cs_arch_CS_ARCH_WASM: cs_arch = 13;
pub const cs_arch_CS_ARCH_BPF: cs_arch = 14;
pub const cs_arch_CS_ARCH_RISCV: cs_arch = 15;
pub const cs_arch_CS_ARCH_SH: cs_arch = 16;
pub const cs_arch_CS_ARCH_TRICORE: cs_arch = 17;
pub const cs_arch_CS_ARCH_MAX: cs_arch = 18;
pub const cs_arch_CS_ARCH_ALL: cs_arch = 65535;
pub type cs_arch = cty::c_uint;
pub const cs_mode_CS_MODE_LITTLE_ENDIAN: cs_mode = 0;
pub const cs_mode_CS_MODE_ARM: cs_mode = 0;
pub const cs_mode_CS_MODE_16: cs_mode = 2;
pub const cs_mode_CS_MODE_32: cs_mode = 4;
pub const cs_mode_CS_MODE_64: cs_mode = 8;
pub const cs_mode_CS_MODE_THUMB: cs_mode = 16;
pub const cs_mode_CS_MODE_MCLASS: cs_mode = 32;
pub const cs_mode_CS_MODE_V8: cs_mode = 64;
pub const cs_mode_CS_MODE_MICRO: cs_mode = 16;
pub const cs_mode_CS_MODE_MIPS3: cs_mode = 32;
pub const cs_mode_CS_MODE_MIPS32R6: cs_mode = 64;
pub const cs_mode_CS_MODE_MIPS2: cs_mode = 128;
pub const cs_mode_CS_MODE_V9: cs_mode = 16;
pub const cs_mode_CS_MODE_QPX: cs_mode = 16;
pub const cs_mode_CS_MODE_SPE: cs_mode = 32;
pub const cs_mode_CS_MODE_BOOKE: cs_mode = 64;
pub const cs_mode_CS_MODE_PS: cs_mode = 128;
pub const cs_mode_CS_MODE_M68K_000: cs_mode = 2;
pub const cs_mode_CS_MODE_M68K_010: cs_mode = 4;
pub const cs_mode_CS_MODE_M68K_020: cs_mode = 8;
pub const cs_mode_CS_MODE_M68K_030: cs_mode = 16;
pub const cs_mode_CS_MODE_M68K_040: cs_mode = 32;
pub const cs_mode_CS_MODE_M68K_060: cs_mode = 64;
pub const cs_mode_CS_MODE_BIG_ENDIAN: cs_mode = 2147483648;
pub const cs_mode_CS_MODE_MIPS32: cs_mode = 4;
pub const cs_mode_CS_MODE_MIPS64: cs_mode = 8;
pub const cs_mode_CS_MODE_M680X_6301: cs_mode = 2;
pub const cs_mode_CS_MODE_M680X_6309: cs_mode = 4;
pub const cs_mode_CS_MODE_M680X_6800: cs_mode = 8;
pub const cs_mode_CS_MODE_M680X_6801: cs_mode = 16;
pub const cs_mode_CS_MODE_M680X_6805: cs_mode = 32;
pub const cs_mode_CS_MODE_M680X_6808: cs_mode = 64;
pub const cs_mode_CS_MODE_M680X_6809: cs_mode = 128;
pub const cs_mode_CS_MODE_M680X_6811: cs_mode = 256;
pub const cs_mode_CS_MODE_M680X_CPU12: cs_mode = 512;
pub const cs_mode_CS_MODE_M680X_HCS08: cs_mode = 1024;
pub const cs_mode_CS_MODE_BPF_CLASSIC: cs_mode = 0;
pub const cs_mode_CS_MODE_BPF_EXTENDED: cs_mode = 1;
pub const cs_mode_CS_MODE_RISCV32: cs_mode = 1;
pub const cs_mode_CS_MODE_RISCV64: cs_mode = 2;
pub const cs_mode_CS_MODE_RISCVC: cs_mode = 4;
pub const cs_mode_CS_MODE_MOS65XX_6502: cs_mode = 2;
pub const cs_mode_CS_MODE_MOS65XX_65C02: cs_mode = 4;
pub const cs_mode_CS_MODE_MOS65XX_W65C02: cs_mode = 8;
pub const cs_mode_CS_MODE_MOS65XX_65816: cs_mode = 16;
pub const cs_mode_CS_MODE_MOS65XX_65816_LONG_M: cs_mode = 32;
pub const cs_mode_CS_MODE_MOS65XX_65816_LONG_X: cs_mode = 64;
pub const cs_mode_CS_MODE_MOS65XX_65816_LONG_MX: cs_mode = 96;
pub const cs_mode_CS_MODE_SH2: cs_mode = 2;
pub const cs_mode_CS_MODE_SH2A: cs_mode = 4;
pub const cs_mode_CS_MODE_SH3: cs_mode = 8;
pub const cs_mode_CS_MODE_SH4: cs_mode = 16;
pub const cs_mode_CS_MODE_SH4A: cs_mode = 32;
pub const cs_mode_CS_MODE_SHFPU: cs_mode = 64;
pub const cs_mode_CS_MODE_SHDSP: cs_mode = 128;
pub const cs_mode_CS_MODE_TRICORE_110: cs_mode = 2;
pub const cs_mode_CS_MODE_TRICORE_120: cs_mode = 4;
pub const cs_mode_CS_MODE_TRICORE_130: cs_mode = 8;
pub const cs_mode_CS_MODE_TRICORE_131: cs_mode = 16;
pub const cs_mode_CS_MODE_TRICORE_160: cs_mode = 32;
pub const cs_mode_CS_MODE_TRICORE_161: cs_mode = 64;
pub const cs_mode_CS_MODE_TRICORE_162: cs_mode = 128;
pub type cs_mode = cty::c_uint;
pub type cs_malloc_t = ::std::option::Option<unsafe extern "C" fn(size: usize) -> *mut cty::c_void>;
pub type cs_calloc_t =
    ::std::option::Option<unsafe extern "C" fn(nmemb: usize, size: usize) -> *mut cty::c_void>;
pub type cs_realloc_t = ::std::option::Option<
    unsafe extern "C" fn(ptr: *mut cty::c_void, size: usize) -> *mut cty::c_void,
>;
pub type cs_free_t = ::std::option::Option<unsafe extern "C" fn(ptr: *mut cty::c_void)>;
pub type cs_vsnprintf_t = ::std::option::Option<
    unsafe extern "C" fn(
        str_: *mut cty::c_char,
        size: usize,
        format: *const cty::c_char,
        ap: *mut __va_list_tag,
    ) -> cty::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_opt_mem {
    pub malloc: cs_malloc_t,
    pub calloc: cs_calloc_t,
    pub realloc: cs_realloc_t,
    pub free: cs_free_t,
    pub vsnprintf: cs_vsnprintf_t,
}
const _: () = {
    ["Size of cs_opt_mem"][::std::mem::size_of::<cs_opt_mem>() - 40usize];
    ["Alignment of cs_opt_mem"][::std::mem::align_of::<cs_opt_mem>() - 8usize];
    ["Offset of field: cs_opt_mem::malloc"][::std::mem::offset_of!(cs_opt_mem, malloc) - 0usize];
    ["Offset of field: cs_opt_mem::calloc"][::std::mem::offset_of!(cs_opt_mem, calloc) - 8usize];
    ["Offset of field: cs_opt_mem::realloc"][::std::mem::offset_of!(cs_opt_mem, realloc) - 16usize];
    ["Offset of field: cs_opt_mem::free"][::std::mem::offset_of!(cs_opt_mem, free) - 24usize];
    ["Offset of field: cs_opt_mem::vsnprintf"]
        [::std::mem::offset_of!(cs_opt_mem, vsnprintf) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_opt_mnem {
    pub id: cty::c_uint,
    pub mnemonic: *const cty::c_char,
}
const _: () = {
    ["Size of cs_opt_mnem"][::std::mem::size_of::<cs_opt_mnem>() - 16usize];
    ["Alignment of cs_opt_mnem"][::std::mem::align_of::<cs_opt_mnem>() - 8usize];
    ["Offset of field: cs_opt_mnem::id"][::std::mem::offset_of!(cs_opt_mnem, id) - 0usize];
    ["Offset of field: cs_opt_mnem::mnemonic"]
        [::std::mem::offset_of!(cs_opt_mnem, mnemonic) - 8usize];
};
pub const cs_opt_type_CS_OPT_INVALID: cs_opt_type = 0;
pub const cs_opt_type_CS_OPT_SYNTAX: cs_opt_type = 1;
pub const cs_opt_type_CS_OPT_DETAIL: cs_opt_type = 2;
pub const cs_opt_type_CS_OPT_MODE: cs_opt_type = 3;
pub const cs_opt_type_CS_OPT_MEM: cs_opt_type = 4;
pub const cs_opt_type_CS_OPT_SKIPDATA: cs_opt_type = 5;
pub const cs_opt_type_CS_OPT_SKIPDATA_SETUP: cs_opt_type = 6;
pub const cs_opt_type_CS_OPT_MNEMONIC: cs_opt_type = 7;
pub const cs_opt_type_CS_OPT_UNSIGNED: cs_opt_type = 8;
pub const cs_opt_type_CS_OPT_NO_BRANCH_OFFSET: cs_opt_type = 9;
pub type cs_opt_type = cty::c_uint;
pub const cs_opt_value_CS_OPT_OFF: cs_opt_value = 0;
pub const cs_opt_value_CS_OPT_ON: cs_opt_value = 3;
pub const cs_opt_value_CS_OPT_SYNTAX_DEFAULT: cs_opt_value = 0;
pub const cs_opt_value_CS_OPT_SYNTAX_INTEL: cs_opt_value = 1;
pub const cs_opt_value_CS_OPT_SYNTAX_ATT: cs_opt_value = 2;
pub const cs_opt_value_CS_OPT_SYNTAX_NOREGNAME: cs_opt_value = 3;
pub const cs_opt_value_CS_OPT_SYNTAX_MASM: cs_opt_value = 4;
pub const cs_opt_value_CS_OPT_SYNTAX_MOTOROLA: cs_opt_value = 5;
pub type cs_opt_value = cty::c_uint;
pub const cs_op_type_CS_OP_INVALID: cs_op_type = 0;
pub const cs_op_type_CS_OP_REG: cs_op_type = 1;
pub const cs_op_type_CS_OP_IMM: cs_op_type = 2;
pub const cs_op_type_CS_OP_MEM: cs_op_type = 3;
pub const cs_op_type_CS_OP_FP: cs_op_type = 4;
pub type cs_op_type = cty::c_uint;
pub const cs_ac_type_CS_AC_INVALID: cs_ac_type = 0;
pub const cs_ac_type_CS_AC_READ: cs_ac_type = 1;
pub const cs_ac_type_CS_AC_WRITE: cs_ac_type = 2;
pub type cs_ac_type = cty::c_uint;
pub const cs_group_type_CS_GRP_INVALID: cs_group_type = 0;
pub const cs_group_type_CS_GRP_JUMP: cs_group_type = 1;
pub const cs_group_type_CS_GRP_CALL: cs_group_type = 2;
pub const cs_group_type_CS_GRP_RET: cs_group_type = 3;
pub const cs_group_type_CS_GRP_INT: cs_group_type = 4;
pub const cs_group_type_CS_GRP_IRET: cs_group_type = 5;
pub const cs_group_type_CS_GRP_PRIVILEGE: cs_group_type = 6;
pub const cs_group_type_CS_GRP_BRANCH_RELATIVE: cs_group_type = 7;
pub type cs_group_type = cty::c_uint;
pub type cs_skipdata_cb_t = ::std::option::Option<
    unsafe extern "C" fn(
        code: *const u8,
        code_size: usize,
        offset: usize,
        user_data: *mut cty::c_void,
    ) -> usize,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_opt_skipdata {
    pub mnemonic: *const cty::c_char,
    pub callback: cs_skipdata_cb_t,
    pub user_data: *mut cty::c_void,
}
const _: () = {
    ["Size of cs_opt_skipdata"][::std::mem::size_of::<cs_opt_skipdata>() - 24usize];
    ["Alignment of cs_opt_skipdata"][::std::mem::align_of::<cs_opt_skipdata>() - 8usize];
    ["Offset of field: cs_opt_skipdata::mnemonic"]
        [::std::mem::offset_of!(cs_opt_skipdata, mnemonic) - 0usize];
    ["Offset of field: cs_opt_skipdata::callback"]
        [::std::mem::offset_of!(cs_opt_skipdata, callback) - 8usize];
    ["Offset of field: cs_opt_skipdata::user_data"]
        [::std::mem::offset_of!(cs_opt_skipdata, user_data) - 16usize];
};
pub const arm_shifter_ARM_SFT_INVALID: arm_shifter = 0;
pub const arm_shifter_ARM_SFT_ASR: arm_shifter = 1;
pub const arm_shifter_ARM_SFT_LSL: arm_shifter = 2;
pub const arm_shifter_ARM_SFT_LSR: arm_shifter = 3;
pub const arm_shifter_ARM_SFT_ROR: arm_shifter = 4;
pub const arm_shifter_ARM_SFT_RRX: arm_shifter = 5;
pub const arm_shifter_ARM_SFT_ASR_REG: arm_shifter = 6;
pub const arm_shifter_ARM_SFT_LSL_REG: arm_shifter = 7;
pub const arm_shifter_ARM_SFT_LSR_REG: arm_shifter = 8;
pub const arm_shifter_ARM_SFT_ROR_REG: arm_shifter = 9;
pub const arm_shifter_ARM_SFT_RRX_REG: arm_shifter = 10;
pub type arm_shifter = cty::c_uint;
pub const arm_cc_ARM_CC_INVALID: arm_cc = 0;
pub const arm_cc_ARM_CC_EQ: arm_cc = 1;
pub const arm_cc_ARM_CC_NE: arm_cc = 2;
pub const arm_cc_ARM_CC_HS: arm_cc = 3;
pub const arm_cc_ARM_CC_LO: arm_cc = 4;
pub const arm_cc_ARM_CC_MI: arm_cc = 5;
pub const arm_cc_ARM_CC_PL: arm_cc = 6;
pub const arm_cc_ARM_CC_VS: arm_cc = 7;
pub const arm_cc_ARM_CC_VC: arm_cc = 8;
pub const arm_cc_ARM_CC_HI: arm_cc = 9;
pub const arm_cc_ARM_CC_LS: arm_cc = 10;
pub const arm_cc_ARM_CC_GE: arm_cc = 11;
pub const arm_cc_ARM_CC_LT: arm_cc = 12;
pub const arm_cc_ARM_CC_GT: arm_cc = 13;
pub const arm_cc_ARM_CC_LE: arm_cc = 14;
pub const arm_cc_ARM_CC_AL: arm_cc = 15;
pub type arm_cc = cty::c_uint;
pub const arm_sysreg_ARM_SYSREG_INVALID: arm_sysreg = 0;
pub const arm_sysreg_ARM_SYSREG_SPSR_C: arm_sysreg = 1;
pub const arm_sysreg_ARM_SYSREG_SPSR_X: arm_sysreg = 2;
pub const arm_sysreg_ARM_SYSREG_SPSR_S: arm_sysreg = 4;
pub const arm_sysreg_ARM_SYSREG_SPSR_F: arm_sysreg = 8;
pub const arm_sysreg_ARM_SYSREG_CPSR_C: arm_sysreg = 16;
pub const arm_sysreg_ARM_SYSREG_CPSR_X: arm_sysreg = 32;
pub const arm_sysreg_ARM_SYSREG_CPSR_S: arm_sysreg = 64;
pub const arm_sysreg_ARM_SYSREG_CPSR_F: arm_sysreg = 128;
pub const arm_sysreg_ARM_SYSREG_APSR: arm_sysreg = 256;
pub const arm_sysreg_ARM_SYSREG_APSR_G: arm_sysreg = 257;
pub const arm_sysreg_ARM_SYSREG_APSR_NZCVQ: arm_sysreg = 258;
pub const arm_sysreg_ARM_SYSREG_APSR_NZCVQG: arm_sysreg = 259;
pub const arm_sysreg_ARM_SYSREG_IAPSR: arm_sysreg = 260;
pub const arm_sysreg_ARM_SYSREG_IAPSR_G: arm_sysreg = 261;
pub const arm_sysreg_ARM_SYSREG_IAPSR_NZCVQG: arm_sysreg = 262;
pub const arm_sysreg_ARM_SYSREG_IAPSR_NZCVQ: arm_sysreg = 263;
pub const arm_sysreg_ARM_SYSREG_EAPSR: arm_sysreg = 264;
pub const arm_sysreg_ARM_SYSREG_EAPSR_G: arm_sysreg = 265;
pub const arm_sysreg_ARM_SYSREG_EAPSR_NZCVQG: arm_sysreg = 266;
pub const arm_sysreg_ARM_SYSREG_EAPSR_NZCVQ: arm_sysreg = 267;
pub const arm_sysreg_ARM_SYSREG_XPSR: arm_sysreg = 268;
pub const arm_sysreg_ARM_SYSREG_XPSR_G: arm_sysreg = 269;
pub const arm_sysreg_ARM_SYSREG_XPSR_NZCVQG: arm_sysreg = 270;
pub const arm_sysreg_ARM_SYSREG_XPSR_NZCVQ: arm_sysreg = 271;
pub const arm_sysreg_ARM_SYSREG_IPSR: arm_sysreg = 272;
pub const arm_sysreg_ARM_SYSREG_EPSR: arm_sysreg = 273;
pub const arm_sysreg_ARM_SYSREG_IEPSR: arm_sysreg = 274;
pub const arm_sysreg_ARM_SYSREG_MSP: arm_sysreg = 275;
pub const arm_sysreg_ARM_SYSREG_PSP: arm_sysreg = 276;
pub const arm_sysreg_ARM_SYSREG_PRIMASK: arm_sysreg = 277;
pub const arm_sysreg_ARM_SYSREG_BASEPRI: arm_sysreg = 278;
pub const arm_sysreg_ARM_SYSREG_BASEPRI_MAX: arm_sysreg = 279;
pub const arm_sysreg_ARM_SYSREG_FAULTMASK: arm_sysreg = 280;
pub const arm_sysreg_ARM_SYSREG_CONTROL: arm_sysreg = 281;
pub const arm_sysreg_ARM_SYSREG_MSPLIM: arm_sysreg = 282;
pub const arm_sysreg_ARM_SYSREG_PSPLIM: arm_sysreg = 283;
pub const arm_sysreg_ARM_SYSREG_MSP_NS: arm_sysreg = 284;
pub const arm_sysreg_ARM_SYSREG_PSP_NS: arm_sysreg = 285;
pub const arm_sysreg_ARM_SYSREG_MSPLIM_NS: arm_sysreg = 286;
pub const arm_sysreg_ARM_SYSREG_PSPLIM_NS: arm_sysreg = 287;
pub const arm_sysreg_ARM_SYSREG_PRIMASK_NS: arm_sysreg = 288;
pub const arm_sysreg_ARM_SYSREG_BASEPRI_NS: arm_sysreg = 289;
pub const arm_sysreg_ARM_SYSREG_FAULTMASK_NS: arm_sysreg = 290;
pub const arm_sysreg_ARM_SYSREG_CONTROL_NS: arm_sysreg = 291;
pub const arm_sysreg_ARM_SYSREG_SP_NS: arm_sysreg = 292;
pub const arm_sysreg_ARM_SYSREG_R8_USR: arm_sysreg = 293;
pub const arm_sysreg_ARM_SYSREG_R9_USR: arm_sysreg = 294;
pub const arm_sysreg_ARM_SYSREG_R10_USR: arm_sysreg = 295;
pub const arm_sysreg_ARM_SYSREG_R11_USR: arm_sysreg = 296;
pub const arm_sysreg_ARM_SYSREG_R12_USR: arm_sysreg = 297;
pub const arm_sysreg_ARM_SYSREG_SP_USR: arm_sysreg = 298;
pub const arm_sysreg_ARM_SYSREG_LR_USR: arm_sysreg = 299;
pub const arm_sysreg_ARM_SYSREG_R8_FIQ: arm_sysreg = 300;
pub const arm_sysreg_ARM_SYSREG_R9_FIQ: arm_sysreg = 301;
pub const arm_sysreg_ARM_SYSREG_R10_FIQ: arm_sysreg = 302;
pub const arm_sysreg_ARM_SYSREG_R11_FIQ: arm_sysreg = 303;
pub const arm_sysreg_ARM_SYSREG_R12_FIQ: arm_sysreg = 304;
pub const arm_sysreg_ARM_SYSREG_SP_FIQ: arm_sysreg = 305;
pub const arm_sysreg_ARM_SYSREG_LR_FIQ: arm_sysreg = 306;
pub const arm_sysreg_ARM_SYSREG_LR_IRQ: arm_sysreg = 307;
pub const arm_sysreg_ARM_SYSREG_SP_IRQ: arm_sysreg = 308;
pub const arm_sysreg_ARM_SYSREG_LR_SVC: arm_sysreg = 309;
pub const arm_sysreg_ARM_SYSREG_SP_SVC: arm_sysreg = 310;
pub const arm_sysreg_ARM_SYSREG_LR_ABT: arm_sysreg = 311;
pub const arm_sysreg_ARM_SYSREG_SP_ABT: arm_sysreg = 312;
pub const arm_sysreg_ARM_SYSREG_LR_UND: arm_sysreg = 313;
pub const arm_sysreg_ARM_SYSREG_SP_UND: arm_sysreg = 314;
pub const arm_sysreg_ARM_SYSREG_LR_MON: arm_sysreg = 315;
pub const arm_sysreg_ARM_SYSREG_SP_MON: arm_sysreg = 316;
pub const arm_sysreg_ARM_SYSREG_ELR_HYP: arm_sysreg = 317;
pub const arm_sysreg_ARM_SYSREG_SP_HYP: arm_sysreg = 318;
pub const arm_sysreg_ARM_SYSREG_SPSR_FIQ: arm_sysreg = 319;
pub const arm_sysreg_ARM_SYSREG_SPSR_IRQ: arm_sysreg = 320;
pub const arm_sysreg_ARM_SYSREG_SPSR_SVC: arm_sysreg = 321;
pub const arm_sysreg_ARM_SYSREG_SPSR_ABT: arm_sysreg = 322;
pub const arm_sysreg_ARM_SYSREG_SPSR_UND: arm_sysreg = 323;
pub const arm_sysreg_ARM_SYSREG_SPSR_MON: arm_sysreg = 324;
pub const arm_sysreg_ARM_SYSREG_SPSR_HYP: arm_sysreg = 325;
pub type arm_sysreg = cty::c_uint;
pub const arm_mem_barrier_ARM_MB_INVALID: arm_mem_barrier = 0;
pub const arm_mem_barrier_ARM_MB_RESERVED_0: arm_mem_barrier = 1;
pub const arm_mem_barrier_ARM_MB_OSHLD: arm_mem_barrier = 2;
pub const arm_mem_barrier_ARM_MB_OSHST: arm_mem_barrier = 3;
pub const arm_mem_barrier_ARM_MB_OSH: arm_mem_barrier = 4;
pub const arm_mem_barrier_ARM_MB_RESERVED_4: arm_mem_barrier = 5;
pub const arm_mem_barrier_ARM_MB_NSHLD: arm_mem_barrier = 6;
pub const arm_mem_barrier_ARM_MB_NSHST: arm_mem_barrier = 7;
pub const arm_mem_barrier_ARM_MB_NSH: arm_mem_barrier = 8;
pub const arm_mem_barrier_ARM_MB_RESERVED_8: arm_mem_barrier = 9;
pub const arm_mem_barrier_ARM_MB_ISHLD: arm_mem_barrier = 10;
pub const arm_mem_barrier_ARM_MB_ISHST: arm_mem_barrier = 11;
pub const arm_mem_barrier_ARM_MB_ISH: arm_mem_barrier = 12;
pub const arm_mem_barrier_ARM_MB_RESERVED_12: arm_mem_barrier = 13;
pub const arm_mem_barrier_ARM_MB_LD: arm_mem_barrier = 14;
pub const arm_mem_barrier_ARM_MB_ST: arm_mem_barrier = 15;
pub const arm_mem_barrier_ARM_MB_SY: arm_mem_barrier = 16;
pub type arm_mem_barrier = cty::c_uint;
pub const arm_op_type_ARM_OP_INVALID: arm_op_type = 0;
pub const arm_op_type_ARM_OP_REG: arm_op_type = 1;
pub const arm_op_type_ARM_OP_IMM: arm_op_type = 2;
pub const arm_op_type_ARM_OP_MEM: arm_op_type = 3;
pub const arm_op_type_ARM_OP_FP: arm_op_type = 4;
pub const arm_op_type_ARM_OP_CIMM: arm_op_type = 64;
pub const arm_op_type_ARM_OP_PIMM: arm_op_type = 65;
pub const arm_op_type_ARM_OP_SETEND: arm_op_type = 66;
pub const arm_op_type_ARM_OP_SYSREG: arm_op_type = 67;
pub type arm_op_type = cty::c_uint;
pub const arm_setend_type_ARM_SETEND_INVALID: arm_setend_type = 0;
pub const arm_setend_type_ARM_SETEND_BE: arm_setend_type = 1;
pub const arm_setend_type_ARM_SETEND_LE: arm_setend_type = 2;
pub type arm_setend_type = cty::c_uint;
pub const arm_cpsmode_type_ARM_CPSMODE_INVALID: arm_cpsmode_type = 0;
pub const arm_cpsmode_type_ARM_CPSMODE_IE: arm_cpsmode_type = 2;
pub const arm_cpsmode_type_ARM_CPSMODE_ID: arm_cpsmode_type = 3;
pub type arm_cpsmode_type = cty::c_uint;
pub const arm_cpsflag_type_ARM_CPSFLAG_INVALID: arm_cpsflag_type = 0;
pub const arm_cpsflag_type_ARM_CPSFLAG_F: arm_cpsflag_type = 1;
pub const arm_cpsflag_type_ARM_CPSFLAG_I: arm_cpsflag_type = 2;
pub const arm_cpsflag_type_ARM_CPSFLAG_A: arm_cpsflag_type = 4;
pub const arm_cpsflag_type_ARM_CPSFLAG_NONE: arm_cpsflag_type = 16;
pub type arm_cpsflag_type = cty::c_uint;
pub const arm_vectordata_type_ARM_VECTORDATA_INVALID: arm_vectordata_type = 0;
pub const arm_vectordata_type_ARM_VECTORDATA_I8: arm_vectordata_type = 1;
pub const arm_vectordata_type_ARM_VECTORDATA_I16: arm_vectordata_type = 2;
pub const arm_vectordata_type_ARM_VECTORDATA_I32: arm_vectordata_type = 3;
pub const arm_vectordata_type_ARM_VECTORDATA_I64: arm_vectordata_type = 4;
pub const arm_vectordata_type_ARM_VECTORDATA_S8: arm_vectordata_type = 5;
pub const arm_vectordata_type_ARM_VECTORDATA_S16: arm_vectordata_type = 6;
pub const arm_vectordata_type_ARM_VECTORDATA_S32: arm_vectordata_type = 7;
pub const arm_vectordata_type_ARM_VECTORDATA_S64: arm_vectordata_type = 8;
pub const arm_vectordata_type_ARM_VECTORDATA_U8: arm_vectordata_type = 9;
pub const arm_vectordata_type_ARM_VECTORDATA_U16: arm_vectordata_type = 10;
pub const arm_vectordata_type_ARM_VECTORDATA_U32: arm_vectordata_type = 11;
pub const arm_vectordata_type_ARM_VECTORDATA_U64: arm_vectordata_type = 12;
pub const arm_vectordata_type_ARM_VECTORDATA_P8: arm_vectordata_type = 13;
pub const arm_vectordata_type_ARM_VECTORDATA_F16: arm_vectordata_type = 14;
pub const arm_vectordata_type_ARM_VECTORDATA_F32: arm_vectordata_type = 15;
pub const arm_vectordata_type_ARM_VECTORDATA_F64: arm_vectordata_type = 16;
pub const arm_vectordata_type_ARM_VECTORDATA_F16F64: arm_vectordata_type = 17;
pub const arm_vectordata_type_ARM_VECTORDATA_F64F16: arm_vectordata_type = 18;
pub const arm_vectordata_type_ARM_VECTORDATA_F32F16: arm_vectordata_type = 19;
pub const arm_vectordata_type_ARM_VECTORDATA_F16F32: arm_vectordata_type = 20;
pub const arm_vectordata_type_ARM_VECTORDATA_F64F32: arm_vectordata_type = 21;
pub const arm_vectordata_type_ARM_VECTORDATA_F32F64: arm_vectordata_type = 22;
pub const arm_vectordata_type_ARM_VECTORDATA_S32F32: arm_vectordata_type = 23;
pub const arm_vectordata_type_ARM_VECTORDATA_U32F32: arm_vectordata_type = 24;
pub const arm_vectordata_type_ARM_VECTORDATA_F32S32: arm_vectordata_type = 25;
pub const arm_vectordata_type_ARM_VECTORDATA_F32U32: arm_vectordata_type = 26;
pub const arm_vectordata_type_ARM_VECTORDATA_F64S16: arm_vectordata_type = 27;
pub const arm_vectordata_type_ARM_VECTORDATA_F32S16: arm_vectordata_type = 28;
pub const arm_vectordata_type_ARM_VECTORDATA_F64S32: arm_vectordata_type = 29;
pub const arm_vectordata_type_ARM_VECTORDATA_S16F64: arm_vectordata_type = 30;
pub const arm_vectordata_type_ARM_VECTORDATA_S16F32: arm_vectordata_type = 31;
pub const arm_vectordata_type_ARM_VECTORDATA_S32F64: arm_vectordata_type = 32;
pub const arm_vectordata_type_ARM_VECTORDATA_U16F64: arm_vectordata_type = 33;
pub const arm_vectordata_type_ARM_VECTORDATA_U16F32: arm_vectordata_type = 34;
pub const arm_vectordata_type_ARM_VECTORDATA_U32F64: arm_vectordata_type = 35;
pub const arm_vectordata_type_ARM_VECTORDATA_F64U16: arm_vectordata_type = 36;
pub const arm_vectordata_type_ARM_VECTORDATA_F32U16: arm_vectordata_type = 37;
pub const arm_vectordata_type_ARM_VECTORDATA_F64U32: arm_vectordata_type = 38;
pub const arm_vectordata_type_ARM_VECTORDATA_F16U16: arm_vectordata_type = 39;
pub const arm_vectordata_type_ARM_VECTORDATA_U16F16: arm_vectordata_type = 40;
pub const arm_vectordata_type_ARM_VECTORDATA_F16U32: arm_vectordata_type = 41;
pub const arm_vectordata_type_ARM_VECTORDATA_U32F16: arm_vectordata_type = 42;
pub type arm_vectordata_type = cty::c_uint;
pub const arm_reg_ARM_REG_INVALID: arm_reg = 0;
pub const arm_reg_ARM_REG_APSR: arm_reg = 1;
pub const arm_reg_ARM_REG_APSR_NZCV: arm_reg = 2;
pub const arm_reg_ARM_REG_CPSR: arm_reg = 3;
pub const arm_reg_ARM_REG_FPEXC: arm_reg = 4;
pub const arm_reg_ARM_REG_FPINST: arm_reg = 5;
pub const arm_reg_ARM_REG_FPSCR: arm_reg = 6;
pub const arm_reg_ARM_REG_FPSCR_NZCV: arm_reg = 7;
pub const arm_reg_ARM_REG_FPSID: arm_reg = 8;
pub const arm_reg_ARM_REG_ITSTATE: arm_reg = 9;
pub const arm_reg_ARM_REG_LR: arm_reg = 10;
pub const arm_reg_ARM_REG_PC: arm_reg = 11;
pub const arm_reg_ARM_REG_SP: arm_reg = 12;
pub const arm_reg_ARM_REG_SPSR: arm_reg = 13;
pub const arm_reg_ARM_REG_D0: arm_reg = 14;
pub const arm_reg_ARM_REG_D1: arm_reg = 15;
pub const arm_reg_ARM_REG_D2: arm_reg = 16;
pub const arm_reg_ARM_REG_D3: arm_reg = 17;
pub const arm_reg_ARM_REG_D4: arm_reg = 18;
pub const arm_reg_ARM_REG_D5: arm_reg = 19;
pub const arm_reg_ARM_REG_D6: arm_reg = 20;
pub const arm_reg_ARM_REG_D7: arm_reg = 21;
pub const arm_reg_ARM_REG_D8: arm_reg = 22;
pub const arm_reg_ARM_REG_D9: arm_reg = 23;
pub const arm_reg_ARM_REG_D10: arm_reg = 24;
pub const arm_reg_ARM_REG_D11: arm_reg = 25;
pub const arm_reg_ARM_REG_D12: arm_reg = 26;
pub const arm_reg_ARM_REG_D13: arm_reg = 27;
pub const arm_reg_ARM_REG_D14: arm_reg = 28;
pub const arm_reg_ARM_REG_D15: arm_reg = 29;
pub const arm_reg_ARM_REG_D16: arm_reg = 30;
pub const arm_reg_ARM_REG_D17: arm_reg = 31;
pub const arm_reg_ARM_REG_D18: arm_reg = 32;
pub const arm_reg_ARM_REG_D19: arm_reg = 33;
pub const arm_reg_ARM_REG_D20: arm_reg = 34;
pub const arm_reg_ARM_REG_D21: arm_reg = 35;
pub const arm_reg_ARM_REG_D22: arm_reg = 36;
pub const arm_reg_ARM_REG_D23: arm_reg = 37;
pub const arm_reg_ARM_REG_D24: arm_reg = 38;
pub const arm_reg_ARM_REG_D25: arm_reg = 39;
pub const arm_reg_ARM_REG_D26: arm_reg = 40;
pub const arm_reg_ARM_REG_D27: arm_reg = 41;
pub const arm_reg_ARM_REG_D28: arm_reg = 42;
pub const arm_reg_ARM_REG_D29: arm_reg = 43;
pub const arm_reg_ARM_REG_D30: arm_reg = 44;
pub const arm_reg_ARM_REG_D31: arm_reg = 45;
pub const arm_reg_ARM_REG_FPINST2: arm_reg = 46;
pub const arm_reg_ARM_REG_MVFR0: arm_reg = 47;
pub const arm_reg_ARM_REG_MVFR1: arm_reg = 48;
pub const arm_reg_ARM_REG_MVFR2: arm_reg = 49;
pub const arm_reg_ARM_REG_Q0: arm_reg = 50;
pub const arm_reg_ARM_REG_Q1: arm_reg = 51;
pub const arm_reg_ARM_REG_Q2: arm_reg = 52;
pub const arm_reg_ARM_REG_Q3: arm_reg = 53;
pub const arm_reg_ARM_REG_Q4: arm_reg = 54;
pub const arm_reg_ARM_REG_Q5: arm_reg = 55;
pub const arm_reg_ARM_REG_Q6: arm_reg = 56;
pub const arm_reg_ARM_REG_Q7: arm_reg = 57;
pub const arm_reg_ARM_REG_Q8: arm_reg = 58;
pub const arm_reg_ARM_REG_Q9: arm_reg = 59;
pub const arm_reg_ARM_REG_Q10: arm_reg = 60;
pub const arm_reg_ARM_REG_Q11: arm_reg = 61;
pub const arm_reg_ARM_REG_Q12: arm_reg = 62;
pub const arm_reg_ARM_REG_Q13: arm_reg = 63;
pub const arm_reg_ARM_REG_Q14: arm_reg = 64;
pub const arm_reg_ARM_REG_Q15: arm_reg = 65;
pub const arm_reg_ARM_REG_R0: arm_reg = 66;
pub const arm_reg_ARM_REG_R1: arm_reg = 67;
pub const arm_reg_ARM_REG_R2: arm_reg = 68;
pub const arm_reg_ARM_REG_R3: arm_reg = 69;
pub const arm_reg_ARM_REG_R4: arm_reg = 70;
pub const arm_reg_ARM_REG_R5: arm_reg = 71;
pub const arm_reg_ARM_REG_R6: arm_reg = 72;
pub const arm_reg_ARM_REG_R7: arm_reg = 73;
pub const arm_reg_ARM_REG_R8: arm_reg = 74;
pub const arm_reg_ARM_REG_R9: arm_reg = 75;
pub const arm_reg_ARM_REG_R10: arm_reg = 76;
pub const arm_reg_ARM_REG_R11: arm_reg = 77;
pub const arm_reg_ARM_REG_R12: arm_reg = 78;
pub const arm_reg_ARM_REG_S0: arm_reg = 79;
pub const arm_reg_ARM_REG_S1: arm_reg = 80;
pub const arm_reg_ARM_REG_S2: arm_reg = 81;
pub const arm_reg_ARM_REG_S3: arm_reg = 82;
pub const arm_reg_ARM_REG_S4: arm_reg = 83;
pub const arm_reg_ARM_REG_S5: arm_reg = 84;
pub const arm_reg_ARM_REG_S6: arm_reg = 85;
pub const arm_reg_ARM_REG_S7: arm_reg = 86;
pub const arm_reg_ARM_REG_S8: arm_reg = 87;
pub const arm_reg_ARM_REG_S9: arm_reg = 88;
pub const arm_reg_ARM_REG_S10: arm_reg = 89;
pub const arm_reg_ARM_REG_S11: arm_reg = 90;
pub const arm_reg_ARM_REG_S12: arm_reg = 91;
pub const arm_reg_ARM_REG_S13: arm_reg = 92;
pub const arm_reg_ARM_REG_S14: arm_reg = 93;
pub const arm_reg_ARM_REG_S15: arm_reg = 94;
pub const arm_reg_ARM_REG_S16: arm_reg = 95;
pub const arm_reg_ARM_REG_S17: arm_reg = 96;
pub const arm_reg_ARM_REG_S18: arm_reg = 97;
pub const arm_reg_ARM_REG_S19: arm_reg = 98;
pub const arm_reg_ARM_REG_S20: arm_reg = 99;
pub const arm_reg_ARM_REG_S21: arm_reg = 100;
pub const arm_reg_ARM_REG_S22: arm_reg = 101;
pub const arm_reg_ARM_REG_S23: arm_reg = 102;
pub const arm_reg_ARM_REG_S24: arm_reg = 103;
pub const arm_reg_ARM_REG_S25: arm_reg = 104;
pub const arm_reg_ARM_REG_S26: arm_reg = 105;
pub const arm_reg_ARM_REG_S27: arm_reg = 106;
pub const arm_reg_ARM_REG_S28: arm_reg = 107;
pub const arm_reg_ARM_REG_S29: arm_reg = 108;
pub const arm_reg_ARM_REG_S30: arm_reg = 109;
pub const arm_reg_ARM_REG_S31: arm_reg = 110;
pub const arm_reg_ARM_REG_ENDING: arm_reg = 111;
pub const arm_reg_ARM_REG_R13: arm_reg = 12;
pub const arm_reg_ARM_REG_R14: arm_reg = 10;
pub const arm_reg_ARM_REG_R15: arm_reg = 11;
pub const arm_reg_ARM_REG_SB: arm_reg = 75;
pub const arm_reg_ARM_REG_SL: arm_reg = 76;
pub const arm_reg_ARM_REG_FP: arm_reg = 77;
pub const arm_reg_ARM_REG_IP: arm_reg = 78;
pub type arm_reg = cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arm_op_mem {
    pub base: arm_reg,
    pub index: arm_reg,
    pub scale: cty::c_int,
    pub disp: cty::c_int,
    pub lshift: cty::c_int,
}
const _: () = {
    ["Size of arm_op_mem"][::std::mem::size_of::<arm_op_mem>() - 20usize];
    ["Alignment of arm_op_mem"][::std::mem::align_of::<arm_op_mem>() - 4usize];
    ["Offset of field: arm_op_mem::base"][::std::mem::offset_of!(arm_op_mem, base) - 0usize];
    ["Offset of field: arm_op_mem::index"][::std::mem::offset_of!(arm_op_mem, index) - 4usize];
    ["Offset of field: arm_op_mem::scale"][::std::mem::offset_of!(arm_op_mem, scale) - 8usize];
    ["Offset of field: arm_op_mem::disp"][::std::mem::offset_of!(arm_op_mem, disp) - 12usize];
    ["Offset of field: arm_op_mem::lshift"][::std::mem::offset_of!(arm_op_mem, lshift) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cs_arm_op {
    pub vector_index: cty::c_int,
    pub shift: cs_arm_op__bindgen_ty_1,
    pub type_: arm_op_type,
    pub __bindgen_anon_1: cs_arm_op__bindgen_ty_2,
    pub subtracted: bool,
    pub access: u8,
    pub neon_lane: i8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_arm_op__bindgen_ty_1 {
    pub type_: arm_shifter,
    pub value: cty::c_uint,
}
const _: () = {
    ["Size of cs_arm_op__bindgen_ty_1"][::std::mem::size_of::<cs_arm_op__bindgen_ty_1>() - 8usize];
    ["Alignment of cs_arm_op__bindgen_ty_1"]
        [::std::mem::align_of::<cs_arm_op__bindgen_ty_1>() - 4usize];
    ["Offset of field: cs_arm_op__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: cs_arm_op__bindgen_ty_1::value"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_1, value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cs_arm_op__bindgen_ty_2 {
    pub reg: cty::c_int,
    pub imm: i32,
    pub fp: f64,
    pub mem: arm_op_mem,
    pub setend: arm_setend_type,
}
const _: () = {
    ["Size of cs_arm_op__bindgen_ty_2"][::std::mem::size_of::<cs_arm_op__bindgen_ty_2>() - 24usize];
    ["Alignment of cs_arm_op__bindgen_ty_2"]
        [::std::mem::align_of::<cs_arm_op__bindgen_ty_2>() - 8usize];
    ["Offset of field: cs_arm_op__bindgen_ty_2::reg"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_2, reg) - 0usize];
    ["Offset of field: cs_arm_op__bindgen_ty_2::imm"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_2, imm) - 0usize];
    ["Offset of field: cs_arm_op__bindgen_ty_2::fp"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_2, fp) - 0usize];
    ["Offset of field: cs_arm_op__bindgen_ty_2::mem"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_2, mem) - 0usize];
    ["Offset of field: cs_arm_op__bindgen_ty_2::setend"]
        [::std::mem::offset_of!(cs_arm_op__bindgen_ty_2, setend) - 0usize];
};
const _: () = {
    ["Size of cs_arm_op"][::std::mem::size_of::<cs_arm_op>() - 48usize];
    ["Alignment of cs_arm_op"][::std::mem::align_of::<cs_arm_op>() - 8usize];
    ["Offset of field: cs_arm_op::vector_index"]
        [::std::mem::offset_of!(cs_arm_op, vector_index) - 0usize];
    ["Offset of field: cs_arm_op::shift"][::std::mem::offset_of!(cs_arm_op, shift) - 4usize];
    ["Offset of field: cs_arm_op::type_"][::std::mem::offset_of!(cs_arm_op, type_) - 12usize];
    ["Offset of field: cs_arm_op::subtracted"]
        [::std::mem::offset_of!(cs_arm_op, subtracted) - 40usize];
    ["Offset of field: cs_arm_op::access"][::std::mem::offset_of!(cs_arm_op, access) - 41usize];
    ["Offset of field: cs_arm_op::neon_lane"]
        [::std::mem::offset_of!(cs_arm_op, neon_lane) - 42usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cs_arm {
    pub usermode: bool,
    pub vector_size: cty::c_int,
    pub vector_data: arm_vectordata_type,
    pub cps_mode: arm_cpsmode_type,
    pub cps_flag: arm_cpsflag_type,
    pub cc: arm_cc,
    pub update_flags: bool,
    pub writeback: bool,
    pub post_index: bool,
    pub mem_barrier: arm_mem_barrier,
    pub op_count: u8,
    pub operands: [cs_arm_op; 36usize],
}
const _: () = {
    ["Size of cs_arm"][::std::mem::size_of::<cs_arm>() - 1768usize];
    ["Alignment of cs_arm"][::std::mem::align_of::<cs_arm>() - 8usize];
    ["Offset of field: cs_arm::usermode"][::std::mem::offset_of!(cs_arm, usermode) - 0usize];
    ["Offset of field: cs_arm::vector_size"][::std::mem::offset_of!(cs_arm, vector_size) - 4usize];
    ["Offset of field: cs_arm::vector_data"][::std::mem::offset_of!(cs_arm, vector_data) - 8usize];
    ["Offset of field: cs_arm::cps_mode"][::std::mem::offset_of!(cs_arm, cps_mode) - 12usize];
    ["Offset of field: cs_arm::cps_flag"][::std::mem::offset_of!(cs_arm, cps_flag) - 16usize];
    ["Offset of field: cs_arm::cc"][::std::mem::offset_of!(cs_arm, cc) - 20usize];
    ["Offset of field: cs_arm::update_flags"]
        [::std::mem::offset_of!(cs_arm, update_flags) - 24usize];
    ["Offset of field: cs_arm::writeback"][::std::mem::offset_of!(cs_arm, writeback) - 25usize];
    ["Offset of field: cs_arm::post_index"][::std::mem::offset_of!(cs_arm, post_index) - 26usize];
    ["Offset of field: cs_arm::mem_barrier"][::std::mem::offset_of!(cs_arm, mem_barrier) - 28usize];
    ["Offset of field: cs_arm::op_count"][::std::mem::offset_of!(cs_arm, op_count) - 32usize];
    ["Offset of field: cs_arm::operands"][::std::mem::offset_of!(cs_arm, operands) - 40usize];
};
pub const arm_insn_ARM_INS_INVALID: arm_insn = 0;
pub const arm_insn_ARM_INS_ADC: arm_insn = 1;
pub const arm_insn_ARM_INS_ADD: arm_insn = 2;
pub const arm_insn_ARM_INS_ADDW: arm_insn = 3;
pub const arm_insn_ARM_INS_ADR: arm_insn = 4;
pub const arm_insn_ARM_INS_AESD: arm_insn = 5;
pub const arm_insn_ARM_INS_AESE: arm_insn = 6;
pub const arm_insn_ARM_INS_AESIMC: arm_insn = 7;
pub const arm_insn_ARM_INS_AESMC: arm_insn = 8;
pub const arm_insn_ARM_INS_AND: arm_insn = 9;
pub const arm_insn_ARM_INS_ASR: arm_insn = 10;
pub const arm_insn_ARM_INS_B: arm_insn = 11;
pub const arm_insn_ARM_INS_BFC: arm_insn = 12;
pub const arm_insn_ARM_INS_BFI: arm_insn = 13;
pub const arm_insn_ARM_INS_BIC: arm_insn = 14;
pub const arm_insn_ARM_INS_BKPT: arm_insn = 15;
pub const arm_insn_ARM_INS_BL: arm_insn = 16;
pub const arm_insn_ARM_INS_BLX: arm_insn = 17;
pub const arm_insn_ARM_INS_BLXNS: arm_insn = 18;
pub const arm_insn_ARM_INS_BX: arm_insn = 19;
pub const arm_insn_ARM_INS_BXJ: arm_insn = 20;
pub const arm_insn_ARM_INS_BXNS: arm_insn = 21;
pub const arm_insn_ARM_INS_CBNZ: arm_insn = 22;
pub const arm_insn_ARM_INS_CBZ: arm_insn = 23;
pub const arm_insn_ARM_INS_CDP: arm_insn = 24;
pub const arm_insn_ARM_INS_CDP2: arm_insn = 25;
pub const arm_insn_ARM_INS_CLREX: arm_insn = 26;
pub const arm_insn_ARM_INS_CLZ: arm_insn = 27;
pub const arm_insn_ARM_INS_CMN: arm_insn = 28;
pub const arm_insn_ARM_INS_CMP: arm_insn = 29;
pub const arm_insn_ARM_INS_CPS: arm_insn = 30;
pub const arm_insn_ARM_INS_CRC32B: arm_insn = 31;
pub const arm_insn_ARM_INS_CRC32CB: arm_insn = 32;
pub const arm_insn_ARM_INS_CRC32CH: arm_insn = 33;
pub const arm_insn_ARM_INS_CRC32CW: arm_insn = 34;
pub const arm_insn_ARM_INS_CRC32H: arm_insn = 35;
pub const arm_insn_ARM_INS_CRC32W: arm_insn = 36;
pub const arm_insn_ARM_INS_CSDB: arm_insn = 37;
pub const arm_insn_ARM_INS_DBG: arm_insn = 38;
pub const arm_insn_ARM_INS_DCPS1: arm_insn = 39;
pub const arm_insn_ARM_INS_DCPS2: arm_insn = 40;
pub const arm_insn_ARM_INS_DCPS3: arm_insn = 41;
pub const arm_insn_ARM_INS_DFB: arm_insn = 42;
pub const arm_insn_ARM_INS_DMB: arm_insn = 43;
pub const arm_insn_ARM_INS_DSB: arm_insn = 44;
pub const arm_insn_ARM_INS_EOR: arm_insn = 45;
pub const arm_insn_ARM_INS_ERET: arm_insn = 46;
pub const arm_insn_ARM_INS_ESB: arm_insn = 47;
pub const arm_insn_ARM_INS_FADDD: arm_insn = 48;
pub const arm_insn_ARM_INS_FADDS: arm_insn = 49;
pub const arm_insn_ARM_INS_FCMPZD: arm_insn = 50;
pub const arm_insn_ARM_INS_FCMPZS: arm_insn = 51;
pub const arm_insn_ARM_INS_FCONSTD: arm_insn = 52;
pub const arm_insn_ARM_INS_FCONSTS: arm_insn = 53;
pub const arm_insn_ARM_INS_FLDMDBX: arm_insn = 54;
pub const arm_insn_ARM_INS_FLDMIAX: arm_insn = 55;
pub const arm_insn_ARM_INS_FMDHR: arm_insn = 56;
pub const arm_insn_ARM_INS_FMDLR: arm_insn = 57;
pub const arm_insn_ARM_INS_FMSTAT: arm_insn = 58;
pub const arm_insn_ARM_INS_FSTMDBX: arm_insn = 59;
pub const arm_insn_ARM_INS_FSTMIAX: arm_insn = 60;
pub const arm_insn_ARM_INS_FSUBD: arm_insn = 61;
pub const arm_insn_ARM_INS_FSUBS: arm_insn = 62;
pub const arm_insn_ARM_INS_HINT: arm_insn = 63;
pub const arm_insn_ARM_INS_HLT: arm_insn = 64;
pub const arm_insn_ARM_INS_HVC: arm_insn = 65;
pub const arm_insn_ARM_INS_ISB: arm_insn = 66;
pub const arm_insn_ARM_INS_IT: arm_insn = 67;
pub const arm_insn_ARM_INS_LDA: arm_insn = 68;
pub const arm_insn_ARM_INS_LDAB: arm_insn = 69;
pub const arm_insn_ARM_INS_LDAEX: arm_insn = 70;
pub const arm_insn_ARM_INS_LDAEXB: arm_insn = 71;
pub const arm_insn_ARM_INS_LDAEXD: arm_insn = 72;
pub const arm_insn_ARM_INS_LDAEXH: arm_insn = 73;
pub const arm_insn_ARM_INS_LDAH: arm_insn = 74;
pub const arm_insn_ARM_INS_LDC: arm_insn = 75;
pub const arm_insn_ARM_INS_LDC2: arm_insn = 76;
pub const arm_insn_ARM_INS_LDC2L: arm_insn = 77;
pub const arm_insn_ARM_INS_LDCL: arm_insn = 78;
pub const arm_insn_ARM_INS_LDM: arm_insn = 79;
pub const arm_insn_ARM_INS_LDMDA: arm_insn = 80;
pub const arm_insn_ARM_INS_LDMDB: arm_insn = 81;
pub const arm_insn_ARM_INS_LDMIB: arm_insn = 82;
pub const arm_insn_ARM_INS_LDR: arm_insn = 83;
pub const arm_insn_ARM_INS_LDRB: arm_insn = 84;
pub const arm_insn_ARM_INS_LDRBT: arm_insn = 85;
pub const arm_insn_ARM_INS_LDRD: arm_insn = 86;
pub const arm_insn_ARM_INS_LDREX: arm_insn = 87;
pub const arm_insn_ARM_INS_LDREXB: arm_insn = 88;
pub const arm_insn_ARM_INS_LDREXD: arm_insn = 89;
pub const arm_insn_ARM_INS_LDREXH: arm_insn = 90;
pub const arm_insn_ARM_INS_LDRH: arm_insn = 91;
pub const arm_insn_ARM_INS_LDRHT: arm_insn = 92;
pub const arm_insn_ARM_INS_LDRSB: arm_insn = 93;
pub const arm_insn_ARM_INS_LDRSBT: arm_insn = 94;
pub const arm_insn_ARM_INS_LDRSH: arm_insn = 95;
pub const arm_insn_ARM_INS_LDRSHT: arm_insn = 96;
pub const arm_insn_ARM_INS_LDRT: arm_insn = 97;
pub const arm_insn_ARM_INS_LSL: arm_insn = 98;
pub const arm_insn_ARM_INS_LSR: arm_insn = 99;
pub const arm_insn_ARM_INS_MCR: arm_insn = 100;
pub const arm_insn_ARM_INS_MCR2: arm_insn = 101;
pub const arm_insn_ARM_INS_MCRR: arm_insn = 102;
pub const arm_insn_ARM_INS_MCRR2: arm_insn = 103;
pub const arm_insn_ARM_INS_MLA: arm_insn = 104;
pub const arm_insn_ARM_INS_MLS: arm_insn = 105;
pub const arm_insn_ARM_INS_MOV: arm_insn = 106;
pub const arm_insn_ARM_INS_MOVS: arm_insn = 107;
pub const arm_insn_ARM_INS_MOVT: arm_insn = 108;
pub const arm_insn_ARM_INS_MOVW: arm_insn = 109;
pub const arm_insn_ARM_INS_MRC: arm_insn = 110;
pub const arm_insn_ARM_INS_MRC2: arm_insn = 111;
pub const arm_insn_ARM_INS_MRRC: arm_insn = 112;
pub const arm_insn_ARM_INS_MRRC2: arm_insn = 113;
pub const arm_insn_ARM_INS_MRS: arm_insn = 114;
pub const arm_insn_ARM_INS_MSR: arm_insn = 115;
pub const arm_insn_ARM_INS_MUL: arm_insn = 116;
pub const arm_insn_ARM_INS_MVN: arm_insn = 117;
pub const arm_insn_ARM_INS_NEG: arm_insn = 118;
pub const arm_insn_ARM_INS_NOP: arm_insn = 119;
pub const arm_insn_ARM_INS_ORN: arm_insn = 120;
pub const arm_insn_ARM_INS_ORR: arm_insn = 121;
pub const arm_insn_ARM_INS_PKHBT: arm_insn = 122;
pub const arm_insn_ARM_INS_PKHTB: arm_insn = 123;
pub const arm_insn_ARM_INS_PLD: arm_insn = 124;
pub const arm_insn_ARM_INS_PLDW: arm_insn = 125;
pub const arm_insn_ARM_INS_PLI: arm_insn = 126;
pub const arm_insn_ARM_INS_POP: arm_insn = 127;
pub const arm_insn_ARM_INS_PUSH: arm_insn = 128;
pub const arm_insn_ARM_INS_QADD: arm_insn = 129;
pub const arm_insn_ARM_INS_QADD16: arm_insn = 130;
pub const arm_insn_ARM_INS_QADD8: arm_insn = 131;
pub const arm_insn_ARM_INS_QASX: arm_insn = 132;
pub const arm_insn_ARM_INS_QDADD: arm_insn = 133;
pub const arm_insn_ARM_INS_QDSUB: arm_insn = 134;
pub const arm_insn_ARM_INS_QSAX: arm_insn = 135;
pub const arm_insn_ARM_INS_QSUB: arm_insn = 136;
pub const arm_insn_ARM_INS_QSUB16: arm_insn = 137;
pub const arm_insn_ARM_INS_QSUB8: arm_insn = 138;
pub const arm_insn_ARM_INS_RBIT: arm_insn = 139;
pub const arm_insn_ARM_INS_REV: arm_insn = 140;
pub const arm_insn_ARM_INS_REV16: arm_insn = 141;
pub const arm_insn_ARM_INS_REVSH: arm_insn = 142;
pub const arm_insn_ARM_INS_RFEDA: arm_insn = 143;
pub const arm_insn_ARM_INS_RFEDB: arm_insn = 144;
pub const arm_insn_ARM_INS_RFEIA: arm_insn = 145;
pub const arm_insn_ARM_INS_RFEIB: arm_insn = 146;
pub const arm_insn_ARM_INS_ROR: arm_insn = 147;
pub const arm_insn_ARM_INS_RRX: arm_insn = 148;
pub const arm_insn_ARM_INS_RSB: arm_insn = 149;
pub const arm_insn_ARM_INS_RSC: arm_insn = 150;
pub const arm_insn_ARM_INS_SADD16: arm_insn = 151;
pub const arm_insn_ARM_INS_SADD8: arm_insn = 152;
pub const arm_insn_ARM_INS_SASX: arm_insn = 153;
pub const arm_insn_ARM_INS_SBC: arm_insn = 154;
pub const arm_insn_ARM_INS_SBFX: arm_insn = 155;
pub const arm_insn_ARM_INS_SDIV: arm_insn = 156;
pub const arm_insn_ARM_INS_SEL: arm_insn = 157;
pub const arm_insn_ARM_INS_SETEND: arm_insn = 158;
pub const arm_insn_ARM_INS_SETPAN: arm_insn = 159;
pub const arm_insn_ARM_INS_SEV: arm_insn = 160;
pub const arm_insn_ARM_INS_SEVL: arm_insn = 161;
pub const arm_insn_ARM_INS_SG: arm_insn = 162;
pub const arm_insn_ARM_INS_SHA1C: arm_insn = 163;
pub const arm_insn_ARM_INS_SHA1H: arm_insn = 164;
pub const arm_insn_ARM_INS_SHA1M: arm_insn = 165;
pub const arm_insn_ARM_INS_SHA1P: arm_insn = 166;
pub const arm_insn_ARM_INS_SHA1SU0: arm_insn = 167;
pub const arm_insn_ARM_INS_SHA1SU1: arm_insn = 168;
pub const arm_insn_ARM_INS_SHA256H: arm_insn = 169;
pub const arm_insn_ARM_INS_SHA256H2: arm_insn = 170;
pub const arm_insn_ARM_INS_SHA256SU0: arm_insn = 171;
pub const arm_insn_ARM_INS_SHA256SU1: arm_insn = 172;
pub const arm_insn_ARM_INS_SHADD16: arm_insn = 173;
pub const arm_insn_ARM_INS_SHADD8: arm_insn = 174;
pub const arm_insn_ARM_INS_SHASX: arm_insn = 175;
pub const arm_insn_ARM_INS_SHSAX: arm_insn = 176;
pub const arm_insn_ARM_INS_SHSUB16: arm_insn = 177;
pub const arm_insn_ARM_INS_SHSUB8: arm_insn = 178;
pub const arm_insn_ARM_INS_SMC: arm_insn = 179;
pub const arm_insn_ARM_INS_SMLABB: arm_insn = 180;
pub const arm_insn_ARM_INS_SMLABT: arm_insn = 181;
pub const arm_insn_ARM_INS_SMLAD: arm_insn = 182;
pub const arm_insn_ARM_INS_SMLADX: arm_insn = 183;
pub const arm_insn_ARM_INS_SMLAL: arm_insn = 184;
pub const arm_insn_ARM_INS_SMLALBB: arm_insn = 185;
pub const arm_insn_ARM_INS_SMLALBT: arm_insn = 186;
pub const arm_insn_ARM_INS_SMLALD: arm_insn = 187;
pub const arm_insn_ARM_INS_SMLALDX: arm_insn = 188;
pub const arm_insn_ARM_INS_SMLALTB: arm_insn = 189;
pub const arm_insn_ARM_INS_SMLALTT: arm_insn = 190;
pub const arm_insn_ARM_INS_SMLATB: arm_insn = 191;
pub const arm_insn_ARM_INS_SMLATT: arm_insn = 192;
pub const arm_insn_ARM_INS_SMLAWB: arm_insn = 193;
pub const arm_insn_ARM_INS_SMLAWT: arm_insn = 194;
pub const arm_insn_ARM_INS_SMLSD: arm_insn = 195;
pub const arm_insn_ARM_INS_SMLSDX: arm_insn = 196;
pub const arm_insn_ARM_INS_SMLSLD: arm_insn = 197;
pub const arm_insn_ARM_INS_SMLSLDX: arm_insn = 198;
pub const arm_insn_ARM_INS_SMMLA: arm_insn = 199;
pub const arm_insn_ARM_INS_SMMLAR: arm_insn = 200;
pub const arm_insn_ARM_INS_SMMLS: arm_insn = 201;
pub const arm_insn_ARM_INS_SMMLSR: arm_insn = 202;
pub const arm_insn_ARM_INS_SMMUL: arm_insn = 203;
pub const arm_insn_ARM_INS_SMMULR: arm_insn = 204;
pub const arm_insn_ARM_INS_SMUAD: arm_insn = 205;
pub const arm_insn_ARM_INS_SMUADX: arm_insn = 206;
pub const arm_insn_ARM_INS_SMULBB: arm_insn = 207;
pub const arm_insn_ARM_INS_SMULBT: arm_insn = 208;
pub const arm_insn_ARM_INS_SMULL: arm_insn = 209;
pub const arm_insn_ARM_INS_SMULTB: arm_insn = 210;
pub const arm_insn_ARM_INS_SMULTT: arm_insn = 211;
pub const arm_insn_ARM_INS_SMULWB: arm_insn = 212;
pub const arm_insn_ARM_INS_SMULWT: arm_insn = 213;
pub const arm_insn_ARM_INS_SMUSD: arm_insn = 214;
pub const arm_insn_ARM_INS_SMUSDX: arm_insn = 215;
pub const arm_insn_ARM_INS_SRSDA: arm_insn = 216;
pub const arm_insn_ARM_INS_SRSDB: arm_insn = 217;
pub const arm_insn_ARM_INS_SRSIA: arm_insn = 218;
pub const arm_insn_ARM_INS_SRSIB: arm_insn = 219;
pub const arm_insn_ARM_INS_SSAT: arm_insn = 220;
pub const arm_insn_ARM_INS_SSAT16: arm_insn = 221;
pub const arm_insn_ARM_INS_SSAX: arm_insn = 222;
pub const arm_insn_ARM_INS_SSUB16: arm_insn = 223;
pub const arm_insn_ARM_INS_SSUB8: arm_insn = 224;
pub const arm_insn_ARM_INS_STC: arm_insn = 225;
pub const arm_insn_ARM_INS_STC2: arm_insn = 226;
pub const arm_insn_ARM_INS_STC2L: arm_insn = 227;
pub const arm_insn_ARM_INS_STCL: arm_insn = 228;
pub const arm_insn_ARM_INS_STL: arm_insn = 229;
pub const arm_insn_ARM_INS_STLB: arm_insn = 230;
pub const arm_insn_ARM_INS_STLEX: arm_insn = 231;
pub const arm_insn_ARM_INS_STLEXB: arm_insn = 232;
pub const arm_insn_ARM_INS_STLEXD: arm_insn = 233;
pub const arm_insn_ARM_INS_STLEXH: arm_insn = 234;
pub const arm_insn_ARM_INS_STLH: arm_insn = 235;
pub const arm_insn_ARM_INS_STM: arm_insn = 236;
pub const arm_insn_ARM_INS_STMDA: arm_insn = 237;
pub const arm_insn_ARM_INS_STMDB: arm_insn = 238;
pub const arm_insn_ARM_INS_STMIB: arm_insn = 239;
pub const arm_insn_ARM_INS_STR: arm_insn = 240;
pub const arm_insn_ARM_INS_STRB: arm_insn = 241;
pub const arm_insn_ARM_INS_STRBT: arm_insn = 242;
pub const arm_insn_ARM_INS_STRD: arm_insn = 243;
pub const arm_insn_ARM_INS_STREX: arm_insn = 244;
pub const arm_insn_ARM_INS_STREXB: arm_insn = 245;
pub const arm_insn_ARM_INS_STREXD: arm_insn = 246;
pub const arm_insn_ARM_INS_STREXH: arm_insn = 247;
pub const arm_insn_ARM_INS_STRH: arm_insn = 248;
pub const arm_insn_ARM_INS_STRHT: arm_insn = 249;
pub const arm_insn_ARM_INS_STRT: arm_insn = 250;
pub const arm_insn_ARM_INS_SUB: arm_insn = 251;
pub const arm_insn_ARM_INS_SUBS: arm_insn = 252;
pub const arm_insn_ARM_INS_SUBW: arm_insn = 253;
pub const arm_insn_ARM_INS_SVC: arm_insn = 254;
pub const arm_insn_ARM_INS_SWP: arm_insn = 255;
pub const arm_insn_ARM_INS_SWPB: arm_insn = 256;
pub const arm_insn_ARM_INS_SXTAB: arm_insn = 257;
pub const arm_insn_ARM_INS_SXTAB16: arm_insn = 258;
pub const arm_insn_ARM_INS_SXTAH: arm_insn = 259;
pub const arm_insn_ARM_INS_SXTB: arm_insn = 260;
pub const arm_insn_ARM_INS_SXTB16: arm_insn = 261;
pub const arm_insn_ARM_INS_SXTH: arm_insn = 262;
pub const arm_insn_ARM_INS_TBB: arm_insn = 263;
pub const arm_insn_ARM_INS_TBH: arm_insn = 264;
pub const arm_insn_ARM_INS_TEQ: arm_insn = 265;
pub const arm_insn_ARM_INS_TRAP: arm_insn = 266;
pub const arm_insn_ARM_INS_TSB: arm_insn = 267;
pub const arm_insn_ARM_INS_TST: arm_insn = 268;
pub const arm_insn_ARM_INS_TT: arm_insn = 269;
pub const arm_insn_ARM_INS_TTA: arm_insn = 270;
pub const arm_insn_ARM_INS_TTAT: arm_insn = 271;
pub const arm_insn_ARM_INS_TTT: arm_insn = 272;
pub const arm_insn_ARM_INS_UADD16: arm_insn = 273;
pub const arm_insn_ARM_INS_UADD8: arm_insn = 274;
pub const arm_insn_ARM_INS_UASX: arm_insn = 275;
pub const arm_insn_ARM_INS_UBFX: arm_insn = 276;
pub const arm_insn_ARM_INS_UDF: arm_insn = 277;
pub const arm_insn_ARM_INS_UDIV: arm_insn = 278;
pub const arm_insn_ARM_INS_UHADD16: arm_insn = 279;
pub const arm_insn_ARM_INS_UHADD8: arm_insn = 280;
pub const arm_insn_ARM_INS_UHASX: arm_insn = 281;
pub const arm_insn_ARM_INS_UHSAX: arm_insn = 282;
pub const arm_insn_ARM_INS_UHSUB16: arm_insn = 283;
pub const arm_insn_ARM_INS_UHSUB8: arm_insn = 284;
pub const arm_insn_ARM_INS_UMAAL: arm_insn = 285;
pub const arm_insn_ARM_INS_UMLAL: arm_insn = 286;
pub const arm_insn_ARM_INS_UMULL: arm_insn = 287;
pub const arm_insn_ARM_INS_UQADD16: arm_insn = 288;
pub const arm_insn_ARM_INS_UQADD8: arm_insn = 289;
pub const arm_insn_ARM_INS_UQASX: arm_insn = 290;
pub const arm_insn_ARM_INS_UQSAX: arm_insn = 291;
pub const arm_insn_ARM_INS_UQSUB16: arm_insn = 292;
pub const arm_insn_ARM_INS_UQSUB8: arm_insn = 293;
pub const arm_insn_ARM_INS_USAD8: arm_insn = 294;
pub const arm_insn_ARM_INS_USADA8: arm_insn = 295;
pub const arm_insn_ARM_INS_USAT: arm_insn = 296;
pub const arm_insn_ARM_INS_USAT16: arm_insn = 297;
pub const arm_insn_ARM_INS_USAX: arm_insn = 298;
pub const arm_insn_ARM_INS_USUB16: arm_insn = 299;
pub const arm_insn_ARM_INS_USUB8: arm_insn = 300;
pub const arm_insn_ARM_INS_UXTAB: arm_insn = 301;
pub const arm_insn_ARM_INS_UXTAB16: arm_insn = 302;
pub const arm_insn_ARM_INS_UXTAH: arm_insn = 303;
pub const arm_insn_ARM_INS_UXTB: arm_insn = 304;
pub const arm_insn_ARM_INS_UXTB16: arm_insn = 305;
pub const arm_insn_ARM_INS_UXTH: arm_insn = 306;
pub const arm_insn_ARM_INS_VABA: arm_insn = 307;
pub const arm_insn_ARM_INS_VABAL: arm_insn = 308;
pub const arm_insn_ARM_INS_VABD: arm_insn = 309;
pub const arm_insn_ARM_INS_VABDL: arm_insn = 310;
pub const arm_insn_ARM_INS_VABS: arm_insn = 311;
pub const arm_insn_ARM_INS_VACGE: arm_insn = 312;
pub const arm_insn_ARM_INS_VACGT: arm_insn = 313;
pub const arm_insn_ARM_INS_VACLE: arm_insn = 314;
pub const arm_insn_ARM_INS_VACLT: arm_insn = 315;
pub const arm_insn_ARM_INS_VADD: arm_insn = 316;
pub const arm_insn_ARM_INS_VADDHN: arm_insn = 317;
pub const arm_insn_ARM_INS_VADDL: arm_insn = 318;
pub const arm_insn_ARM_INS_VADDW: arm_insn = 319;
pub const arm_insn_ARM_INS_VAND: arm_insn = 320;
pub const arm_insn_ARM_INS_VBIC: arm_insn = 321;
pub const arm_insn_ARM_INS_VBIF: arm_insn = 322;
pub const arm_insn_ARM_INS_VBIT: arm_insn = 323;
pub const arm_insn_ARM_INS_VBSL: arm_insn = 324;
pub const arm_insn_ARM_INS_VCADD: arm_insn = 325;
pub const arm_insn_ARM_INS_VCEQ: arm_insn = 326;
pub const arm_insn_ARM_INS_VCGE: arm_insn = 327;
pub const arm_insn_ARM_INS_VCGT: arm_insn = 328;
pub const arm_insn_ARM_INS_VCLE: arm_insn = 329;
pub const arm_insn_ARM_INS_VCLS: arm_insn = 330;
pub const arm_insn_ARM_INS_VCLT: arm_insn = 331;
pub const arm_insn_ARM_INS_VCLZ: arm_insn = 332;
pub const arm_insn_ARM_INS_VCMLA: arm_insn = 333;
pub const arm_insn_ARM_INS_VCMP: arm_insn = 334;
pub const arm_insn_ARM_INS_VCMPE: arm_insn = 335;
pub const arm_insn_ARM_INS_VCNT: arm_insn = 336;
pub const arm_insn_ARM_INS_VCVT: arm_insn = 337;
pub const arm_insn_ARM_INS_VCVTA: arm_insn = 338;
pub const arm_insn_ARM_INS_VCVTB: arm_insn = 339;
pub const arm_insn_ARM_INS_VCVTM: arm_insn = 340;
pub const arm_insn_ARM_INS_VCVTN: arm_insn = 341;
pub const arm_insn_ARM_INS_VCVTP: arm_insn = 342;
pub const arm_insn_ARM_INS_VCVTR: arm_insn = 343;
pub const arm_insn_ARM_INS_VCVTT: arm_insn = 344;
pub const arm_insn_ARM_INS_VDIV: arm_insn = 345;
pub const arm_insn_ARM_INS_VDUP: arm_insn = 346;
pub const arm_insn_ARM_INS_VEOR: arm_insn = 347;
pub const arm_insn_ARM_INS_VEXT: arm_insn = 348;
pub const arm_insn_ARM_INS_VFMA: arm_insn = 349;
pub const arm_insn_ARM_INS_VFMS: arm_insn = 350;
pub const arm_insn_ARM_INS_VFNMA: arm_insn = 351;
pub const arm_insn_ARM_INS_VFNMS: arm_insn = 352;
pub const arm_insn_ARM_INS_VHADD: arm_insn = 353;
pub const arm_insn_ARM_INS_VHSUB: arm_insn = 354;
pub const arm_insn_ARM_INS_VINS: arm_insn = 355;
pub const arm_insn_ARM_INS_VJCVT: arm_insn = 356;
pub const arm_insn_ARM_INS_VLD1: arm_insn = 357;
pub const arm_insn_ARM_INS_VLD2: arm_insn = 358;
pub const arm_insn_ARM_INS_VLD3: arm_insn = 359;
pub const arm_insn_ARM_INS_VLD4: arm_insn = 360;
pub const arm_insn_ARM_INS_VLDMDB: arm_insn = 361;
pub const arm_insn_ARM_INS_VLDMIA: arm_insn = 362;
pub const arm_insn_ARM_INS_VLDR: arm_insn = 363;
pub const arm_insn_ARM_INS_VLLDM: arm_insn = 364;
pub const arm_insn_ARM_INS_VLSTM: arm_insn = 365;
pub const arm_insn_ARM_INS_VMAX: arm_insn = 366;
pub const arm_insn_ARM_INS_VMAXNM: arm_insn = 367;
pub const arm_insn_ARM_INS_VMIN: arm_insn = 368;
pub const arm_insn_ARM_INS_VMINNM: arm_insn = 369;
pub const arm_insn_ARM_INS_VMLA: arm_insn = 370;
pub const arm_insn_ARM_INS_VMLAL: arm_insn = 371;
pub const arm_insn_ARM_INS_VMLS: arm_insn = 372;
pub const arm_insn_ARM_INS_VMLSL: arm_insn = 373;
pub const arm_insn_ARM_INS_VMOV: arm_insn = 374;
pub const arm_insn_ARM_INS_VMOVL: arm_insn = 375;
pub const arm_insn_ARM_INS_VMOVN: arm_insn = 376;
pub const arm_insn_ARM_INS_VMOVX: arm_insn = 377;
pub const arm_insn_ARM_INS_VMRS: arm_insn = 378;
pub const arm_insn_ARM_INS_VMSR: arm_insn = 379;
pub const arm_insn_ARM_INS_VMUL: arm_insn = 380;
pub const arm_insn_ARM_INS_VMULL: arm_insn = 381;
pub const arm_insn_ARM_INS_VMVN: arm_insn = 382;
pub const arm_insn_ARM_INS_VNEG: arm_insn = 383;
pub const arm_insn_ARM_INS_VNMLA: arm_insn = 384;
pub const arm_insn_ARM_INS_VNMLS: arm_insn = 385;
pub const arm_insn_ARM_INS_VNMUL: arm_insn = 386;
pub const arm_insn_ARM_INS_VORN: arm_insn = 387;
pub const arm_insn_ARM_INS_VORR: arm_insn = 388;
pub const arm_insn_ARM_INS_VPADAL: arm_insn = 389;
pub const arm_insn_ARM_INS_VPADD: arm_insn = 390;
pub const arm_insn_ARM_INS_VPADDL: arm_insn = 391;
pub const arm_insn_ARM_INS_VPMAX: arm_insn = 392;
pub const arm_insn_ARM_INS_VPMIN: arm_insn = 393;
pub const arm_insn_ARM_INS_VPOP: arm_insn = 394;
pub const arm_insn_ARM_INS_VPUSH: arm_insn = 395;
pub const arm_insn_ARM_INS_VQABS: arm_insn = 396;
pub const arm_insn_ARM_INS_VQADD: arm_insn = 397;
pub const arm_insn_ARM_INS_VQDMLAL: arm_insn = 398;
pub const arm_insn_ARM_INS_VQDMLSL: arm_insn = 399;
pub const arm_insn_ARM_INS_VQDMULH: arm_insn = 400;
pub const arm_insn_ARM_INS_VQDMULL: arm_insn = 401;
pub const arm_insn_ARM_INS_VQMOVN: arm_insn = 402;
pub const arm_insn_ARM_INS_VQMOVUN: arm_insn = 403;
pub const arm_insn_ARM_INS_VQNEG: arm_insn = 404;
pub const arm_insn_ARM_INS_VQRDMLAH: arm_insn = 405;
pub const arm_insn_ARM_INS_VQRDMLSH: arm_insn = 406;
pub const arm_insn_ARM_INS_VQRDMULH: arm_insn = 407;
pub const arm_insn_ARM_INS_VQRSHL: arm_insn = 408;
pub const arm_insn_ARM_INS_VQRSHRN: arm_insn = 409;
pub const arm_insn_ARM_INS_VQRSHRUN: arm_insn = 410;
pub const arm_insn_ARM_INS_VQSHL: arm_insn = 411;
pub const arm_insn_ARM_INS_VQSHLU: arm_insn = 412;
pub const arm_insn_ARM_INS_VQSHRN: arm_insn = 413;
pub const arm_insn_ARM_INS_VQSHRUN: arm_insn = 414;
pub const arm_insn_ARM_INS_VQSUB: arm_insn = 415;
pub const arm_insn_ARM_INS_VRADDHN: arm_insn = 416;
pub const arm_insn_ARM_INS_VRECPE: arm_insn = 417;
pub const arm_insn_ARM_INS_VRECPS: arm_insn = 418;
pub const arm_insn_ARM_INS_VREV16: arm_insn = 419;
pub const arm_insn_ARM_INS_VREV32: arm_insn = 420;
pub const arm_insn_ARM_INS_VREV64: arm_insn = 421;
pub const arm_insn_ARM_INS_VRHADD: arm_insn = 422;
pub const arm_insn_ARM_INS_VRINTA: arm_insn = 423;
pub const arm_insn_ARM_INS_VRINTM: arm_insn = 424;
pub const arm_insn_ARM_INS_VRINTN: arm_insn = 425;
pub const arm_insn_ARM_INS_VRINTP: arm_insn = 426;
pub const arm_insn_ARM_INS_VRINTR: arm_insn = 427;
pub const arm_insn_ARM_INS_VRINTX: arm_insn = 428;
pub const arm_insn_ARM_INS_VRINTZ: arm_insn = 429;
pub const arm_insn_ARM_INS_VRSHL: arm_insn = 430;
pub const arm_insn_ARM_INS_VRSHR: arm_insn = 431;
pub const arm_insn_ARM_INS_VRSHRN: arm_insn = 432;
pub const arm_insn_ARM_INS_VRSQRTE: arm_insn = 433;
pub const arm_insn_ARM_INS_VRSQRTS: arm_insn = 434;
pub const arm_insn_ARM_INS_VRSRA: arm_insn = 435;
pub const arm_insn_ARM_INS_VRSUBHN: arm_insn = 436;
pub const arm_insn_ARM_INS_VSDOT: arm_insn = 437;
pub const arm_insn_ARM_INS_VSELEQ: arm_insn = 438;
pub const arm_insn_ARM_INS_VSELGE: arm_insn = 439;
pub const arm_insn_ARM_INS_VSELGT: arm_insn = 440;
pub const arm_insn_ARM_INS_VSELVS: arm_insn = 441;
pub const arm_insn_ARM_INS_VSHL: arm_insn = 442;
pub const arm_insn_ARM_INS_VSHLL: arm_insn = 443;
pub const arm_insn_ARM_INS_VSHR: arm_insn = 444;
pub const arm_insn_ARM_INS_VSHRN: arm_insn = 445;
pub const arm_insn_ARM_INS_VSLI: arm_insn = 446;
pub const arm_insn_ARM_INS_VSQRT: arm_insn = 447;
pub const arm_insn_ARM_INS_VSRA: arm_insn = 448;
pub const arm_insn_ARM_INS_VSRI: arm_insn = 449;
pub const arm_insn_ARM_INS_VST1: arm_insn = 450;
pub const arm_insn_ARM_INS_VST2: arm_insn = 451;
pub const arm_insn_ARM_INS_VST3: arm_insn = 452;
pub const arm_insn_ARM_INS_VST4: arm_insn = 453;
pub const arm_insn_ARM_INS_VSTMDB: arm_insn = 454;
pub const arm_insn_ARM_INS_VSTMIA: arm_insn = 455;
pub const arm_insn_ARM_INS_VSTR: arm_insn = 456;
pub const arm_insn_ARM_INS_VSUB: arm_insn = 457;
pub const arm_insn_ARM_INS_VSUBHN: arm_insn = 458;
pub const arm_insn_ARM_INS_VSUBL: arm_insn = 459;
pub const arm_insn_ARM_INS_VSUBW: arm_insn = 460;
pub const arm_insn_ARM_INS_VSWP: arm_insn = 461;
pub const arm_insn_ARM_INS_VTBL: arm_insn = 462;
pub const arm_insn_ARM_INS_VTBX: arm_insn = 463;
pub const arm_insn_ARM_INS_VTRN: arm_insn = 464;
pub const arm_insn_ARM_INS_VTST: arm_insn = 465;
pub const arm_insn_ARM_INS_VUDOT: arm_insn = 466;
pub const arm_insn_ARM_INS_VUZP: arm_insn = 467;
pub const arm_insn_ARM_INS_VZIP: arm_insn = 468;
pub const arm_insn_ARM_INS_WFE: arm_insn = 469;
pub const arm_insn_ARM_INS_WFI: arm_insn = 470;
pub const arm_insn_ARM_INS_YIELD: arm_insn = 471;
pub const arm_insn_ARM_INS_ENDING: arm_insn = 472;
pub type arm_insn = cty::c_uint;
pub const arm_insn_group_ARM_GRP_INVALID: arm_insn_group = 0;
pub const arm_insn_group_ARM_GRP_JUMP: arm_insn_group = 1;
pub const arm_insn_group_ARM_GRP_CALL: arm_insn_group = 2;
pub const arm_insn_group_ARM_GRP_INT: arm_insn_group = 4;
pub const arm_insn_group_ARM_GRP_PRIVILEGE: arm_insn_group = 6;
pub const arm_insn_group_ARM_GRP_BRANCH_RELATIVE: arm_insn_group = 7;
pub const arm_insn_group_ARM_GRP_CRYPTO: arm_insn_group = 128;
pub const arm_insn_group_ARM_GRP_DATABARRIER: arm_insn_group = 129;
pub const arm_insn_group_ARM_GRP_DIVIDE: arm_insn_group = 130;
pub const arm_insn_group_ARM_GRP_FPARMV8: arm_insn_group = 131;
pub const arm_insn_group_ARM_GRP_MULTPRO: arm_insn_group = 132;
pub const arm_insn_group_ARM_GRP_NEON: arm_insn_group = 133;
pub const arm_insn_group_ARM_GRP_T2EXTRACTPACK: arm_insn_group = 134;
pub const arm_insn_group_ARM_GRP_THUMB2DSP: arm_insn_group = 135;
pub const arm_insn_group_ARM_GRP_TRUSTZONE: arm_insn_group = 136;
pub const arm_insn_group_ARM_GRP_V4T: arm_insn_group = 137;
pub const arm_insn_group_ARM_GRP_V5T: arm_insn_group = 138;
pub const arm_insn_group_ARM_GRP_V5TE: arm_insn_group = 139;
pub const arm_insn_group_ARM_GRP_V6: arm_insn_group = 140;
pub const arm_insn_group_ARM_GRP_V6T2: arm_insn_group = 141;
pub const arm_insn_group_ARM_GRP_V7: arm_insn_group = 142;
pub const arm_insn_group_ARM_GRP_V8: arm_insn_group = 143;
pub const arm_insn_group_ARM_GRP_VFP2: arm_insn_group = 144;
pub const arm_insn_group_ARM_GRP_VFP3: arm_insn_group = 145;
pub const arm_insn_group_ARM_GRP_VFP4: arm_insn_group = 146;
pub const arm_insn_group_ARM_GRP_ARM: arm_insn_group = 147;
pub const arm_insn_group_ARM_GRP_MCLASS: arm_insn_group = 148;
pub const arm_insn_group_ARM_GRP_NOTMCLASS: arm_insn_group = 149;
pub const arm_insn_group_ARM_GRP_THUMB: arm_insn_group = 150;
pub const arm_insn_group_ARM_GRP_THUMB1ONLY: arm_insn_group = 151;
pub const arm_insn_group_ARM_GRP_THUMB2: arm_insn_group = 152;
pub const arm_insn_group_ARM_GRP_PREV8: arm_insn_group = 153;
pub const arm_insn_group_ARM_GRP_FPVMLX: arm_insn_group = 154;
pub const arm_insn_group_ARM_GRP_MULOPS: arm_insn_group = 155;
pub const arm_insn_group_ARM_GRP_CRC: arm_insn_group = 156;
pub const arm_insn_group_ARM_GRP_DPVFP: arm_insn_group = 157;
pub const arm_insn_group_ARM_GRP_V6M: arm_insn_group = 158;
pub const arm_insn_group_ARM_GRP_VIRTUALIZATION: arm_insn_group = 159;
pub const arm_insn_group_ARM_GRP_ENDING: arm_insn_group = 160;
pub type arm_insn_group = cty::c_uint;
pub const arm64_shifter_ARM64_SFT_INVALID: arm64_shifter = 0;
pub const arm64_shifter_ARM64_SFT_LSL: arm64_shifter = 1;
pub const arm64_shifter_ARM64_SFT_MSL: arm64_shifter = 2;
pub const arm64_shifter_ARM64_SFT_LSR: arm64_shifter = 3;
pub const arm64_shifter_ARM64_SFT_ASR: arm64_shifter = 4;
pub const arm64_shifter_ARM64_SFT_ROR: arm64_shifter = 5;
pub type arm64_shifter = cty::c_uint;
pub const arm64_extender_ARM64_EXT_INVALID: arm64_extender = 0;
pub const arm64_extender_ARM64_EXT_UXTB: arm64_extender = 1;
pub const arm64_extender_ARM64_EXT_UXTH: arm64_extender = 2;
pub const arm64_extender_ARM64_EXT_UXTW: arm64_extender = 3;
pub const arm64_extender_ARM64_EXT_UXTX: arm64_extender = 4;
pub const arm64_extender_ARM64_EXT_SXTB: arm64_extender = 5;
pub const arm64_extender_ARM64_EXT_SXTH: arm64_extender = 6;
pub const arm64_extender_ARM64_EXT_SXTW: arm64_extender = 7;
pub const arm64_extender_ARM64_EXT_SXTX: arm64_extender = 8;
pub type arm64_extender = cty::c_uint;
pub const arm64_cc_ARM64_CC_INVALID: arm64_cc = 0;
pub const arm64_cc_ARM64_CC_EQ: arm64_cc = 1;
pub const arm64_cc_ARM64_CC_NE: arm64_cc = 2;
pub const arm64_cc_ARM64_CC_HS: arm64_cc = 3;
pub const arm64_cc_ARM64_CC_LO: arm64_cc = 4;
pub const arm64_cc_ARM64_CC_MI: arm64_cc = 5;
pub const arm64_cc_ARM64_CC_PL: arm64_cc = 6;
pub const arm64_cc_ARM64_CC_VS: arm64_cc = 7;
pub const arm64_cc_ARM64_CC_VC: arm64_cc = 8;
pub const arm64_cc_ARM64_CC_HI: arm64_cc = 9;
pub const arm64_cc_ARM64_CC_LS: arm64_cc = 10;
pub const arm64_cc_ARM64_CC_GE: arm64_cc = 11;
pub const arm64_cc_ARM64_CC_LT: arm64_cc = 12;
pub const arm64_cc_ARM64_CC_GT: arm64_cc = 13;
pub const arm64_cc_ARM64_CC_LE: arm64_cc = 14;
pub const arm64_cc_ARM64_CC_AL: arm64_cc = 15;
pub const arm64_cc_ARM64_CC_NV: arm64_cc = 16;
pub type arm64_cc = cty::c_uint;
pub const arm64_sysreg_ARM64_SYSREG_INVALID: arm64_sysreg = 0;
pub const arm64_sysreg_ARM64_SYSREG_ACCDATA_EL1: arm64_sysreg = 50821;
pub const arm64_sysreg_ARM64_SYSREG_ACTLR_EL1: arm64_sysreg = 49281;
pub const arm64_sysreg_ARM64_SYSREG_ACTLR_EL2: arm64_sysreg = 57473;
pub const arm64_sysreg_ARM64_SYSREG_ACTLR_EL3: arm64_sysreg = 61569;
pub const arm64_sysreg_ARM64_SYSREG_AFSR0_EL1: arm64_sysreg = 49800;
pub const arm64_sysreg_ARM64_SYSREG_AFSR0_EL12: arm64_sysreg = 60040;
pub const arm64_sysreg_ARM64_SYSREG_AFSR0_EL2: arm64_sysreg = 57992;
pub const arm64_sysreg_ARM64_SYSREG_AFSR0_EL3: arm64_sysreg = 62088;
pub const arm64_sysreg_ARM64_SYSREG_AFSR1_EL1: arm64_sysreg = 49801;
pub const arm64_sysreg_ARM64_SYSREG_AFSR1_EL12: arm64_sysreg = 60041;
pub const arm64_sysreg_ARM64_SYSREG_AFSR1_EL2: arm64_sysreg = 57993;
pub const arm64_sysreg_ARM64_SYSREG_AFSR1_EL3: arm64_sysreg = 62089;
pub const arm64_sysreg_ARM64_SYSREG_AIDR_EL1: arm64_sysreg = 51207;
pub const arm64_sysreg_ARM64_SYSREG_AMAIR_EL1: arm64_sysreg = 50456;
pub const arm64_sysreg_ARM64_SYSREG_AMAIR_EL12: arm64_sysreg = 60696;
pub const arm64_sysreg_ARM64_SYSREG_AMAIR_EL2: arm64_sysreg = 58648;
pub const arm64_sysreg_ARM64_SYSREG_AMAIR_EL3: arm64_sysreg = 62744;
pub const arm64_sysreg_ARM64_SYSREG_AMCFGR_EL0: arm64_sysreg = 56977;
pub const arm64_sysreg_ARM64_SYSREG_AMCGCR_EL0: arm64_sysreg = 56978;
pub const arm64_sysreg_ARM64_SYSREG_AMCNTENCLR0_EL0: arm64_sysreg = 56980;
pub const arm64_sysreg_ARM64_SYSREG_AMCNTENCLR1_EL0: arm64_sysreg = 56984;
pub const arm64_sysreg_ARM64_SYSREG_AMCNTENSET0_EL0: arm64_sysreg = 56981;
pub const arm64_sysreg_ARM64_SYSREG_AMCNTENSET1_EL0: arm64_sysreg = 56985;
pub const arm64_sysreg_ARM64_SYSREG_AMCR_EL0: arm64_sysreg = 56976;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR00_EL0: arm64_sysreg = 56992;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR01_EL0: arm64_sysreg = 56993;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR02_EL0: arm64_sysreg = 56994;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR03_EL0: arm64_sysreg = 56995;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR10_EL0: arm64_sysreg = 57056;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR110_EL0: arm64_sysreg = 57066;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR111_EL0: arm64_sysreg = 57067;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR112_EL0: arm64_sysreg = 57068;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR113_EL0: arm64_sysreg = 57069;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR114_EL0: arm64_sysreg = 57070;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR115_EL0: arm64_sysreg = 57071;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR11_EL0: arm64_sysreg = 57057;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR12_EL0: arm64_sysreg = 57058;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR13_EL0: arm64_sysreg = 57059;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR14_EL0: arm64_sysreg = 57060;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR15_EL0: arm64_sysreg = 57061;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR16_EL0: arm64_sysreg = 57062;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR17_EL0: arm64_sysreg = 57063;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR18_EL0: arm64_sysreg = 57064;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTR19_EL0: arm64_sysreg = 57065;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF00_EL2: arm64_sysreg = 59072;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF010_EL2: arm64_sysreg = 59082;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF011_EL2: arm64_sysreg = 59083;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF012_EL2: arm64_sysreg = 59084;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF013_EL2: arm64_sysreg = 59085;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF014_EL2: arm64_sysreg = 59086;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF015_EL2: arm64_sysreg = 59087;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF01_EL2: arm64_sysreg = 59073;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF02_EL2: arm64_sysreg = 59074;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF03_EL2: arm64_sysreg = 59075;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF04_EL2: arm64_sysreg = 59076;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF05_EL2: arm64_sysreg = 59077;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF06_EL2: arm64_sysreg = 59078;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF07_EL2: arm64_sysreg = 59079;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF08_EL2: arm64_sysreg = 59080;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF09_EL2: arm64_sysreg = 59081;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF10_EL2: arm64_sysreg = 59088;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF110_EL2: arm64_sysreg = 59098;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF111_EL2: arm64_sysreg = 59099;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF112_EL2: arm64_sysreg = 59100;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF113_EL2: arm64_sysreg = 59101;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF114_EL2: arm64_sysreg = 59102;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF115_EL2: arm64_sysreg = 59103;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF11_EL2: arm64_sysreg = 59089;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF12_EL2: arm64_sysreg = 59090;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF13_EL2: arm64_sysreg = 59091;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF14_EL2: arm64_sysreg = 59092;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF15_EL2: arm64_sysreg = 59093;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF16_EL2: arm64_sysreg = 59094;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF17_EL2: arm64_sysreg = 59095;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF18_EL2: arm64_sysreg = 59096;
pub const arm64_sysreg_ARM64_SYSREG_AMEVCNTVOFF19_EL2: arm64_sysreg = 59097;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER00_EL0: arm64_sysreg = 57008;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER01_EL0: arm64_sysreg = 57009;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER02_EL0: arm64_sysreg = 57010;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER03_EL0: arm64_sysreg = 57011;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER10_EL0: arm64_sysreg = 57072;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER110_EL0: arm64_sysreg = 57082;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER111_EL0: arm64_sysreg = 57083;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER112_EL0: arm64_sysreg = 57084;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER113_EL0: arm64_sysreg = 57085;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER114_EL0: arm64_sysreg = 57086;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER115_EL0: arm64_sysreg = 57087;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER11_EL0: arm64_sysreg = 57073;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER12_EL0: arm64_sysreg = 57074;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER13_EL0: arm64_sysreg = 57075;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER14_EL0: arm64_sysreg = 57076;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER15_EL0: arm64_sysreg = 57077;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER16_EL0: arm64_sysreg = 57078;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER17_EL0: arm64_sysreg = 57079;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER18_EL0: arm64_sysreg = 57080;
pub const arm64_sysreg_ARM64_SYSREG_AMEVTYPER19_EL0: arm64_sysreg = 57081;
pub const arm64_sysreg_ARM64_SYSREG_AMUSERENR_EL0: arm64_sysreg = 56979;
pub const arm64_sysreg_ARM64_SYSREG_APDAKEYHI_EL1: arm64_sysreg = 49425;
pub const arm64_sysreg_ARM64_SYSREG_APDAKEYLO_EL1: arm64_sysreg = 49424;
pub const arm64_sysreg_ARM64_SYSREG_APDBKEYHI_EL1: arm64_sysreg = 49427;
pub const arm64_sysreg_ARM64_SYSREG_APDBKEYLO_EL1: arm64_sysreg = 49426;
pub const arm64_sysreg_ARM64_SYSREG_APGAKEYHI_EL1: arm64_sysreg = 49433;
pub const arm64_sysreg_ARM64_SYSREG_APGAKEYLO_EL1: arm64_sysreg = 49432;
pub const arm64_sysreg_ARM64_SYSREG_APIAKEYHI_EL1: arm64_sysreg = 49417;
pub const arm64_sysreg_ARM64_SYSREG_APIAKEYLO_EL1: arm64_sysreg = 49416;
pub const arm64_sysreg_ARM64_SYSREG_APIBKEYHI_EL1: arm64_sysreg = 49419;
pub const arm64_sysreg_ARM64_SYSREG_APIBKEYLO_EL1: arm64_sysreg = 49418;
pub const arm64_sysreg_ARM64_SYSREG_BRBCR_EL1: arm64_sysreg = 35968;
pub const arm64_sysreg_ARM64_SYSREG_BRBCR_EL12: arm64_sysreg = 44160;
pub const arm64_sysreg_ARM64_SYSREG_BRBCR_EL2: arm64_sysreg = 42112;
pub const arm64_sysreg_ARM64_SYSREG_BRBFCR_EL1: arm64_sysreg = 35969;
pub const arm64_sysreg_ARM64_SYSREG_BRBIDR0_EL1: arm64_sysreg = 35984;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF0_EL1: arm64_sysreg = 35840;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF10_EL1: arm64_sysreg = 35920;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF11_EL1: arm64_sysreg = 35928;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF12_EL1: arm64_sysreg = 35936;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF13_EL1: arm64_sysreg = 35944;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF14_EL1: arm64_sysreg = 35952;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF15_EL1: arm64_sysreg = 35960;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF16_EL1: arm64_sysreg = 35844;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF17_EL1: arm64_sysreg = 35852;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF18_EL1: arm64_sysreg = 35860;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF19_EL1: arm64_sysreg = 35868;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF1_EL1: arm64_sysreg = 35848;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF20_EL1: arm64_sysreg = 35876;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF21_EL1: arm64_sysreg = 35884;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF22_EL1: arm64_sysreg = 35892;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF23_EL1: arm64_sysreg = 35900;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF24_EL1: arm64_sysreg = 35908;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF25_EL1: arm64_sysreg = 35916;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF26_EL1: arm64_sysreg = 35924;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF27_EL1: arm64_sysreg = 35932;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF28_EL1: arm64_sysreg = 35940;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF29_EL1: arm64_sysreg = 35948;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF2_EL1: arm64_sysreg = 35856;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF30_EL1: arm64_sysreg = 35956;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF31_EL1: arm64_sysreg = 35964;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF3_EL1: arm64_sysreg = 35864;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF4_EL1: arm64_sysreg = 35872;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF5_EL1: arm64_sysreg = 35880;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF6_EL1: arm64_sysreg = 35888;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF7_EL1: arm64_sysreg = 35896;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF8_EL1: arm64_sysreg = 35904;
pub const arm64_sysreg_ARM64_SYSREG_BRBINF9_EL1: arm64_sysreg = 35912;
pub const arm64_sysreg_ARM64_SYSREG_BRBINFINJ_EL1: arm64_sysreg = 35976;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC0_EL1: arm64_sysreg = 35841;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC10_EL1: arm64_sysreg = 35921;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC11_EL1: arm64_sysreg = 35929;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC12_EL1: arm64_sysreg = 35937;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC13_EL1: arm64_sysreg = 35945;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC14_EL1: arm64_sysreg = 35953;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC15_EL1: arm64_sysreg = 35961;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC16_EL1: arm64_sysreg = 35845;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC17_EL1: arm64_sysreg = 35853;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC18_EL1: arm64_sysreg = 35861;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC19_EL1: arm64_sysreg = 35869;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC1_EL1: arm64_sysreg = 35849;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC20_EL1: arm64_sysreg = 35877;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC21_EL1: arm64_sysreg = 35885;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC22_EL1: arm64_sysreg = 35893;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC23_EL1: arm64_sysreg = 35901;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC24_EL1: arm64_sysreg = 35909;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC25_EL1: arm64_sysreg = 35917;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC26_EL1: arm64_sysreg = 35925;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC27_EL1: arm64_sysreg = 35933;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC28_EL1: arm64_sysreg = 35941;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC29_EL1: arm64_sysreg = 35949;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC2_EL1: arm64_sysreg = 35857;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC30_EL1: arm64_sysreg = 35957;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC31_EL1: arm64_sysreg = 35965;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC3_EL1: arm64_sysreg = 35865;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC4_EL1: arm64_sysreg = 35873;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC5_EL1: arm64_sysreg = 35881;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC6_EL1: arm64_sysreg = 35889;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC7_EL1: arm64_sysreg = 35897;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC8_EL1: arm64_sysreg = 35905;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRC9_EL1: arm64_sysreg = 35913;
pub const arm64_sysreg_ARM64_SYSREG_BRBSRCINJ_EL1: arm64_sysreg = 35977;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT0_EL1: arm64_sysreg = 35842;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT10_EL1: arm64_sysreg = 35922;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT11_EL1: arm64_sysreg = 35930;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT12_EL1: arm64_sysreg = 35938;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT13_EL1: arm64_sysreg = 35946;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT14_EL1: arm64_sysreg = 35954;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT15_EL1: arm64_sysreg = 35962;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT16_EL1: arm64_sysreg = 35846;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT17_EL1: arm64_sysreg = 35854;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT18_EL1: arm64_sysreg = 35862;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT19_EL1: arm64_sysreg = 35870;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT1_EL1: arm64_sysreg = 35850;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT20_EL1: arm64_sysreg = 35878;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT21_EL1: arm64_sysreg = 35886;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT22_EL1: arm64_sysreg = 35894;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT23_EL1: arm64_sysreg = 35902;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT24_EL1: arm64_sysreg = 35910;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT25_EL1: arm64_sysreg = 35918;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT26_EL1: arm64_sysreg = 35926;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT27_EL1: arm64_sysreg = 35934;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT28_EL1: arm64_sysreg = 35942;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT29_EL1: arm64_sysreg = 35950;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT2_EL1: arm64_sysreg = 35858;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT30_EL1: arm64_sysreg = 35958;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT31_EL1: arm64_sysreg = 35966;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT3_EL1: arm64_sysreg = 35866;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT4_EL1: arm64_sysreg = 35874;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT5_EL1: arm64_sysreg = 35882;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT6_EL1: arm64_sysreg = 35890;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT7_EL1: arm64_sysreg = 35898;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT8_EL1: arm64_sysreg = 35906;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGT9_EL1: arm64_sysreg = 35914;
pub const arm64_sysreg_ARM64_SYSREG_BRBTGTINJ_EL1: arm64_sysreg = 35978;
pub const arm64_sysreg_ARM64_SYSREG_BRBTS_EL1: arm64_sysreg = 35970;
pub const arm64_sysreg_ARM64_SYSREG_CCSIDR2_EL1: arm64_sysreg = 51202;
pub const arm64_sysreg_ARM64_SYSREG_CCSIDR_EL1: arm64_sysreg = 51200;
pub const arm64_sysreg_ARM64_SYSREG_CLIDR_EL1: arm64_sysreg = 51201;
pub const arm64_sysreg_ARM64_SYSREG_CNTFRQ_EL0: arm64_sysreg = 57088;
pub const arm64_sysreg_ARM64_SYSREG_CNTHCTL_EL2: arm64_sysreg = 59144;
pub const arm64_sysreg_ARM64_SYSREG_CNTHPS_CTL_EL2: arm64_sysreg = 59177;
pub const arm64_sysreg_ARM64_SYSREG_CNTHPS_CVAL_EL2: arm64_sysreg = 59178;
pub const arm64_sysreg_ARM64_SYSREG_CNTHPS_TVAL_EL2: arm64_sysreg = 59176;
pub const arm64_sysreg_ARM64_SYSREG_CNTHP_CTL_EL2: arm64_sysreg = 59153;
pub const arm64_sysreg_ARM64_SYSREG_CNTHP_CVAL_EL2: arm64_sysreg = 59154;
pub const arm64_sysreg_ARM64_SYSREG_CNTHP_TVAL_EL2: arm64_sysreg = 59152;
pub const arm64_sysreg_ARM64_SYSREG_CNTHVS_CTL_EL2: arm64_sysreg = 59169;
pub const arm64_sysreg_ARM64_SYSREG_CNTHVS_CVAL_EL2: arm64_sysreg = 59170;
pub const arm64_sysreg_ARM64_SYSREG_CNTHVS_TVAL_EL2: arm64_sysreg = 59168;
pub const arm64_sysreg_ARM64_SYSREG_CNTHV_CTL_EL2: arm64_sysreg = 59161;
pub const arm64_sysreg_ARM64_SYSREG_CNTHV_CVAL_EL2: arm64_sysreg = 59162;
pub const arm64_sysreg_ARM64_SYSREG_CNTHV_TVAL_EL2: arm64_sysreg = 59160;
pub const arm64_sysreg_ARM64_SYSREG_CNTISCALE_EL2: arm64_sysreg = 59141;
pub const arm64_sysreg_ARM64_SYSREG_CNTKCTL_EL1: arm64_sysreg = 50952;
pub const arm64_sysreg_ARM64_SYSREG_CNTKCTL_EL12: arm64_sysreg = 61192;
pub const arm64_sysreg_ARM64_SYSREG_CNTPCTSS_EL0: arm64_sysreg = 57093;
pub const arm64_sysreg_ARM64_SYSREG_CNTPCT_EL0: arm64_sysreg = 57089;
pub const arm64_sysreg_ARM64_SYSREG_CNTPOFF_EL2: arm64_sysreg = 59142;
pub const arm64_sysreg_ARM64_SYSREG_CNTPS_CTL_EL1: arm64_sysreg = 65297;
pub const arm64_sysreg_ARM64_SYSREG_CNTPS_CVAL_EL1: arm64_sysreg = 65298;
pub const arm64_sysreg_ARM64_SYSREG_CNTPS_TVAL_EL1: arm64_sysreg = 65296;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_CTL_EL0: arm64_sysreg = 57105;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_CTL_EL02: arm64_sysreg = 61201;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_CVAL_EL0: arm64_sysreg = 57106;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_CVAL_EL02: arm64_sysreg = 61202;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_TVAL_EL0: arm64_sysreg = 57104;
pub const arm64_sysreg_ARM64_SYSREG_CNTP_TVAL_EL02: arm64_sysreg = 61200;
pub const arm64_sysreg_ARM64_SYSREG_CNTSCALE_EL2: arm64_sysreg = 59140;
pub const arm64_sysreg_ARM64_SYSREG_CNTVCTSS_EL0: arm64_sysreg = 57094;
pub const arm64_sysreg_ARM64_SYSREG_CNTVCT_EL0: arm64_sysreg = 57090;
pub const arm64_sysreg_ARM64_SYSREG_CNTVFRQ_EL2: arm64_sysreg = 59143;
pub const arm64_sysreg_ARM64_SYSREG_CNTVOFF_EL2: arm64_sysreg = 59139;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_CTL_EL0: arm64_sysreg = 57113;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_CTL_EL02: arm64_sysreg = 61209;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_CVAL_EL0: arm64_sysreg = 57114;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_CVAL_EL02: arm64_sysreg = 61210;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_TVAL_EL0: arm64_sysreg = 57112;
pub const arm64_sysreg_ARM64_SYSREG_CNTV_TVAL_EL02: arm64_sysreg = 61208;
pub const arm64_sysreg_ARM64_SYSREG_CONTEXTIDR_EL1: arm64_sysreg = 50817;
pub const arm64_sysreg_ARM64_SYSREG_CONTEXTIDR_EL12: arm64_sysreg = 61057;
pub const arm64_sysreg_ARM64_SYSREG_CONTEXTIDR_EL2: arm64_sysreg = 59009;
pub const arm64_sysreg_ARM64_SYSREG_CPACR_EL1: arm64_sysreg = 49282;
pub const arm64_sysreg_ARM64_SYSREG_CPACR_EL12: arm64_sysreg = 59522;
pub const arm64_sysreg_ARM64_SYSREG_CPM_IOACC_CTL_EL3: arm64_sysreg = 65424;
pub const arm64_sysreg_ARM64_SYSREG_CPTR_EL2: arm64_sysreg = 57482;
pub const arm64_sysreg_ARM64_SYSREG_CPTR_EL3: arm64_sysreg = 61578;
pub const arm64_sysreg_ARM64_SYSREG_CSSELR_EL1: arm64_sysreg = 53248;
pub const arm64_sysreg_ARM64_SYSREG_CTR_EL0: arm64_sysreg = 55297;
pub const arm64_sysreg_ARM64_SYSREG_CURRENTEL: arm64_sysreg = 49682;
pub const arm64_sysreg_ARM64_SYSREG_DACR32_EL2: arm64_sysreg = 57728;
pub const arm64_sysreg_ARM64_SYSREG_DAIF: arm64_sysreg = 55825;
pub const arm64_sysreg_ARM64_SYSREG_DBGAUTHSTATUS_EL1: arm64_sysreg = 33782;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR0_EL1: arm64_sysreg = 32773;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR10_EL1: arm64_sysreg = 32853;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR11_EL1: arm64_sysreg = 32861;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR12_EL1: arm64_sysreg = 32869;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR13_EL1: arm64_sysreg = 32877;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR14_EL1: arm64_sysreg = 32885;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR15_EL1: arm64_sysreg = 32893;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR1_EL1: arm64_sysreg = 32781;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR2_EL1: arm64_sysreg = 32789;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR3_EL1: arm64_sysreg = 32797;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR4_EL1: arm64_sysreg = 32805;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR5_EL1: arm64_sysreg = 32813;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR6_EL1: arm64_sysreg = 32821;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR7_EL1: arm64_sysreg = 32829;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR8_EL1: arm64_sysreg = 32837;
pub const arm64_sysreg_ARM64_SYSREG_DBGBCR9_EL1: arm64_sysreg = 32845;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR0_EL1: arm64_sysreg = 32772;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR10_EL1: arm64_sysreg = 32852;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR11_EL1: arm64_sysreg = 32860;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR12_EL1: arm64_sysreg = 32868;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR13_EL1: arm64_sysreg = 32876;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR14_EL1: arm64_sysreg = 32884;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR15_EL1: arm64_sysreg = 32892;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR1_EL1: arm64_sysreg = 32780;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR2_EL1: arm64_sysreg = 32788;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR3_EL1: arm64_sysreg = 32796;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR4_EL1: arm64_sysreg = 32804;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR5_EL1: arm64_sysreg = 32812;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR6_EL1: arm64_sysreg = 32820;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR7_EL1: arm64_sysreg = 32828;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR8_EL1: arm64_sysreg = 32836;
pub const arm64_sysreg_ARM64_SYSREG_DBGBVR9_EL1: arm64_sysreg = 32844;
pub const arm64_sysreg_ARM64_SYSREG_DBGCLAIMCLR_EL1: arm64_sysreg = 33742;
pub const arm64_sysreg_ARM64_SYSREG_DBGCLAIMSET_EL1: arm64_sysreg = 33734;
pub const arm64_sysreg_ARM64_SYSREG_DBGDTRRX_EL0: arm64_sysreg = 38952;
pub const arm64_sysreg_ARM64_SYSREG_DBGDTRTX_EL0: arm64_sysreg = 38952;
pub const arm64_sysreg_ARM64_SYSREG_DBGDTR_EL0: arm64_sysreg = 38944;
pub const arm64_sysreg_ARM64_SYSREG_DBGPRCR_EL1: arm64_sysreg = 32932;
pub const arm64_sysreg_ARM64_SYSREG_DBGVCR32_EL2: arm64_sysreg = 41016;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR0_EL1: arm64_sysreg = 32775;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR10_EL1: arm64_sysreg = 32855;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR11_EL1: arm64_sysreg = 32863;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR12_EL1: arm64_sysreg = 32871;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR13_EL1: arm64_sysreg = 32879;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR14_EL1: arm64_sysreg = 32887;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR15_EL1: arm64_sysreg = 32895;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR1_EL1: arm64_sysreg = 32783;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR2_EL1: arm64_sysreg = 32791;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR3_EL1: arm64_sysreg = 32799;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR4_EL1: arm64_sysreg = 32807;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR5_EL1: arm64_sysreg = 32815;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR6_EL1: arm64_sysreg = 32823;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR7_EL1: arm64_sysreg = 32831;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR8_EL1: arm64_sysreg = 32839;
pub const arm64_sysreg_ARM64_SYSREG_DBGWCR9_EL1: arm64_sysreg = 32847;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR0_EL1: arm64_sysreg = 32774;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR10_EL1: arm64_sysreg = 32854;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR11_EL1: arm64_sysreg = 32862;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR12_EL1: arm64_sysreg = 32870;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR13_EL1: arm64_sysreg = 32878;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR14_EL1: arm64_sysreg = 32886;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR15_EL1: arm64_sysreg = 32894;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR1_EL1: arm64_sysreg = 32782;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR2_EL1: arm64_sysreg = 32790;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR3_EL1: arm64_sysreg = 32798;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR4_EL1: arm64_sysreg = 32806;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR5_EL1: arm64_sysreg = 32814;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR6_EL1: arm64_sysreg = 32822;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR7_EL1: arm64_sysreg = 32830;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR8_EL1: arm64_sysreg = 32838;
pub const arm64_sysreg_ARM64_SYSREG_DBGWVR9_EL1: arm64_sysreg = 32846;
pub const arm64_sysreg_ARM64_SYSREG_DCZID_EL0: arm64_sysreg = 55303;
pub const arm64_sysreg_ARM64_SYSREG_DISR_EL1: arm64_sysreg = 50697;
pub const arm64_sysreg_ARM64_SYSREG_DIT: arm64_sysreg = 55829;
pub const arm64_sysreg_ARM64_SYSREG_DLR_EL0: arm64_sysreg = 55849;
pub const arm64_sysreg_ARM64_SYSREG_DSPSR_EL0: arm64_sysreg = 55848;
pub const arm64_sysreg_ARM64_SYSREG_ELR_EL1: arm64_sysreg = 49665;
pub const arm64_sysreg_ARM64_SYSREG_ELR_EL12: arm64_sysreg = 59905;
pub const arm64_sysreg_ARM64_SYSREG_ELR_EL2: arm64_sysreg = 57857;
pub const arm64_sysreg_ARM64_SYSREG_ELR_EL3: arm64_sysreg = 61953;
pub const arm64_sysreg_ARM64_SYSREG_ERRIDR_EL1: arm64_sysreg = 49816;
pub const arm64_sysreg_ARM64_SYSREG_ERRSELR_EL1: arm64_sysreg = 49817;
pub const arm64_sysreg_ARM64_SYSREG_ERXADDR_EL1: arm64_sysreg = 49827;
pub const arm64_sysreg_ARM64_SYSREG_ERXCTLR_EL1: arm64_sysreg = 49825;
pub const arm64_sysreg_ARM64_SYSREG_ERXFR_EL1: arm64_sysreg = 49824;
pub const arm64_sysreg_ARM64_SYSREG_ERXMISC0_EL1: arm64_sysreg = 49832;
pub const arm64_sysreg_ARM64_SYSREG_ERXMISC1_EL1: arm64_sysreg = 49833;
pub const arm64_sysreg_ARM64_SYSREG_ERXMISC2_EL1: arm64_sysreg = 49834;
pub const arm64_sysreg_ARM64_SYSREG_ERXMISC3_EL1: arm64_sysreg = 49835;
pub const arm64_sysreg_ARM64_SYSREG_ERXPFGCDN_EL1: arm64_sysreg = 49830;
pub const arm64_sysreg_ARM64_SYSREG_ERXPFGCTL_EL1: arm64_sysreg = 49829;
pub const arm64_sysreg_ARM64_SYSREG_ERXPFGF_EL1: arm64_sysreg = 49828;
pub const arm64_sysreg_ARM64_SYSREG_ERXSTATUS_EL1: arm64_sysreg = 49826;
pub const arm64_sysreg_ARM64_SYSREG_ESR_EL1: arm64_sysreg = 49808;
pub const arm64_sysreg_ARM64_SYSREG_ESR_EL12: arm64_sysreg = 60048;
pub const arm64_sysreg_ARM64_SYSREG_ESR_EL2: arm64_sysreg = 58000;
pub const arm64_sysreg_ARM64_SYSREG_ESR_EL3: arm64_sysreg = 62096;
pub const arm64_sysreg_ARM64_SYSREG_FAR_EL1: arm64_sysreg = 49920;
pub const arm64_sysreg_ARM64_SYSREG_FAR_EL12: arm64_sysreg = 60160;
pub const arm64_sysreg_ARM64_SYSREG_FAR_EL2: arm64_sysreg = 58112;
pub const arm64_sysreg_ARM64_SYSREG_FAR_EL3: arm64_sysreg = 62208;
pub const arm64_sysreg_ARM64_SYSREG_FPCR: arm64_sysreg = 55840;
pub const arm64_sysreg_ARM64_SYSREG_FPEXC32_EL2: arm64_sysreg = 58008;
pub const arm64_sysreg_ARM64_SYSREG_FPSR: arm64_sysreg = 55841;
pub const arm64_sysreg_ARM64_SYSREG_GCR_EL1: arm64_sysreg = 49286;
pub const arm64_sysreg_ARM64_SYSREG_GMID_EL1: arm64_sysreg = 51204;
pub const arm64_sysreg_ARM64_SYSREG_GPCCR_EL3: arm64_sysreg = 61710;
pub const arm64_sysreg_ARM64_SYSREG_GPTBR_EL3: arm64_sysreg = 61708;
pub const arm64_sysreg_ARM64_SYSREG_HACR_EL2: arm64_sysreg = 57487;
pub const arm64_sysreg_ARM64_SYSREG_HCRX_EL2: arm64_sysreg = 57490;
pub const arm64_sysreg_ARM64_SYSREG_HCR_EL2: arm64_sysreg = 57480;
pub const arm64_sysreg_ARM64_SYSREG_HDFGRTR_EL2: arm64_sysreg = 57740;
pub const arm64_sysreg_ARM64_SYSREG_HDFGWTR_EL2: arm64_sysreg = 57741;
pub const arm64_sysreg_ARM64_SYSREG_HFGITR_EL2: arm64_sysreg = 57486;
pub const arm64_sysreg_ARM64_SYSREG_HFGRTR_EL2: arm64_sysreg = 57484;
pub const arm64_sysreg_ARM64_SYSREG_HFGWTR_EL2: arm64_sysreg = 57485;
pub const arm64_sysreg_ARM64_SYSREG_HPFAR_EL2: arm64_sysreg = 58116;
pub const arm64_sysreg_ARM64_SYSREG_HSTR_EL2: arm64_sysreg = 57483;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP0R0_EL1: arm64_sysreg = 50756;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP0R1_EL1: arm64_sysreg = 50757;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP0R2_EL1: arm64_sysreg = 50758;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP0R3_EL1: arm64_sysreg = 50759;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP1R0_EL1: arm64_sysreg = 50760;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP1R1_EL1: arm64_sysreg = 50761;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP1R2_EL1: arm64_sysreg = 50762;
pub const arm64_sysreg_ARM64_SYSREG_ICC_AP1R3_EL1: arm64_sysreg = 50763;
pub const arm64_sysreg_ARM64_SYSREG_ICC_ASGI1R_EL1: arm64_sysreg = 50782;
pub const arm64_sysreg_ARM64_SYSREG_ICC_BPR0_EL1: arm64_sysreg = 50755;
pub const arm64_sysreg_ARM64_SYSREG_ICC_BPR1_EL1: arm64_sysreg = 50787;
pub const arm64_sysreg_ARM64_SYSREG_ICC_CTLR_EL1: arm64_sysreg = 50788;
pub const arm64_sysreg_ARM64_SYSREG_ICC_CTLR_EL3: arm64_sysreg = 63076;
pub const arm64_sysreg_ARM64_SYSREG_ICC_DIR_EL1: arm64_sysreg = 50777;
pub const arm64_sysreg_ARM64_SYSREG_ICC_EOIR0_EL1: arm64_sysreg = 50753;
pub const arm64_sysreg_ARM64_SYSREG_ICC_EOIR1_EL1: arm64_sysreg = 50785;
pub const arm64_sysreg_ARM64_SYSREG_ICC_HPPIR0_EL1: arm64_sysreg = 50754;
pub const arm64_sysreg_ARM64_SYSREG_ICC_HPPIR1_EL1: arm64_sysreg = 50786;
pub const arm64_sysreg_ARM64_SYSREG_ICC_IAR0_EL1: arm64_sysreg = 50752;
pub const arm64_sysreg_ARM64_SYSREG_ICC_IAR1_EL1: arm64_sysreg = 50784;
pub const arm64_sysreg_ARM64_SYSREG_ICC_IGRPEN0_EL1: arm64_sysreg = 50790;
pub const arm64_sysreg_ARM64_SYSREG_ICC_IGRPEN1_EL1: arm64_sysreg = 50791;
pub const arm64_sysreg_ARM64_SYSREG_ICC_IGRPEN1_EL3: arm64_sysreg = 63079;
pub const arm64_sysreg_ARM64_SYSREG_ICC_PMR_EL1: arm64_sysreg = 49712;
pub const arm64_sysreg_ARM64_SYSREG_ICC_RPR_EL1: arm64_sysreg = 50779;
pub const arm64_sysreg_ARM64_SYSREG_ICC_SGI0R_EL1: arm64_sysreg = 50783;
pub const arm64_sysreg_ARM64_SYSREG_ICC_SGI1R_EL1: arm64_sysreg = 50781;
pub const arm64_sysreg_ARM64_SYSREG_ICC_SRE_EL1: arm64_sysreg = 50789;
pub const arm64_sysreg_ARM64_SYSREG_ICC_SRE_EL2: arm64_sysreg = 58957;
pub const arm64_sysreg_ARM64_SYSREG_ICC_SRE_EL3: arm64_sysreg = 63077;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP0R0_EL2: arm64_sysreg = 58944;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP0R1_EL2: arm64_sysreg = 58945;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP0R2_EL2: arm64_sysreg = 58946;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP0R3_EL2: arm64_sysreg = 58947;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP1R0_EL2: arm64_sysreg = 58952;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP1R1_EL2: arm64_sysreg = 58953;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP1R2_EL2: arm64_sysreg = 58954;
pub const arm64_sysreg_ARM64_SYSREG_ICH_AP1R3_EL2: arm64_sysreg = 58955;
pub const arm64_sysreg_ARM64_SYSREG_ICH_EISR_EL2: arm64_sysreg = 58971;
pub const arm64_sysreg_ARM64_SYSREG_ICH_ELRSR_EL2: arm64_sysreg = 58973;
pub const arm64_sysreg_ARM64_SYSREG_ICH_HCR_EL2: arm64_sysreg = 58968;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR0_EL2: arm64_sysreg = 58976;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR10_EL2: arm64_sysreg = 58986;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR11_EL2: arm64_sysreg = 58987;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR12_EL2: arm64_sysreg = 58988;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR13_EL2: arm64_sysreg = 58989;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR14_EL2: arm64_sysreg = 58990;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR15_EL2: arm64_sysreg = 58991;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR1_EL2: arm64_sysreg = 58977;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR2_EL2: arm64_sysreg = 58978;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR3_EL2: arm64_sysreg = 58979;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR4_EL2: arm64_sysreg = 58980;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR5_EL2: arm64_sysreg = 58981;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR6_EL2: arm64_sysreg = 58982;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR7_EL2: arm64_sysreg = 58983;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR8_EL2: arm64_sysreg = 58984;
pub const arm64_sysreg_ARM64_SYSREG_ICH_LR9_EL2: arm64_sysreg = 58985;
pub const arm64_sysreg_ARM64_SYSREG_ICH_MISR_EL2: arm64_sysreg = 58970;
pub const arm64_sysreg_ARM64_SYSREG_ICH_VMCR_EL2: arm64_sysreg = 58975;
pub const arm64_sysreg_ARM64_SYSREG_ICH_VTR_EL2: arm64_sysreg = 58969;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64AFR0_EL1: arm64_sysreg = 49196;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64AFR1_EL1: arm64_sysreg = 49197;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64DFR0_EL1: arm64_sysreg = 49192;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64DFR1_EL1: arm64_sysreg = 49193;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64ISAR0_EL1: arm64_sysreg = 49200;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64ISAR1_EL1: arm64_sysreg = 49201;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64ISAR2_EL1: arm64_sysreg = 49202;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64MMFR0_EL1: arm64_sysreg = 49208;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64MMFR1_EL1: arm64_sysreg = 49209;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64MMFR2_EL1: arm64_sysreg = 49210;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64PFR0_EL1: arm64_sysreg = 49184;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64PFR1_EL1: arm64_sysreg = 49185;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64SMFR0_EL1: arm64_sysreg = 49189;
pub const arm64_sysreg_ARM64_SYSREG_ID_AA64ZFR0_EL1: arm64_sysreg = 49188;
pub const arm64_sysreg_ARM64_SYSREG_ID_AFR0_EL1: arm64_sysreg = 49163;
pub const arm64_sysreg_ARM64_SYSREG_ID_DFR0_EL1: arm64_sysreg = 49162;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR0_EL1: arm64_sysreg = 49168;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR1_EL1: arm64_sysreg = 49169;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR2_EL1: arm64_sysreg = 49170;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR3_EL1: arm64_sysreg = 49171;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR4_EL1: arm64_sysreg = 49172;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR5_EL1: arm64_sysreg = 49173;
pub const arm64_sysreg_ARM64_SYSREG_ID_ISAR6_EL1: arm64_sysreg = 49175;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR0_EL1: arm64_sysreg = 49164;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR1_EL1: arm64_sysreg = 49165;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR2_EL1: arm64_sysreg = 49166;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR3_EL1: arm64_sysreg = 49167;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR4_EL1: arm64_sysreg = 49174;
pub const arm64_sysreg_ARM64_SYSREG_ID_MMFR5_EL1: arm64_sysreg = 49182;
pub const arm64_sysreg_ARM64_SYSREG_ID_PFR0_EL1: arm64_sysreg = 49160;
pub const arm64_sysreg_ARM64_SYSREG_ID_PFR1_EL1: arm64_sysreg = 49161;
pub const arm64_sysreg_ARM64_SYSREG_ID_PFR2_EL1: arm64_sysreg = 49180;
pub const arm64_sysreg_ARM64_SYSREG_IFSR32_EL2: arm64_sysreg = 57985;
pub const arm64_sysreg_ARM64_SYSREG_ISR_EL1: arm64_sysreg = 50696;
pub const arm64_sysreg_ARM64_SYSREG_LORC_EL1: arm64_sysreg = 50467;
pub const arm64_sysreg_ARM64_SYSREG_LOREA_EL1: arm64_sysreg = 50465;
pub const arm64_sysreg_ARM64_SYSREG_LORID_EL1: arm64_sysreg = 50471;
pub const arm64_sysreg_ARM64_SYSREG_LORN_EL1: arm64_sysreg = 50466;
pub const arm64_sysreg_ARM64_SYSREG_LORSA_EL1: arm64_sysreg = 50464;
pub const arm64_sysreg_ARM64_SYSREG_MAIR_EL1: arm64_sysreg = 50448;
pub const arm64_sysreg_ARM64_SYSREG_MAIR_EL12: arm64_sysreg = 60688;
pub const arm64_sysreg_ARM64_SYSREG_MAIR_EL2: arm64_sysreg = 58640;
pub const arm64_sysreg_ARM64_SYSREG_MAIR_EL3: arm64_sysreg = 62736;
pub const arm64_sysreg_ARM64_SYSREG_MDCCINT_EL1: arm64_sysreg = 32784;
pub const arm64_sysreg_ARM64_SYSREG_MDCCSR_EL0: arm64_sysreg = 38920;
pub const arm64_sysreg_ARM64_SYSREG_MDCR_EL2: arm64_sysreg = 57481;
pub const arm64_sysreg_ARM64_SYSREG_MDCR_EL3: arm64_sysreg = 61593;
pub const arm64_sysreg_ARM64_SYSREG_MDRAR_EL1: arm64_sysreg = 32896;
pub const arm64_sysreg_ARM64_SYSREG_MDSCR_EL1: arm64_sysreg = 32786;
pub const arm64_sysreg_ARM64_SYSREG_MFAR_EL3: arm64_sysreg = 62213;
pub const arm64_sysreg_ARM64_SYSREG_MIDR_EL1: arm64_sysreg = 49152;
pub const arm64_sysreg_ARM64_SYSREG_MPAM0_EL1: arm64_sysreg = 50473;
pub const arm64_sysreg_ARM64_SYSREG_MPAM1_EL1: arm64_sysreg = 50472;
pub const arm64_sysreg_ARM64_SYSREG_MPAM1_EL12: arm64_sysreg = 60712;
pub const arm64_sysreg_ARM64_SYSREG_MPAM2_EL2: arm64_sysreg = 58664;
pub const arm64_sysreg_ARM64_SYSREG_MPAM3_EL3: arm64_sysreg = 62760;
pub const arm64_sysreg_ARM64_SYSREG_MPAMHCR_EL2: arm64_sysreg = 58656;
pub const arm64_sysreg_ARM64_SYSREG_MPAMIDR_EL1: arm64_sysreg = 50468;
pub const arm64_sysreg_ARM64_SYSREG_MPAMSM_EL1: arm64_sysreg = 50475;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM0_EL2: arm64_sysreg = 58672;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM1_EL2: arm64_sysreg = 58673;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM2_EL2: arm64_sysreg = 58674;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM3_EL2: arm64_sysreg = 58675;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM4_EL2: arm64_sysreg = 58676;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM5_EL2: arm64_sysreg = 58677;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM6_EL2: arm64_sysreg = 58678;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPM7_EL2: arm64_sysreg = 58679;
pub const arm64_sysreg_ARM64_SYSREG_MPAMVPMV_EL2: arm64_sysreg = 58657;
pub const arm64_sysreg_ARM64_SYSREG_MPIDR_EL1: arm64_sysreg = 49157;
pub const arm64_sysreg_ARM64_SYSREG_MPUIR_EL1: arm64_sysreg = 49156;
pub const arm64_sysreg_ARM64_SYSREG_MPUIR_EL2: arm64_sysreg = 57348;
pub const arm64_sysreg_ARM64_SYSREG_MVFR0_EL1: arm64_sysreg = 49176;
pub const arm64_sysreg_ARM64_SYSREG_MVFR1_EL1: arm64_sysreg = 49177;
pub const arm64_sysreg_ARM64_SYSREG_MVFR2_EL1: arm64_sysreg = 49178;
pub const arm64_sysreg_ARM64_SYSREG_NZCV: arm64_sysreg = 55824;
pub const arm64_sysreg_ARM64_SYSREG_OSDLR_EL1: arm64_sysreg = 32924;
pub const arm64_sysreg_ARM64_SYSREG_OSDTRRX_EL1: arm64_sysreg = 32770;
pub const arm64_sysreg_ARM64_SYSREG_OSDTRTX_EL1: arm64_sysreg = 32794;
pub const arm64_sysreg_ARM64_SYSREG_OSECCR_EL1: arm64_sysreg = 32818;
pub const arm64_sysreg_ARM64_SYSREG_OSLAR_EL1: arm64_sysreg = 32900;
pub const arm64_sysreg_ARM64_SYSREG_OSLSR_EL1: arm64_sysreg = 32908;
pub const arm64_sysreg_ARM64_SYSREG_PAN: arm64_sysreg = 49683;
pub const arm64_sysreg_ARM64_SYSREG_PAR_EL1: arm64_sysreg = 50080;
pub const arm64_sysreg_ARM64_SYSREG_PMBIDR_EL1: arm64_sysreg = 50391;
pub const arm64_sysreg_ARM64_SYSREG_PMBLIMITR_EL1: arm64_sysreg = 50384;
pub const arm64_sysreg_ARM64_SYSREG_PMBPTR_EL1: arm64_sysreg = 50385;
pub const arm64_sysreg_ARM64_SYSREG_PMBSR_EL1: arm64_sysreg = 50387;
pub const arm64_sysreg_ARM64_SYSREG_PMCCFILTR_EL0: arm64_sysreg = 57215;
pub const arm64_sysreg_ARM64_SYSREG_PMCCNTR_EL0: arm64_sysreg = 56552;
pub const arm64_sysreg_ARM64_SYSREG_PMCEID0_EL0: arm64_sysreg = 56550;
pub const arm64_sysreg_ARM64_SYSREG_PMCEID1_EL0: arm64_sysreg = 56551;
pub const arm64_sysreg_ARM64_SYSREG_PMCNTENCLR_EL0: arm64_sysreg = 56546;
pub const arm64_sysreg_ARM64_SYSREG_PMCNTENSET_EL0: arm64_sysreg = 56545;
pub const arm64_sysreg_ARM64_SYSREG_PMCR_EL0: arm64_sysreg = 56544;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR0_EL0: arm64_sysreg = 57152;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR10_EL0: arm64_sysreg = 57162;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR11_EL0: arm64_sysreg = 57163;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR12_EL0: arm64_sysreg = 57164;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR13_EL0: arm64_sysreg = 57165;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR14_EL0: arm64_sysreg = 57166;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR15_EL0: arm64_sysreg = 57167;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR16_EL0: arm64_sysreg = 57168;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR17_EL0: arm64_sysreg = 57169;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR18_EL0: arm64_sysreg = 57170;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR19_EL0: arm64_sysreg = 57171;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR1_EL0: arm64_sysreg = 57153;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR20_EL0: arm64_sysreg = 57172;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR21_EL0: arm64_sysreg = 57173;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR22_EL0: arm64_sysreg = 57174;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR23_EL0: arm64_sysreg = 57175;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR24_EL0: arm64_sysreg = 57176;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR25_EL0: arm64_sysreg = 57177;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR26_EL0: arm64_sysreg = 57178;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR27_EL0: arm64_sysreg = 57179;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR28_EL0: arm64_sysreg = 57180;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR29_EL0: arm64_sysreg = 57181;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR2_EL0: arm64_sysreg = 57154;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR30_EL0: arm64_sysreg = 57182;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR3_EL0: arm64_sysreg = 57155;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR4_EL0: arm64_sysreg = 57156;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR5_EL0: arm64_sysreg = 57157;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR6_EL0: arm64_sysreg = 57158;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR7_EL0: arm64_sysreg = 57159;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR8_EL0: arm64_sysreg = 57160;
pub const arm64_sysreg_ARM64_SYSREG_PMEVCNTR9_EL0: arm64_sysreg = 57161;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER0_EL0: arm64_sysreg = 57184;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER10_EL0: arm64_sysreg = 57194;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER11_EL0: arm64_sysreg = 57195;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER12_EL0: arm64_sysreg = 57196;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER13_EL0: arm64_sysreg = 57197;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER14_EL0: arm64_sysreg = 57198;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER15_EL0: arm64_sysreg = 57199;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER16_EL0: arm64_sysreg = 57200;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER17_EL0: arm64_sysreg = 57201;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER18_EL0: arm64_sysreg = 57202;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER19_EL0: arm64_sysreg = 57203;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER1_EL0: arm64_sysreg = 57185;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER20_EL0: arm64_sysreg = 57204;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER21_EL0: arm64_sysreg = 57205;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER22_EL0: arm64_sysreg = 57206;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER23_EL0: arm64_sysreg = 57207;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER24_EL0: arm64_sysreg = 57208;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER25_EL0: arm64_sysreg = 57209;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER26_EL0: arm64_sysreg = 57210;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER27_EL0: arm64_sysreg = 57211;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER28_EL0: arm64_sysreg = 57212;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER29_EL0: arm64_sysreg = 57213;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER2_EL0: arm64_sysreg = 57186;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER30_EL0: arm64_sysreg = 57214;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER3_EL0: arm64_sysreg = 57187;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER4_EL0: arm64_sysreg = 57188;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER5_EL0: arm64_sysreg = 57189;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER6_EL0: arm64_sysreg = 57190;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER7_EL0: arm64_sysreg = 57191;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER8_EL0: arm64_sysreg = 57192;
pub const arm64_sysreg_ARM64_SYSREG_PMEVTYPER9_EL0: arm64_sysreg = 57193;
pub const arm64_sysreg_ARM64_SYSREG_PMINTENCLR_EL1: arm64_sysreg = 50418;
pub const arm64_sysreg_ARM64_SYSREG_PMINTENSET_EL1: arm64_sysreg = 50417;
pub const arm64_sysreg_ARM64_SYSREG_PMMIR_EL1: arm64_sysreg = 50422;
pub const arm64_sysreg_ARM64_SYSREG_PMOVSCLR_EL0: arm64_sysreg = 56547;
pub const arm64_sysreg_ARM64_SYSREG_PMOVSSET_EL0: arm64_sysreg = 56563;
pub const arm64_sysreg_ARM64_SYSREG_PMSCR_EL1: arm64_sysreg = 50376;
pub const arm64_sysreg_ARM64_SYSREG_PMSCR_EL12: arm64_sysreg = 60616;
pub const arm64_sysreg_ARM64_SYSREG_PMSCR_EL2: arm64_sysreg = 58568;
pub const arm64_sysreg_ARM64_SYSREG_PMSELR_EL0: arm64_sysreg = 56549;
pub const arm64_sysreg_ARM64_SYSREG_PMSEVFR_EL1: arm64_sysreg = 50381;
pub const arm64_sysreg_ARM64_SYSREG_PMSFCR_EL1: arm64_sysreg = 50380;
pub const arm64_sysreg_ARM64_SYSREG_PMSICR_EL1: arm64_sysreg = 50378;
pub const arm64_sysreg_ARM64_SYSREG_PMSIDR_EL1: arm64_sysreg = 50383;
pub const arm64_sysreg_ARM64_SYSREG_PMSIRR_EL1: arm64_sysreg = 50379;
pub const arm64_sysreg_ARM64_SYSREG_PMSLATFR_EL1: arm64_sysreg = 50382;
pub const arm64_sysreg_ARM64_SYSREG_PMSNEVFR_EL1: arm64_sysreg = 50377;
pub const arm64_sysreg_ARM64_SYSREG_PMSWINC_EL0: arm64_sysreg = 56548;
pub const arm64_sysreg_ARM64_SYSREG_PMUSERENR_EL0: arm64_sysreg = 56560;
pub const arm64_sysreg_ARM64_SYSREG_PMXEVCNTR_EL0: arm64_sysreg = 56554;
pub const arm64_sysreg_ARM64_SYSREG_PMXEVTYPER_EL0: arm64_sysreg = 56553;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR10_EL1: arm64_sysreg = 50024;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR10_EL2: arm64_sysreg = 58216;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR11_EL1: arm64_sysreg = 50028;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR11_EL2: arm64_sysreg = 58220;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR12_EL1: arm64_sysreg = 50032;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR12_EL2: arm64_sysreg = 58224;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR13_EL1: arm64_sysreg = 50036;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR13_EL2: arm64_sysreg = 58228;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR14_EL1: arm64_sysreg = 50040;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR14_EL2: arm64_sysreg = 58232;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR15_EL1: arm64_sysreg = 50044;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR15_EL2: arm64_sysreg = 58236;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR1_EL1: arm64_sysreg = 49988;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR1_EL2: arm64_sysreg = 58180;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR2_EL1: arm64_sysreg = 49992;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR2_EL2: arm64_sysreg = 58184;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR3_EL1: arm64_sysreg = 49996;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR3_EL2: arm64_sysreg = 58188;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR4_EL1: arm64_sysreg = 50000;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR4_EL2: arm64_sysreg = 58192;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR5_EL1: arm64_sysreg = 50004;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR5_EL2: arm64_sysreg = 58196;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR6_EL1: arm64_sysreg = 50008;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR6_EL2: arm64_sysreg = 58200;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR7_EL1: arm64_sysreg = 50012;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR7_EL2: arm64_sysreg = 58204;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR8_EL1: arm64_sysreg = 50016;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR8_EL2: arm64_sysreg = 58208;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR9_EL1: arm64_sysreg = 50020;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR9_EL2: arm64_sysreg = 58212;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR_EL1: arm64_sysreg = 49984;
pub const arm64_sysreg_ARM64_SYSREG_PRBAR_EL2: arm64_sysreg = 58176;
pub const arm64_sysreg_ARM64_SYSREG_PRENR_EL1: arm64_sysreg = 49929;
pub const arm64_sysreg_ARM64_SYSREG_PRENR_EL2: arm64_sysreg = 58121;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR10_EL1: arm64_sysreg = 50025;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR10_EL2: arm64_sysreg = 58217;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR11_EL1: arm64_sysreg = 50029;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR11_EL2: arm64_sysreg = 58221;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR12_EL1: arm64_sysreg = 50033;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR12_EL2: arm64_sysreg = 58225;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR13_EL1: arm64_sysreg = 50037;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR13_EL2: arm64_sysreg = 58229;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR14_EL1: arm64_sysreg = 50041;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR14_EL2: arm64_sysreg = 58233;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR15_EL1: arm64_sysreg = 50045;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR15_EL2: arm64_sysreg = 58237;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR1_EL1: arm64_sysreg = 49989;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR1_EL2: arm64_sysreg = 58181;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR2_EL1: arm64_sysreg = 49993;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR2_EL2: arm64_sysreg = 58185;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR3_EL1: arm64_sysreg = 49997;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR3_EL2: arm64_sysreg = 58189;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR4_EL1: arm64_sysreg = 50001;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR4_EL2: arm64_sysreg = 58193;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR5_EL1: arm64_sysreg = 50005;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR5_EL2: arm64_sysreg = 58197;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR6_EL1: arm64_sysreg = 50009;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR6_EL2: arm64_sysreg = 58201;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR7_EL1: arm64_sysreg = 50013;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR7_EL2: arm64_sysreg = 58205;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR8_EL1: arm64_sysreg = 50017;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR8_EL2: arm64_sysreg = 58209;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR9_EL1: arm64_sysreg = 50021;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR9_EL2: arm64_sysreg = 58213;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR_EL1: arm64_sysreg = 49985;
pub const arm64_sysreg_ARM64_SYSREG_PRLAR_EL2: arm64_sysreg = 58177;
pub const arm64_sysreg_ARM64_SYSREG_PRSELR_EL1: arm64_sysreg = 49937;
pub const arm64_sysreg_ARM64_SYSREG_PRSELR_EL2: arm64_sysreg = 58129;
pub const arm64_sysreg_ARM64_SYSREG_REVIDR_EL1: arm64_sysreg = 49158;
pub const arm64_sysreg_ARM64_SYSREG_RGSR_EL1: arm64_sysreg = 49285;
pub const arm64_sysreg_ARM64_SYSREG_RMR_EL1: arm64_sysreg = 50690;
pub const arm64_sysreg_ARM64_SYSREG_RMR_EL2: arm64_sysreg = 58882;
pub const arm64_sysreg_ARM64_SYSREG_RMR_EL3: arm64_sysreg = 62978;
pub const arm64_sysreg_ARM64_SYSREG_RNDR: arm64_sysreg = 55584;
pub const arm64_sysreg_ARM64_SYSREG_RNDRRS: arm64_sysreg = 55585;
pub const arm64_sysreg_ARM64_SYSREG_RVBAR_EL1: arm64_sysreg = 50689;
pub const arm64_sysreg_ARM64_SYSREG_RVBAR_EL2: arm64_sysreg = 58881;
pub const arm64_sysreg_ARM64_SYSREG_RVBAR_EL3: arm64_sysreg = 62977;
pub const arm64_sysreg_ARM64_SYSREG_SCR_EL3: arm64_sysreg = 61576;
pub const arm64_sysreg_ARM64_SYSREG_SCTLR_EL1: arm64_sysreg = 49280;
pub const arm64_sysreg_ARM64_SYSREG_SCTLR_EL12: arm64_sysreg = 59520;
pub const arm64_sysreg_ARM64_SYSREG_SCTLR_EL2: arm64_sysreg = 57472;
pub const arm64_sysreg_ARM64_SYSREG_SCTLR_EL3: arm64_sysreg = 61568;
pub const arm64_sysreg_ARM64_SYSREG_SCXTNUM_EL0: arm64_sysreg = 56967;
pub const arm64_sysreg_ARM64_SYSREG_SCXTNUM_EL1: arm64_sysreg = 50823;
pub const arm64_sysreg_ARM64_SYSREG_SCXTNUM_EL12: arm64_sysreg = 61063;
pub const arm64_sysreg_ARM64_SYSREG_SCXTNUM_EL2: arm64_sysreg = 59015;
pub const arm64_sysreg_ARM64_SYSREG_SCXTNUM_EL3: arm64_sysreg = 63111;
pub const arm64_sysreg_ARM64_SYSREG_SDER32_EL2: arm64_sysreg = 57497;
pub const arm64_sysreg_ARM64_SYSREG_SDER32_EL3: arm64_sysreg = 61577;
pub const arm64_sysreg_ARM64_SYSREG_SMCR_EL1: arm64_sysreg = 49302;
pub const arm64_sysreg_ARM64_SYSREG_SMCR_EL12: arm64_sysreg = 59542;
pub const arm64_sysreg_ARM64_SYSREG_SMCR_EL2: arm64_sysreg = 57494;
pub const arm64_sysreg_ARM64_SYSREG_SMCR_EL3: arm64_sysreg = 61590;
pub const arm64_sysreg_ARM64_SYSREG_SMIDR_EL1: arm64_sysreg = 51206;
pub const arm64_sysreg_ARM64_SYSREG_SMPRIMAP_EL2: arm64_sysreg = 57493;
pub const arm64_sysreg_ARM64_SYSREG_SMPRI_EL1: arm64_sysreg = 49300;
pub const arm64_sysreg_ARM64_SYSREG_SPSEL: arm64_sysreg = 49680;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_ABT: arm64_sysreg = 57881;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_EL1: arm64_sysreg = 49664;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_EL12: arm64_sysreg = 59904;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_EL2: arm64_sysreg = 57856;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_EL3: arm64_sysreg = 61952;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_FIQ: arm64_sysreg = 57883;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_IRQ: arm64_sysreg = 57880;
pub const arm64_sysreg_ARM64_SYSREG_SPSR_UND: arm64_sysreg = 57882;
pub const arm64_sysreg_ARM64_SYSREG_SP_EL0: arm64_sysreg = 49672;
pub const arm64_sysreg_ARM64_SYSREG_SP_EL1: arm64_sysreg = 57864;
pub const arm64_sysreg_ARM64_SYSREG_SP_EL2: arm64_sysreg = 61960;
pub const arm64_sysreg_ARM64_SYSREG_SSBS: arm64_sysreg = 55830;
pub const arm64_sysreg_ARM64_SYSREG_SVCR: arm64_sysreg = 55826;
pub const arm64_sysreg_ARM64_SYSREG_TCO: arm64_sysreg = 55831;
pub const arm64_sysreg_ARM64_SYSREG_TCR_EL1: arm64_sysreg = 49410;
pub const arm64_sysreg_ARM64_SYSREG_TCR_EL12: arm64_sysreg = 59650;
pub const arm64_sysreg_ARM64_SYSREG_TCR_EL2: arm64_sysreg = 57602;
pub const arm64_sysreg_ARM64_SYSREG_TCR_EL3: arm64_sysreg = 61698;
pub const arm64_sysreg_ARM64_SYSREG_TEECR32_EL1: arm64_sysreg = 36864;
pub const arm64_sysreg_ARM64_SYSREG_TEEHBR32_EL1: arm64_sysreg = 36992;
pub const arm64_sysreg_ARM64_SYSREG_TFSRE0_EL1: arm64_sysreg = 49841;
pub const arm64_sysreg_ARM64_SYSREG_TFSR_EL1: arm64_sysreg = 49840;
pub const arm64_sysreg_ARM64_SYSREG_TFSR_EL12: arm64_sysreg = 60080;
pub const arm64_sysreg_ARM64_SYSREG_TFSR_EL2: arm64_sysreg = 58032;
pub const arm64_sysreg_ARM64_SYSREG_TFSR_EL3: arm64_sysreg = 62128;
pub const arm64_sysreg_ARM64_SYSREG_TPIDR2_EL0: arm64_sysreg = 56965;
pub const arm64_sysreg_ARM64_SYSREG_TPIDRRO_EL0: arm64_sysreg = 56963;
pub const arm64_sysreg_ARM64_SYSREG_TPIDR_EL0: arm64_sysreg = 56962;
pub const arm64_sysreg_ARM64_SYSREG_TPIDR_EL1: arm64_sysreg = 50820;
pub const arm64_sysreg_ARM64_SYSREG_TPIDR_EL2: arm64_sysreg = 59010;
pub const arm64_sysreg_ARM64_SYSREG_TPIDR_EL3: arm64_sysreg = 63106;
pub const arm64_sysreg_ARM64_SYSREG_TRBBASER_EL1: arm64_sysreg = 50394;
pub const arm64_sysreg_ARM64_SYSREG_TRBIDR_EL1: arm64_sysreg = 50399;
pub const arm64_sysreg_ARM64_SYSREG_TRBLIMITR_EL1: arm64_sysreg = 50392;
pub const arm64_sysreg_ARM64_SYSREG_TRBMAR_EL1: arm64_sysreg = 50396;
pub const arm64_sysreg_ARM64_SYSREG_TRBPTR_EL1: arm64_sysreg = 50393;
pub const arm64_sysreg_ARM64_SYSREG_TRBSR_EL1: arm64_sysreg = 50395;
pub const arm64_sysreg_ARM64_SYSREG_TRBTRG_EL1: arm64_sysreg = 50398;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR0: arm64_sysreg = 35074;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR1: arm64_sysreg = 35090;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR10: arm64_sysreg = 35107;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR11: arm64_sysreg = 35123;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR12: arm64_sysreg = 35139;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR13: arm64_sysreg = 35155;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR14: arm64_sysreg = 35171;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR15: arm64_sysreg = 35187;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR2: arm64_sysreg = 35106;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR3: arm64_sysreg = 35122;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR4: arm64_sysreg = 35138;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR5: arm64_sysreg = 35154;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR6: arm64_sysreg = 35170;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR7: arm64_sysreg = 35186;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR8: arm64_sysreg = 35075;
pub const arm64_sysreg_ARM64_SYSREG_TRCACATR9: arm64_sysreg = 35091;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR0: arm64_sysreg = 35072;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR1: arm64_sysreg = 35088;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR10: arm64_sysreg = 35105;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR11: arm64_sysreg = 35121;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR12: arm64_sysreg = 35137;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR13: arm64_sysreg = 35153;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR14: arm64_sysreg = 35169;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR15: arm64_sysreg = 35185;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR2: arm64_sysreg = 35104;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR3: arm64_sysreg = 35120;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR4: arm64_sysreg = 35136;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR5: arm64_sysreg = 35152;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR6: arm64_sysreg = 35168;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR7: arm64_sysreg = 35184;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR8: arm64_sysreg = 35073;
pub const arm64_sysreg_ARM64_SYSREG_TRCACVR9: arm64_sysreg = 35089;
pub const arm64_sysreg_ARM64_SYSREG_TRCAUTHSTATUS: arm64_sysreg = 35830;
pub const arm64_sysreg_ARM64_SYSREG_TRCAUXCTLR: arm64_sysreg = 34864;
pub const arm64_sysreg_ARM64_SYSREG_TRCBBCTLR: arm64_sysreg = 34936;
pub const arm64_sysreg_ARM64_SYSREG_TRCCCCTLR: arm64_sysreg = 34928;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCCTLR0: arm64_sysreg = 35202;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCCTLR1: arm64_sysreg = 35210;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR0: arm64_sysreg = 35200;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR1: arm64_sysreg = 35216;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR2: arm64_sysreg = 35232;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR3: arm64_sysreg = 35248;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR4: arm64_sysreg = 35264;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR5: arm64_sysreg = 35280;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR6: arm64_sysreg = 35296;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDCVR7: arm64_sysreg = 35312;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDR0: arm64_sysreg = 35815;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDR1: arm64_sysreg = 35823;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDR2: arm64_sysreg = 35831;
pub const arm64_sysreg_ARM64_SYSREG_TRCCIDR3: arm64_sysreg = 35839;
pub const arm64_sysreg_ARM64_SYSREG_TRCCLAIMCLR: arm64_sysreg = 35790;
pub const arm64_sysreg_ARM64_SYSREG_TRCCLAIMSET: arm64_sysreg = 35782;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTCTLR0: arm64_sysreg = 34853;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTCTLR1: arm64_sysreg = 34861;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTCTLR2: arm64_sysreg = 34869;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTCTLR3: arm64_sysreg = 34877;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTRLDVR0: arm64_sysreg = 34821;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTRLDVR1: arm64_sysreg = 34829;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTRLDVR2: arm64_sysreg = 34837;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTRLDVR3: arm64_sysreg = 34845;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTVR0: arm64_sysreg = 34885;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTVR1: arm64_sysreg = 34893;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTVR2: arm64_sysreg = 34901;
pub const arm64_sysreg_ARM64_SYSREG_TRCCNTVR3: arm64_sysreg = 34909;
pub const arm64_sysreg_ARM64_SYSREG_TRCCONFIGR: arm64_sysreg = 34848;
pub const arm64_sysreg_ARM64_SYSREG_TRCDEVAFF0: arm64_sysreg = 35798;
pub const arm64_sysreg_ARM64_SYSREG_TRCDEVAFF1: arm64_sysreg = 35806;
pub const arm64_sysreg_ARM64_SYSREG_TRCDEVARCH: arm64_sysreg = 35838;
pub const arm64_sysreg_ARM64_SYSREG_TRCDEVID: arm64_sysreg = 35735;
pub const arm64_sysreg_ARM64_SYSREG_TRCDEVTYPE: arm64_sysreg = 35743;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR0: arm64_sysreg = 35078;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR1: arm64_sysreg = 35110;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR2: arm64_sysreg = 35142;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR3: arm64_sysreg = 35174;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR4: arm64_sysreg = 35079;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR5: arm64_sysreg = 35111;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR6: arm64_sysreg = 35143;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCMR7: arm64_sysreg = 35175;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR0: arm64_sysreg = 35076;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR1: arm64_sysreg = 35108;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR2: arm64_sysreg = 35140;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR3: arm64_sysreg = 35172;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR4: arm64_sysreg = 35077;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR5: arm64_sysreg = 35109;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR6: arm64_sysreg = 35141;
pub const arm64_sysreg_ARM64_SYSREG_TRCDVCVR7: arm64_sysreg = 35173;
pub const arm64_sysreg_ARM64_SYSREG_TRCEVENTCTL0R: arm64_sysreg = 34880;
pub const arm64_sysreg_ARM64_SYSREG_TRCEVENTCTL1R: arm64_sysreg = 34888;
pub const arm64_sysreg_ARM64_SYSREG_TRCEXTINSELR: arm64_sysreg = 34884;
pub const arm64_sysreg_ARM64_SYSREG_TRCEXTINSELR0: arm64_sysreg = 34884;
pub const arm64_sysreg_ARM64_SYSREG_TRCEXTINSELR1: arm64_sysreg = 34892;
pub const arm64_sysreg_ARM64_SYSREG_TRCEXTINSELR2: arm64_sysreg = 34900;
pub const arm64_sysreg_ARM64_SYSREG_TRCEXTINSELR3: arm64_sysreg = 34908;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR0: arm64_sysreg = 34887;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR1: arm64_sysreg = 34895;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR10: arm64_sysreg = 34838;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR11: arm64_sysreg = 34846;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR12: arm64_sysreg = 34854;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR13: arm64_sysreg = 34862;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR2: arm64_sysreg = 34903;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR3: arm64_sysreg = 34911;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR4: arm64_sysreg = 34919;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR5: arm64_sysreg = 34927;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR6: arm64_sysreg = 34935;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR7: arm64_sysreg = 34943;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR8: arm64_sysreg = 34822;
pub const arm64_sysreg_ARM64_SYSREG_TRCIDR9: arm64_sysreg = 34830;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC0: arm64_sysreg = 34823;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC1: arm64_sysreg = 34831;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC2: arm64_sysreg = 34839;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC3: arm64_sysreg = 34847;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC4: arm64_sysreg = 34855;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC5: arm64_sysreg = 34863;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC6: arm64_sysreg = 34871;
pub const arm64_sysreg_ARM64_SYSREG_TRCIMSPEC7: arm64_sysreg = 34879;
pub const arm64_sysreg_ARM64_SYSREG_TRCITCTRL: arm64_sysreg = 35716;
pub const arm64_sysreg_ARM64_SYSREG_TRCLAR: arm64_sysreg = 35814;
pub const arm64_sysreg_ARM64_SYSREG_TRCLSR: arm64_sysreg = 35822;
pub const arm64_sysreg_ARM64_SYSREG_TRCOSLAR: arm64_sysreg = 34948;
pub const arm64_sysreg_ARM64_SYSREG_TRCOSLSR: arm64_sysreg = 34956;
pub const arm64_sysreg_ARM64_SYSREG_TRCPDCR: arm64_sysreg = 34980;
pub const arm64_sysreg_ARM64_SYSREG_TRCPDSR: arm64_sysreg = 34988;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR0: arm64_sysreg = 35783;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR1: arm64_sysreg = 35791;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR2: arm64_sysreg = 35799;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR3: arm64_sysreg = 35807;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR4: arm64_sysreg = 35751;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR5: arm64_sysreg = 35759;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR6: arm64_sysreg = 35767;
pub const arm64_sysreg_ARM64_SYSREG_TRCPIDR7: arm64_sysreg = 35775;
pub const arm64_sysreg_ARM64_SYSREG_TRCPRGCTLR: arm64_sysreg = 34824;
pub const arm64_sysreg_ARM64_SYSREG_TRCPROCSELR: arm64_sysreg = 34832;
pub const arm64_sysreg_ARM64_SYSREG_TRCQCTLR: arm64_sysreg = 34825;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR10: arm64_sysreg = 35024;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR11: arm64_sysreg = 35032;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR12: arm64_sysreg = 35040;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR13: arm64_sysreg = 35048;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR14: arm64_sysreg = 35056;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR15: arm64_sysreg = 35064;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR16: arm64_sysreg = 34945;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR17: arm64_sysreg = 34953;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR18: arm64_sysreg = 34961;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR19: arm64_sysreg = 34969;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR2: arm64_sysreg = 34960;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR20: arm64_sysreg = 34977;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR21: arm64_sysreg = 34985;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR22: arm64_sysreg = 34993;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR23: arm64_sysreg = 35001;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR24: arm64_sysreg = 35009;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR25: arm64_sysreg = 35017;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR26: arm64_sysreg = 35025;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR27: arm64_sysreg = 35033;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR28: arm64_sysreg = 35041;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR29: arm64_sysreg = 35049;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR3: arm64_sysreg = 34968;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR30: arm64_sysreg = 35057;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR31: arm64_sysreg = 35065;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR4: arm64_sysreg = 34976;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR5: arm64_sysreg = 34984;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR6: arm64_sysreg = 34992;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR7: arm64_sysreg = 35000;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR8: arm64_sysreg = 35008;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSCTLR9: arm64_sysreg = 35016;
pub const arm64_sysreg_ARM64_SYSREG_TRCRSR: arm64_sysreg = 34896;
pub const arm64_sysreg_ARM64_SYSREG_TRCSEQEVR0: arm64_sysreg = 34820;
pub const arm64_sysreg_ARM64_SYSREG_TRCSEQEVR1: arm64_sysreg = 34828;
pub const arm64_sysreg_ARM64_SYSREG_TRCSEQEVR2: arm64_sysreg = 34836;
pub const arm64_sysreg_ARM64_SYSREG_TRCSEQRSTEVR: arm64_sysreg = 34868;
pub const arm64_sysreg_ARM64_SYSREG_TRCSEQSTR: arm64_sysreg = 34876;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR0: arm64_sysreg = 34946;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR1: arm64_sysreg = 34954;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR2: arm64_sysreg = 34962;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR3: arm64_sysreg = 34970;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR4: arm64_sysreg = 34978;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR5: arm64_sysreg = 34986;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR6: arm64_sysreg = 34994;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCCR7: arm64_sysreg = 35002;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR0: arm64_sysreg = 35010;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR1: arm64_sysreg = 35018;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR2: arm64_sysreg = 35026;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR3: arm64_sysreg = 35034;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR4: arm64_sysreg = 35042;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR5: arm64_sysreg = 35050;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR6: arm64_sysreg = 35058;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSCSR7: arm64_sysreg = 35066;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR0: arm64_sysreg = 34947;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR1: arm64_sysreg = 34955;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR2: arm64_sysreg = 34963;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR3: arm64_sysreg = 34971;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR4: arm64_sysreg = 34979;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR5: arm64_sysreg = 34987;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR6: arm64_sysreg = 34995;
pub const arm64_sysreg_ARM64_SYSREG_TRCSSPCICR7: arm64_sysreg = 35003;
pub const arm64_sysreg_ARM64_SYSREG_TRCSTALLCTLR: arm64_sysreg = 34904;
pub const arm64_sysreg_ARM64_SYSREG_TRCSTATR: arm64_sysreg = 34840;
pub const arm64_sysreg_ARM64_SYSREG_TRCSYNCPR: arm64_sysreg = 34920;
pub const arm64_sysreg_ARM64_SYSREG_TRCTRACEIDR: arm64_sysreg = 34817;
pub const arm64_sysreg_ARM64_SYSREG_TRCTSCTLR: arm64_sysreg = 34912;
pub const arm64_sysreg_ARM64_SYSREG_TRCVDARCCTLR: arm64_sysreg = 34898;
pub const arm64_sysreg_ARM64_SYSREG_TRCVDCTLR: arm64_sysreg = 34882;
pub const arm64_sysreg_ARM64_SYSREG_TRCVDSACCTLR: arm64_sysreg = 34890;
pub const arm64_sysreg_ARM64_SYSREG_TRCVICTLR: arm64_sysreg = 34818;
pub const arm64_sysreg_ARM64_SYSREG_TRCVIIECTLR: arm64_sysreg = 34826;
pub const arm64_sysreg_ARM64_SYSREG_TRCVIPCSSCTLR: arm64_sysreg = 34842;
pub const arm64_sysreg_ARM64_SYSREG_TRCVISSCTLR: arm64_sysreg = 34834;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCCTLR0: arm64_sysreg = 35218;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCCTLR1: arm64_sysreg = 35226;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR0: arm64_sysreg = 35201;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR1: arm64_sysreg = 35217;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR2: arm64_sysreg = 35233;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR3: arm64_sysreg = 35249;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR4: arm64_sysreg = 35265;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR5: arm64_sysreg = 35281;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR6: arm64_sysreg = 35297;
pub const arm64_sysreg_ARM64_SYSREG_TRCVMIDCVR7: arm64_sysreg = 35313;
pub const arm64_sysreg_ARM64_SYSREG_TRFCR_EL1: arm64_sysreg = 49297;
pub const arm64_sysreg_ARM64_SYSREG_TRFCR_EL12: arm64_sysreg = 59537;
pub const arm64_sysreg_ARM64_SYSREG_TRFCR_EL2: arm64_sysreg = 57489;
pub const arm64_sysreg_ARM64_SYSREG_TTBR0_EL1: arm64_sysreg = 49408;
pub const arm64_sysreg_ARM64_SYSREG_TTBR0_EL12: arm64_sysreg = 59648;
pub const arm64_sysreg_ARM64_SYSREG_TTBR0_EL2: arm64_sysreg = 57600;
pub const arm64_sysreg_ARM64_SYSREG_TTBR0_EL3: arm64_sysreg = 61696;
pub const arm64_sysreg_ARM64_SYSREG_TTBR1_EL1: arm64_sysreg = 49409;
pub const arm64_sysreg_ARM64_SYSREG_TTBR1_EL12: arm64_sysreg = 59649;
pub const arm64_sysreg_ARM64_SYSREG_TTBR1_EL2: arm64_sysreg = 57601;
pub const arm64_sysreg_ARM64_SYSREG_UAO: arm64_sysreg = 49684;
pub const arm64_sysreg_ARM64_SYSREG_VBAR_EL1: arm64_sysreg = 50688;
pub const arm64_sysreg_ARM64_SYSREG_VBAR_EL12: arm64_sysreg = 60928;
pub const arm64_sysreg_ARM64_SYSREG_VBAR_EL2: arm64_sysreg = 58880;
pub const arm64_sysreg_ARM64_SYSREG_VBAR_EL3: arm64_sysreg = 62976;
pub const arm64_sysreg_ARM64_SYSREG_VDISR_EL2: arm64_sysreg = 58889;
pub const arm64_sysreg_ARM64_SYSREG_VMPIDR_EL2: arm64_sysreg = 57349;
pub const arm64_sysreg_ARM64_SYSREG_VNCR_EL2: arm64_sysreg = 57616;
pub const arm64_sysreg_ARM64_SYSREG_VPIDR_EL2: arm64_sysreg = 57344;
pub const arm64_sysreg_ARM64_SYSREG_VSCTLR_EL2: arm64_sysreg = 57600;
pub const arm64_sysreg_ARM64_SYSREG_VSESR_EL2: arm64_sysreg = 58003;
pub const arm64_sysreg_ARM64_SYSREG_VSTCR_EL2: arm64_sysreg = 57650;
pub const arm64_sysreg_ARM64_SYSREG_VSTTBR_EL2: arm64_sysreg = 57648;
pub const arm64_sysreg_ARM64_SYSREG_VTCR_EL2: arm64_sysreg = 57610;
pub const arm64_sysreg_ARM64_SYSREG_VTTBR_EL2: arm64_sysreg = 57608;
pub const arm64_sysreg_ARM64_SYSREG_ZCR_EL1: arm64_sysreg = 49296;
pub const arm64_sysreg_ARM64_SYSREG_ZCR_EL12: arm64_sysreg = 59536;
pub const arm64_sysreg_ARM64_SYSREG_ZCR_EL2: arm64_sysreg = 57488;
pub const arm64_sysreg_ARM64_SYSREG_ZCR_EL3: arm64_sysreg = 61584;
pub type arm64_sysreg = cty::c_uint;
pub const arm64_pstate_ARM64_PSTATE_INVALID: arm64_pstate = 0;
pub const arm64_pstate_ARM64_PSTATE_SPSEL: arm64_pstate = 5;
pub const arm64_pstate_ARM64_PSTATE_DAIFSET: arm64_pstate = 30;
pub const arm64_pstate_ARM64_PSTATE_DAIFCLR: arm64_pstate = 31;
pub const arm64_pstate_ARM64_PSTATE_PAN: arm64_pstate = 4;
pub const arm64_pstate_ARM64_PSTATE_UAO: arm64_pstate = 3;
pub const arm64_pstate_ARM64_PSTATE_DIT: arm64_pstate = 26;
pub type arm64_pstate = cty::c_uint;
pub const arm64_vas_ARM64_VAS_INVALID: arm64_vas = 0;
pub const arm64_vas_ARM64_VAS_16B: arm64_vas = 1;
pub const arm64_vas_ARM64_VAS_8B: arm64_vas = 2;
pub const arm64_vas_ARM64_VAS_4B: arm64_vas = 3;
pub const arm64_vas_ARM64_VAS_1B: arm64_vas = 4;
pub const arm64_vas_ARM64_VAS_8H: arm64_vas = 5;
pub const arm64_vas_ARM64_VAS_4H: arm64_vas = 6;
pub const arm64_vas_ARM64_VAS_2H: arm64_vas = 7;
pub const arm64_vas_ARM64_VAS_1H: arm64_vas = 8;
pub const arm64_vas_ARM64_VAS_4S: arm64_vas = 9;
pub const arm64_vas_ARM64_VAS_2S: arm64_vas = 10;
pub const arm64_vas_ARM64_VAS_1S: arm64_vas = 11;
pub const arm64_vas_ARM64_VAS_2D: arm64_vas = 12;
pub const arm64_vas_ARM64_VAS_1D: arm64_vas = 13;
pub const arm64_vas_ARM64_VAS_1Q: arm64_vas = 14;
pub type arm64_vas = cty::c_uint;
pub const arm64_barrier_op_ARM64_BARRIER_INVALID: arm64_barrier_op = 0;
pub const arm64_barrier_op_ARM64_BARRIER_OSHLD: arm64_barrier_op = 1;
pub const arm64_barrier_op_ARM64_BARRIER_OSHST: arm64_barrier_op = 2;
pub const arm64_barrier_op_ARM64_BARRIER_OSH: arm64_barrier_op = 3;
pub const arm64_barrier_op_ARM64_BARRIER_NSHLD: arm64_barrier_op = 5;
pub const arm64_barrier_op_ARM64_BARRIER_NSHST: arm64_barrier_op = 6;
pub const arm64_barrier_op_ARM64_BARRIER_NSH: arm64_barrier_op = 7;
pub const arm64_barrier_op_ARM64_BARRIER_ISHLD: arm64_barrier_op = 9;
pub const arm64_barrier_op_ARM64_BARRIER_ISHST: arm64_barrier_op = 10;
pub const arm64_barrier_op_ARM64_BARRIER_ISH: arm64_barrier_op = 11;
pub const arm64_barrier_op_ARM64_BARRIER_LD: arm64_barrier_op = 13;
pub const arm64_barrier_op_ARM64_BARRIER_ST: arm64_barrier_op = 14;
pub const arm64_barrier_op_ARM64_BARRIER_SY: arm64_barrier_op = 15;
pub type arm64_barrier_op = cty::c_uint;
pub const arm64_op_type_ARM64_OP_INVALID: arm64_op_type = 0;
pub const arm64_op_type_ARM64_OP_REG: arm64_op_type = 1;
pub const arm64_op_type_ARM64_OP_IMM: arm64_op_type = 2;
pub const arm64_op_type_ARM64_OP_MEM: arm64_op_type = 3;
pub const arm64_op_type_ARM64_OP_FP: arm64_op_type = 4;
pub const arm64_op_type_ARM64_OP_CIMM: arm64_op_type = 64;
pub const arm64_op_type_ARM64_OP_REG_MRS: arm64_op_type = 65;
pub const arm64_op_type_ARM64_OP_REG_MSR: arm64_op_type = 66;
pub const arm64_op_type_ARM64_OP_PSTATE: arm64_op_type = 67;
pub const arm64_op_type_ARM64_OP_SYS: arm64_op_type = 68;
pub const arm64_op_type_ARM64_OP_SVCR: arm64_op_type = 69;
pub const arm64_op_type_ARM64_OP_PREFETCH: arm64_op_type = 70;
pub const arm64_op_type_ARM64_OP_BARRIER: arm64_op_type = 71;
pub const arm64_op_type_ARM64_OP_SME_INDEX: arm64_op_type = 72;
pub type arm64_op_type = cty::c_uint;
pub const arm64_sys_op_ARM64_SYS_INVALID: arm64_sys_op = 0;
pub const arm64_sys_op_ARM64_TLBI_ALLE1: arm64_sys_op = 1;
pub const arm64_sys_op_ARM64_TLBI_ALLE1IS: arm64_sys_op = 2;
pub const arm64_sys_op_ARM64_TLBI_ALLE1ISNXS: arm64_sys_op = 3;
pub const arm64_sys_op_ARM64_TLBI_ALLE1NXS: arm64_sys_op = 4;
pub const arm64_sys_op_ARM64_TLBI_ALLE1OS: arm64_sys_op = 5;
pub const arm64_sys_op_ARM64_TLBI_ALLE1OSNXS: arm64_sys_op = 6;
pub const arm64_sys_op_ARM64_TLBI_ALLE2: arm64_sys_op = 7;
pub const arm64_sys_op_ARM64_TLBI_ALLE2IS: arm64_sys_op = 8;
pub const arm64_sys_op_ARM64_TLBI_ALLE2ISNXS: arm64_sys_op = 9;
pub const arm64_sys_op_ARM64_TLBI_ALLE2NXS: arm64_sys_op = 10;
pub const arm64_sys_op_ARM64_TLBI_ALLE2OS: arm64_sys_op = 11;
pub const arm64_sys_op_ARM64_TLBI_ALLE2OSNXS: arm64_sys_op = 12;
pub const arm64_sys_op_ARM64_TLBI_ALLE3: arm64_sys_op = 13;
pub const arm64_sys_op_ARM64_TLBI_ALLE3IS: arm64_sys_op = 14;
pub const arm64_sys_op_ARM64_TLBI_ALLE3ISNXS: arm64_sys_op = 15;
pub const arm64_sys_op_ARM64_TLBI_ALLE3NXS: arm64_sys_op = 16;
pub const arm64_sys_op_ARM64_TLBI_ALLE3OS: arm64_sys_op = 17;
pub const arm64_sys_op_ARM64_TLBI_ALLE3OSNXS: arm64_sys_op = 18;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1: arm64_sys_op = 19;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1IS: arm64_sys_op = 20;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1ISNXS: arm64_sys_op = 21;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1NXS: arm64_sys_op = 22;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1OS: arm64_sys_op = 23;
pub const arm64_sys_op_ARM64_TLBI_ASIDE1OSNXS: arm64_sys_op = 24;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1: arm64_sys_op = 25;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1IS: arm64_sys_op = 26;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1ISNXS: arm64_sys_op = 27;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1NXS: arm64_sys_op = 28;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1OS: arm64_sys_op = 29;
pub const arm64_sys_op_ARM64_TLBI_IPAS2E1OSNXS: arm64_sys_op = 30;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1: arm64_sys_op = 31;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1IS: arm64_sys_op = 32;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1ISNXS: arm64_sys_op = 33;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1NXS: arm64_sys_op = 34;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1OS: arm64_sys_op = 35;
pub const arm64_sys_op_ARM64_TLBI_IPAS2LE1OSNXS: arm64_sys_op = 36;
pub const arm64_sys_op_ARM64_TLBI_PAALL: arm64_sys_op = 37;
pub const arm64_sys_op_ARM64_TLBI_PAALLNXS: arm64_sys_op = 38;
pub const arm64_sys_op_ARM64_TLBI_PAALLOS: arm64_sys_op = 39;
pub const arm64_sys_op_ARM64_TLBI_PAALLOSNXS: arm64_sys_op = 40;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1: arm64_sys_op = 41;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1IS: arm64_sys_op = 42;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1ISNXS: arm64_sys_op = 43;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1NXS: arm64_sys_op = 44;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1OS: arm64_sys_op = 45;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2E1OSNXS: arm64_sys_op = 46;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1: arm64_sys_op = 47;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1IS: arm64_sys_op = 48;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1ISNXS: arm64_sys_op = 49;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1NXS: arm64_sys_op = 50;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1OS: arm64_sys_op = 51;
pub const arm64_sys_op_ARM64_TLBI_RIPAS2LE1OSNXS: arm64_sys_op = 52;
pub const arm64_sys_op_ARM64_TLBI_RPALOS: arm64_sys_op = 53;
pub const arm64_sys_op_ARM64_TLBI_RPALOSNXS: arm64_sys_op = 54;
pub const arm64_sys_op_ARM64_TLBI_RPAOS: arm64_sys_op = 55;
pub const arm64_sys_op_ARM64_TLBI_RPAOSNXS: arm64_sys_op = 56;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1: arm64_sys_op = 57;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1IS: arm64_sys_op = 58;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1ISNXS: arm64_sys_op = 59;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1NXS: arm64_sys_op = 60;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1OS: arm64_sys_op = 61;
pub const arm64_sys_op_ARM64_TLBI_RVAAE1OSNXS: arm64_sys_op = 62;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1: arm64_sys_op = 63;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1IS: arm64_sys_op = 64;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1ISNXS: arm64_sys_op = 65;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1NXS: arm64_sys_op = 66;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1OS: arm64_sys_op = 67;
pub const arm64_sys_op_ARM64_TLBI_RVAALE1OSNXS: arm64_sys_op = 68;
pub const arm64_sys_op_ARM64_TLBI_RVAE1: arm64_sys_op = 69;
pub const arm64_sys_op_ARM64_TLBI_RVAE1IS: arm64_sys_op = 70;
pub const arm64_sys_op_ARM64_TLBI_RVAE1ISNXS: arm64_sys_op = 71;
pub const arm64_sys_op_ARM64_TLBI_RVAE1NXS: arm64_sys_op = 72;
pub const arm64_sys_op_ARM64_TLBI_RVAE1OS: arm64_sys_op = 73;
pub const arm64_sys_op_ARM64_TLBI_RVAE1OSNXS: arm64_sys_op = 74;
pub const arm64_sys_op_ARM64_TLBI_RVAE2: arm64_sys_op = 75;
pub const arm64_sys_op_ARM64_TLBI_RVAE2IS: arm64_sys_op = 76;
pub const arm64_sys_op_ARM64_TLBI_RVAE2ISNXS: arm64_sys_op = 77;
pub const arm64_sys_op_ARM64_TLBI_RVAE2NXS: arm64_sys_op = 78;
pub const arm64_sys_op_ARM64_TLBI_RVAE2OS: arm64_sys_op = 79;
pub const arm64_sys_op_ARM64_TLBI_RVAE2OSNXS: arm64_sys_op = 80;
pub const arm64_sys_op_ARM64_TLBI_RVAE3: arm64_sys_op = 81;
pub const arm64_sys_op_ARM64_TLBI_RVAE3IS: arm64_sys_op = 82;
pub const arm64_sys_op_ARM64_TLBI_RVAE3ISNXS: arm64_sys_op = 83;
pub const arm64_sys_op_ARM64_TLBI_RVAE3NXS: arm64_sys_op = 84;
pub const arm64_sys_op_ARM64_TLBI_RVAE3OS: arm64_sys_op = 85;
pub const arm64_sys_op_ARM64_TLBI_RVAE3OSNXS: arm64_sys_op = 86;
pub const arm64_sys_op_ARM64_TLBI_RVALE1: arm64_sys_op = 87;
pub const arm64_sys_op_ARM64_TLBI_RVALE1IS: arm64_sys_op = 88;
pub const arm64_sys_op_ARM64_TLBI_RVALE1ISNXS: arm64_sys_op = 89;
pub const arm64_sys_op_ARM64_TLBI_RVALE1NXS: arm64_sys_op = 90;
pub const arm64_sys_op_ARM64_TLBI_RVALE1OS: arm64_sys_op = 91;
pub const arm64_sys_op_ARM64_TLBI_RVALE1OSNXS: arm64_sys_op = 92;
pub const arm64_sys_op_ARM64_TLBI_RVALE2: arm64_sys_op = 93;
pub const arm64_sys_op_ARM64_TLBI_RVALE2IS: arm64_sys_op = 94;
pub const arm64_sys_op_ARM64_TLBI_RVALE2ISNXS: arm64_sys_op = 95;
pub const arm64_sys_op_ARM64_TLBI_RVALE2NXS: arm64_sys_op = 96;
pub const arm64_sys_op_ARM64_TLBI_RVALE2OS: arm64_sys_op = 97;
pub const arm64_sys_op_ARM64_TLBI_RVALE2OSNXS: arm64_sys_op = 98;
pub const arm64_sys_op_ARM64_TLBI_RVALE3: arm64_sys_op = 99;
pub const arm64_sys_op_ARM64_TLBI_RVALE3IS: arm64_sys_op = 100;
pub const arm64_sys_op_ARM64_TLBI_RVALE3ISNXS: arm64_sys_op = 101;
pub const arm64_sys_op_ARM64_TLBI_RVALE3NXS: arm64_sys_op = 102;
pub const arm64_sys_op_ARM64_TLBI_RVALE3OS: arm64_sys_op = 103;
pub const arm64_sys_op_ARM64_TLBI_RVALE3OSNXS: arm64_sys_op = 104;
pub const arm64_sys_op_ARM64_TLBI_VAAE1: arm64_sys_op = 105;
pub const arm64_sys_op_ARM64_TLBI_VAAE1IS: arm64_sys_op = 106;
pub const arm64_sys_op_ARM64_TLBI_VAAE1ISNXS: arm64_sys_op = 107;
pub const arm64_sys_op_ARM64_TLBI_VAAE1NXS: arm64_sys_op = 108;
pub const arm64_sys_op_ARM64_TLBI_VAAE1OS: arm64_sys_op = 109;
pub const arm64_sys_op_ARM64_TLBI_VAAE1OSNXS: arm64_sys_op = 110;
pub const arm64_sys_op_ARM64_TLBI_VAALE1: arm64_sys_op = 111;
pub const arm64_sys_op_ARM64_TLBI_VAALE1IS: arm64_sys_op = 112;
pub const arm64_sys_op_ARM64_TLBI_VAALE1ISNXS: arm64_sys_op = 113;
pub const arm64_sys_op_ARM64_TLBI_VAALE1NXS: arm64_sys_op = 114;
pub const arm64_sys_op_ARM64_TLBI_VAALE1OS: arm64_sys_op = 115;
pub const arm64_sys_op_ARM64_TLBI_VAALE1OSNXS: arm64_sys_op = 116;
pub const arm64_sys_op_ARM64_TLBI_VAE1: arm64_sys_op = 117;
pub const arm64_sys_op_ARM64_TLBI_VAE1IS: arm64_sys_op = 118;
pub const arm64_sys_op_ARM64_TLBI_VAE1ISNXS: arm64_sys_op = 119;
pub const arm64_sys_op_ARM64_TLBI_VAE1NXS: arm64_sys_op = 120;
pub const arm64_sys_op_ARM64_TLBI_VAE1OS: arm64_sys_op = 121;
pub const arm64_sys_op_ARM64_TLBI_VAE1OSNXS: arm64_sys_op = 122;
pub const arm64_sys_op_ARM64_TLBI_VAE2: arm64_sys_op = 123;
pub const arm64_sys_op_ARM64_TLBI_VAE2IS: arm64_sys_op = 124;
pub const arm64_sys_op_ARM64_TLBI_VAE2ISNXS: arm64_sys_op = 125;
pub const arm64_sys_op_ARM64_TLBI_VAE2NXS: arm64_sys_op = 126;
pub const arm64_sys_op_ARM64_TLBI_VAE2OS: arm64_sys_op = 127;
pub const arm64_sys_op_ARM64_TLBI_VAE2OSNXS: arm64_sys_op = 128;
pub const arm64_sys_op_ARM64_TLBI_VAE3: arm64_sys_op = 129;
pub const arm64_sys_op_ARM64_TLBI_VAE3IS: arm64_sys_op = 130;
pub const arm64_sys_op_ARM64_TLBI_VAE3ISNXS: arm64_sys_op = 131;
pub const arm64_sys_op_ARM64_TLBI_VAE3NXS: arm64_sys_op = 132;
pub const arm64_sys_op_ARM64_TLBI_VAE3OS: arm64_sys_op = 133;
pub const arm64_sys_op_ARM64_TLBI_VAE3OSNXS: arm64_sys_op = 134;
pub const arm64_sys_op_ARM64_TLBI_VALE1: arm64_sys_op = 135;
pub const arm64_sys_op_ARM64_TLBI_VALE1IS: arm64_sys_op = 136;
pub const arm64_sys_op_ARM64_TLBI_VALE1ISNXS: arm64_sys_op = 137;
pub const arm64_sys_op_ARM64_TLBI_VALE1NXS: arm64_sys_op = 138;
pub const arm64_sys_op_ARM64_TLBI_VALE1OS: arm64_sys_op = 139;
pub const arm64_sys_op_ARM64_TLBI_VALE1OSNXS: arm64_sys_op = 140;
pub const arm64_sys_op_ARM64_TLBI_VALE2: arm64_sys_op = 141;
pub const arm64_sys_op_ARM64_TLBI_VALE2IS: arm64_sys_op = 142;
pub const arm64_sys_op_ARM64_TLBI_VALE2ISNXS: arm64_sys_op = 143;
pub const arm64_sys_op_ARM64_TLBI_VALE2NXS: arm64_sys_op = 144;
pub const arm64_sys_op_ARM64_TLBI_VALE2OS: arm64_sys_op = 145;
pub const arm64_sys_op_ARM64_TLBI_VALE2OSNXS: arm64_sys_op = 146;
pub const arm64_sys_op_ARM64_TLBI_VALE3: arm64_sys_op = 147;
pub const arm64_sys_op_ARM64_TLBI_VALE3IS: arm64_sys_op = 148;
pub const arm64_sys_op_ARM64_TLBI_VALE3ISNXS: arm64_sys_op = 149;
pub const arm64_sys_op_ARM64_TLBI_VALE3NXS: arm64_sys_op = 150;
pub const arm64_sys_op_ARM64_TLBI_VALE3OS: arm64_sys_op = 151;
pub const arm64_sys_op_ARM64_TLBI_VALE3OSNXS: arm64_sys_op = 152;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1: arm64_sys_op = 153;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1IS: arm64_sys_op = 154;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1ISNXS: arm64_sys_op = 155;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1NXS: arm64_sys_op = 156;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1OS: arm64_sys_op = 157;
pub const arm64_sys_op_ARM64_TLBI_VMALLE1OSNXS: arm64_sys_op = 158;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1: arm64_sys_op = 159;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1IS: arm64_sys_op = 160;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1ISNXS: arm64_sys_op = 161;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1NXS: arm64_sys_op = 162;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1OS: arm64_sys_op = 163;
pub const arm64_sys_op_ARM64_TLBI_VMALLS12E1OSNXS: arm64_sys_op = 164;
pub const arm64_sys_op_ARM64_AT_S1E1R: arm64_sys_op = 165;
pub const arm64_sys_op_ARM64_AT_S1E2R: arm64_sys_op = 166;
pub const arm64_sys_op_ARM64_AT_S1E3R: arm64_sys_op = 167;
pub const arm64_sys_op_ARM64_AT_S1E1W: arm64_sys_op = 168;
pub const arm64_sys_op_ARM64_AT_S1E2W: arm64_sys_op = 169;
pub const arm64_sys_op_ARM64_AT_S1E3W: arm64_sys_op = 170;
pub const arm64_sys_op_ARM64_AT_S1E0R: arm64_sys_op = 171;
pub const arm64_sys_op_ARM64_AT_S1E0W: arm64_sys_op = 172;
pub const arm64_sys_op_ARM64_AT_S12E1R: arm64_sys_op = 173;
pub const arm64_sys_op_ARM64_AT_S12E1W: arm64_sys_op = 174;
pub const arm64_sys_op_ARM64_AT_S12E0R: arm64_sys_op = 175;
pub const arm64_sys_op_ARM64_AT_S12E0W: arm64_sys_op = 176;
pub const arm64_sys_op_ARM64_AT_S1E1RP: arm64_sys_op = 177;
pub const arm64_sys_op_ARM64_AT_S1E1WP: arm64_sys_op = 178;
pub const arm64_sys_op_ARM64_DC_CGDSW: arm64_sys_op = 179;
pub const arm64_sys_op_ARM64_DC_CGDVAC: arm64_sys_op = 180;
pub const arm64_sys_op_ARM64_DC_CGDVADP: arm64_sys_op = 181;
pub const arm64_sys_op_ARM64_DC_CGDVAP: arm64_sys_op = 182;
pub const arm64_sys_op_ARM64_DC_CGSW: arm64_sys_op = 183;
pub const arm64_sys_op_ARM64_DC_CGVAC: arm64_sys_op = 184;
pub const arm64_sys_op_ARM64_DC_CGVADP: arm64_sys_op = 185;
pub const arm64_sys_op_ARM64_DC_CGVAP: arm64_sys_op = 186;
pub const arm64_sys_op_ARM64_DC_CIGDSW: arm64_sys_op = 187;
pub const arm64_sys_op_ARM64_DC_CIGDVAC: arm64_sys_op = 188;
pub const arm64_sys_op_ARM64_DC_CIGSW: arm64_sys_op = 189;
pub const arm64_sys_op_ARM64_DC_CIGVAC: arm64_sys_op = 190;
pub const arm64_sys_op_ARM64_DC_CISW: arm64_sys_op = 191;
pub const arm64_sys_op_ARM64_DC_CIVAC: arm64_sys_op = 192;
pub const arm64_sys_op_ARM64_DC_CSW: arm64_sys_op = 193;
pub const arm64_sys_op_ARM64_DC_CVAC: arm64_sys_op = 194;
pub const arm64_sys_op_ARM64_DC_CVADP: arm64_sys_op = 195;
pub const arm64_sys_op_ARM64_DC_CVAP: arm64_sys_op = 196;
pub const arm64_sys_op_ARM64_DC_CVAU: arm64_sys_op = 197;
pub const arm64_sys_op_ARM64_DC_GVA: arm64_sys_op = 198;
pub const arm64_sys_op_ARM64_DC_GZVA: arm64_sys_op = 199;
pub const arm64_sys_op_ARM64_DC_IGDSW: arm64_sys_op = 200;
pub const arm64_sys_op_ARM64_DC_IGDVAC: arm64_sys_op = 201;
pub const arm64_sys_op_ARM64_DC_IGSW: arm64_sys_op = 202;
pub const arm64_sys_op_ARM64_DC_IGVAC: arm64_sys_op = 203;
pub const arm64_sys_op_ARM64_DC_ISW: arm64_sys_op = 204;
pub const arm64_sys_op_ARM64_DC_IVAC: arm64_sys_op = 205;
pub const arm64_sys_op_ARM64_DC_ZVA: arm64_sys_op = 206;
pub const arm64_sys_op_ARM64_IC_IALLUIS: arm64_sys_op = 207;
pub const arm64_sys_op_ARM64_IC_IALLU: arm64_sys_op = 208;
pub const arm64_sys_op_ARM64_IC_IVAU: arm64_sys_op = 209;
pub type arm64_sys_op = cty::c_uint;
pub const arm64_svcr_op_ARM64_SVCR_INVALID: arm64_svcr_op = 0;
pub const arm64_svcr_op_ARM64_SVCR_SVCRSM: arm64_svcr_op = 1;
pub const arm64_svcr_op_ARM64_SVCR_SVCRSMZA: arm64_svcr_op = 3;
pub const arm64_svcr_op_ARM64_SVCR_SVCRZA: arm64_svcr_op = 2;
pub type arm64_svcr_op = cty::c_uint;
pub const arm64_prefetch_op_ARM64_PRFM_INVALID: arm64_prefetch_op = 0;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL1KEEP: arm64_prefetch_op = 1;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL1STRM: arm64_prefetch_op = 2;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL2KEEP: arm64_prefetch_op = 3;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL2STRM: arm64_prefetch_op = 4;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL3KEEP: arm64_prefetch_op = 5;
pub const arm64_prefetch_op_ARM64_PRFM_PLDL3STRM: arm64_prefetch_op = 6;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL1KEEP: arm64_prefetch_op = 9;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL1STRM: arm64_prefetch_op = 10;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL2KEEP: arm64_prefetch_op = 11;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL2STRM: arm64_prefetch_op = 12;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL3KEEP: arm64_prefetch_op = 13;
pub const arm64_prefetch_op_ARM64_PRFM_PLIL3STRM: arm64_prefetch_op = 14;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL1KEEP: arm64_prefetch_op = 17;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL1STRM: arm64_prefetch_op = 18;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL2KEEP: arm64_prefetch_op = 19;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL2STRM: arm64_prefetch_op = 20;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL3KEEP: arm64_prefetch_op = 21;
pub const arm64_prefetch_op_ARM64_PRFM_PSTL3STRM: arm64_prefetch_op = 22;
pub type arm64_prefetch_op = cty::c_uint;
pub const arm64_reg_ARM64_REG_INVALID: arm64_reg = 0;
pub const arm64_reg_ARM64_REG_FFR: arm64_reg = 1;
pub const arm64_reg_ARM64_REG_FP: arm64_reg = 2;
pub const arm64_reg_ARM64_REG_LR: arm64_reg = 3;
pub const arm64_reg_ARM64_REG_NZCV: arm64_reg = 4;
pub const arm64_reg_ARM64_REG_SP: arm64_reg = 5;
pub const arm64_reg_ARM64_REG_VG: arm64_reg = 6;
pub const arm64_reg_ARM64_REG_WSP: arm64_reg = 7;
pub const arm64_reg_ARM64_REG_WZR: arm64_reg = 8;
pub const arm64_reg_ARM64_REG_XZR: arm64_reg = 9;
pub const arm64_reg_ARM64_REG_ZA: arm64_reg = 10;
pub const arm64_reg_ARM64_REG_B0: arm64_reg = 11;
pub const arm64_reg_ARM64_REG_B1: arm64_reg = 12;
pub const arm64_reg_ARM64_REG_B2: arm64_reg = 13;
pub const arm64_reg_ARM64_REG_B3: arm64_reg = 14;
pub const arm64_reg_ARM64_REG_B4: arm64_reg = 15;
pub const arm64_reg_ARM64_REG_B5: arm64_reg = 16;
pub const arm64_reg_ARM64_REG_B6: arm64_reg = 17;
pub const arm64_reg_ARM64_REG_B7: arm64_reg = 18;
pub const arm64_reg_ARM64_REG_B8: arm64_reg = 19;
pub const arm64_reg_ARM64_REG_B9: arm64_reg = 20;
pub const arm64_reg_ARM64_REG_B10: arm64_reg = 21;
pub const arm64_reg_ARM64_REG_B11: arm64_reg = 22;
pub const arm64_reg_ARM64_REG_B12: arm64_reg = 23;
pub const arm64_reg_ARM64_REG_B13: arm64_reg = 24;
pub const arm64_reg_ARM64_REG_B14: arm64_reg = 25;
pub const arm64_reg_ARM64_REG_B15: arm64_reg = 26;
pub const arm64_reg_ARM64_REG_B16: arm64_reg = 27;
pub const arm64_reg_ARM64_REG_B17: arm64_reg = 28;
pub const arm64_reg_ARM64_REG_B18: arm64_reg = 29;
pub const arm64_reg_ARM64_REG_B19: arm64_reg = 30;
pub const arm64_reg_ARM64_REG_B20: arm64_reg = 31;
pub const arm64_reg_ARM64_REG_B21: arm64_reg = 32;
pub const arm64_reg_ARM64_REG_B22: arm64_reg = 33;
pub const arm64_reg_ARM64_REG_B23: arm64_reg = 34;
pub const arm64_reg_ARM64_REG_B24: arm64_reg = 35;
pub const arm64_reg_ARM64_REG_B25: arm64_reg = 36;
pub const arm64_reg_ARM64_REG_B26: arm64_reg = 37;
pub const arm64_reg_ARM64_REG_B27: arm64_reg = 38;
pub const arm64_reg_ARM64_REG_B28: arm64_reg = 39;
pub const arm64_reg_ARM64_REG_B29: arm64_reg = 40;
pub const arm64_reg_ARM64_REG_B30: arm64_reg = 41;
pub const arm64_reg_ARM64_REG_B31: arm64_reg = 42;
pub const arm64_reg_ARM64_REG_D0: arm64_reg = 43;
pub const arm64_reg_ARM64_REG_D1: arm64_reg = 44;
pub const arm64_reg_ARM64_REG_D2: arm64_reg = 45;
pub const arm64_reg_ARM64_REG_D3: arm64_reg = 46;
pub const arm64_reg_ARM64_REG_D4: arm64_reg = 47;
pub const arm64_reg_ARM64_REG_D5: arm64_reg = 48;
pub const arm64_reg_ARM64_REG_D6: arm64_reg = 49;
pub const arm64_reg_ARM64_REG_D7: arm64_reg = 50;
pub const arm64_reg_ARM64_REG_D8: arm64_reg = 51;
pub const arm64_reg_ARM64_REG_D9: arm64_reg = 52;
pub const arm64_reg_ARM64_REG_D10: arm64_reg = 53;
pub const arm64_reg_ARM64_REG_D11: arm64_reg = 54;
pub const arm64_reg_ARM64_REG_D12: arm64_reg = 55;
pub const arm64_reg_ARM64_REG_D13: arm64_reg = 56;
pub const arm64_reg_ARM64_REG_D14: arm64_reg = 57;
pub const arm64_reg_ARM64_REG_D15: arm64_reg = 58;
pub const arm64_reg_ARM64_REG_D16: arm64_reg = 59;
pub const arm64_reg_ARM64_REG_D17: arm64_reg = 60;
pub const arm64_reg_ARM64_REG_D18: arm64_reg = 61;
pub const arm64_reg_ARM64_REG_D19: arm64_reg = 62;
pub const arm64_reg_ARM64_REG_D20: arm64_reg = 63;
pub const arm64_reg_ARM64_REG_D21: arm64_reg = 64;
pub const arm64_reg_ARM64_REG_D22: arm64_reg = 65;
pub const arm64_reg_ARM64_REG_D23: arm64_reg = 66;
pub const arm64_reg_ARM64_REG_D24: arm64_reg = 67;
pub const arm64_reg_ARM64_REG_D25: arm64_reg = 68;
pub const arm64_reg_ARM64_REG_D26: arm64_reg = 69;
pub const arm64_reg_ARM64_REG_D27: arm64_reg = 70;
pub const arm64_reg_ARM64_REG_D28: arm64_reg = 71;
pub const arm64_reg_ARM64_REG_D29: arm64_reg = 72;
pub const arm64_reg_ARM64_REG_D30: arm64_reg = 73;
pub const arm64_reg_ARM64_REG_D31: arm64_reg = 74;
pub const arm64_reg_ARM64_REG_H0: arm64_reg = 75;
pub const arm64_reg_ARM64_REG_H1: arm64_reg = 76;
pub const arm64_reg_ARM64_REG_H2: arm64_reg = 77;
pub const arm64_reg_ARM64_REG_H3: arm64_reg = 78;
pub const arm64_reg_ARM64_REG_H4: arm64_reg = 79;
pub const arm64_reg_ARM64_REG_H5: arm64_reg = 80;
pub const arm64_reg_ARM64_REG_H6: arm64_reg = 81;
pub const arm64_reg_ARM64_REG_H7: arm64_reg = 82;
pub const arm64_reg_ARM64_REG_H8: arm64_reg = 83;
pub const arm64_reg_ARM64_REG_H9: arm64_reg = 84;
pub const arm64_reg_ARM64_REG_H10: arm64_reg = 85;
pub const arm64_reg_ARM64_REG_H11: arm64_reg = 86;
pub const arm64_reg_ARM64_REG_H12: arm64_reg = 87;
pub const arm64_reg_ARM64_REG_H13: arm64_reg = 88;
pub const arm64_reg_ARM64_REG_H14: arm64_reg = 89;
pub const arm64_reg_ARM64_REG_H15: arm64_reg = 90;
pub const arm64_reg_ARM64_REG_H16: arm64_reg = 91;
pub const arm64_reg_ARM64_REG_H17: arm64_reg = 92;
pub const arm64_reg_ARM64_REG_H18: arm64_reg = 93;
pub const arm64_reg_ARM64_REG_H19: arm64_reg = 94;
pub const arm64_reg_ARM64_REG_H20: arm64_reg = 95;
pub const arm64_reg_ARM64_REG_H21: arm64_reg = 96;
pub const arm64_reg_ARM64_REG_H22: arm64_reg = 97;
pub const arm64_reg_ARM64_REG_H23: arm64_reg = 98;
pub const arm64_reg_ARM64_REG_H24: arm64_reg = 99;
pub const arm64_reg_ARM64_REG_H25: arm64_reg = 100;
pub const arm64_reg_ARM64_REG_H26: arm64_reg = 101;
pub const arm64_reg_ARM64_REG_H27: arm64_reg = 102;
pub const arm64_reg_ARM64_REG_H28: arm64_reg = 103;
pub const arm64_reg_ARM64_REG_H29: arm64_reg = 104;
pub const arm64_reg_ARM64_REG_H30: arm64_reg = 105;
pub const arm64_reg_ARM64_REG_H31: arm64_reg = 106;
pub const arm64_reg_ARM64_REG_P0: arm64_reg = 107;
pub const arm64_reg_ARM64_REG_P1: arm64_reg = 108;
pub const arm64_reg_ARM64_REG_P2: arm64_reg = 109;
pub const arm64_reg_ARM64_REG_P3: arm64_reg = 110;
pub const arm64_reg_ARM64_REG_P4: arm64_reg = 111;
pub const arm64_reg_ARM64_REG_P5: arm64_reg = 112;
pub const arm64_reg_ARM64_REG_P6: arm64_reg = 113;
pub const arm64_reg_ARM64_REG_P7: arm64_reg = 114;
pub const arm64_reg_ARM64_REG_P8: arm64_reg = 115;
pub const arm64_reg_ARM64_REG_P9: arm64_reg = 116;
pub const arm64_reg_ARM64_REG_P10: arm64_reg = 117;
pub const arm64_reg_ARM64_REG_P11: arm64_reg = 118;
pub const arm64_reg_ARM64_REG_P12: arm64_reg = 119;
pub const arm64_reg_ARM64_REG_P13: arm64_reg = 120;
pub const arm64_reg_ARM64_REG_P14: arm64_reg = 121;
pub const arm64_reg_ARM64_REG_P15: arm64_reg = 122;
pub const arm64_reg_ARM64_REG_Q0: arm64_reg = 123;
pub const arm64_reg_ARM64_REG_Q1: arm64_reg = 124;
pub const arm64_reg_ARM64_REG_Q2: arm64_reg = 125;
pub const arm64_reg_ARM64_REG_Q3: arm64_reg = 126;
pub const arm64_reg_ARM64_REG_Q4: arm64_reg = 127;
pub const arm64_reg_ARM64_REG_Q5: arm64_reg = 128;
pub const arm64_reg_ARM64_REG_Q6: arm64_reg = 129;
pub const arm64_reg_ARM64_REG_Q7: arm64_reg = 130;
pub const arm64_reg_ARM64_REG_Q8: arm64_reg = 131;
pub const arm64_reg_ARM64_REG_Q9: arm64_reg = 132;
pub const arm64_reg_ARM64_REG_Q10: arm64_reg = 133;
pub const arm64_reg_ARM64_REG_Q11: arm64_reg = 134;
pub const arm64_reg_ARM64_REG_Q12: arm64_reg = 135;
pub const arm64_reg_ARM64_REG_Q13: arm64_reg = 136;
pub const arm64_reg_ARM64_REG_Q14: arm64_reg = 137;
pub const arm64_reg_ARM64_REG_Q15: arm64_reg = 138;
pub const arm64_reg_ARM64_REG_Q16: arm64_reg = 139;
pub const arm64_reg_ARM64_REG_Q17: arm64_reg = 140;
pub const arm64_reg_ARM64_REG_Q18: arm64_reg = 141;
pub const arm64_reg_ARM64_REG_Q19: arm64_reg = 142;
pub const arm64_reg_ARM64_REG_Q20: arm64_reg = 143;
pub const arm64_reg_ARM64_REG_Q21: arm64_reg = 144;
pub const arm64_reg_ARM64_REG_Q22: arm64_reg = 145;
pub const arm64_reg_ARM64_REG_Q23: arm64_reg = 146;
pub const arm64_reg_ARM64_REG_Q24: arm64_reg = 147;
pub const arm64_reg_ARM64_REG_Q25: arm64_reg = 148;
pub const arm64_reg_ARM64_REG_Q26: arm64_reg = 149;
pub const arm64_reg_ARM64_REG_Q27: arm64_reg = 150;
pub const arm64_reg_ARM64_REG_Q28: arm64_reg = 151;
pub const arm64_reg_ARM64_REG_Q29: arm64_reg = 152;
pub const arm64_reg_ARM64_REG_Q30: arm64_reg = 153;
pub const arm64_reg_ARM64_REG_Q31: arm64_reg = 154;
pub const arm64_reg_ARM64_REG_S0: arm64_reg = 155;
pub const arm64_reg_ARM64_REG_S1: arm64_reg = 156;
pub const arm64_reg_ARM64_REG_S2: arm64_reg = 157;
pub const arm64_reg_ARM64_REG_S3: arm64_reg = 158;
pub const arm64_reg_ARM64_REG_S4: arm64_reg = 159;
pub const arm64_reg_ARM64_REG_S5: arm64_reg = 160;
pub const arm64_reg_ARM64_REG_S6: arm64_reg = 161;
pub const arm64_reg_ARM64_REG_S7: arm64_reg = 162;
pub const arm64_reg_ARM64_REG_S8: arm64_reg = 163;
pub const arm64_reg_ARM64_REG_S9: arm64_reg = 164;
pub const arm64_reg_ARM64_REG_S10: arm64_reg = 165;
pub const arm64_reg_ARM64_REG_S11: arm64_reg = 166;
pub const arm64_reg_ARM64_REG_S12: arm64_reg = 167;
pub const arm64_reg_ARM64_REG_S13: arm64_reg = 168;
pub const arm64_reg_ARM64_REG_S14: arm64_reg = 169;
pub const arm64_reg_ARM64_REG_S15: arm64_reg = 170;
pub const arm64_reg_ARM64_REG_S16: arm64_reg = 171;
pub const arm64_reg_ARM64_REG_S17: arm64_reg = 172;
pub const arm64_reg_ARM64_REG_S18: arm64_reg = 173;
pub const arm64_reg_ARM64_REG_S19: arm64_reg = 174;
pub const arm64_reg_ARM64_REG_S20: arm64_reg = 175;
pub const arm64_reg_ARM64_REG_S21: arm64_reg = 176;
pub const arm64_reg_ARM64_REG_S22: arm64_reg = 177;
pub const arm64_reg_ARM64_REG_S23: arm64_reg = 178;
pub const arm64_reg_ARM64_REG_S24: arm64_reg = 179;
pub const arm64_reg_ARM64_REG_S25: arm64_reg = 180;
pub const arm64_reg_ARM64_REG_S26: arm64_reg = 181;
pub const arm64_reg_ARM64_REG_S27: arm64_reg = 182;
pub const arm64_reg_ARM64_REG_S28: arm64_reg = 183;
pub const arm64_reg_ARM64_REG_S29: arm64_reg = 184;
pub const arm64_reg_ARM64_REG_S30: arm64_reg = 185;
pub const arm64_reg_ARM64_REG_S31: arm64_reg = 186;
pub const arm64_reg_ARM64_REG_W0: arm64_reg = 187;
pub const arm64_reg_ARM64_REG_W1: arm64_reg = 188;
pub const arm64_reg_ARM64_REG_W2: arm64_reg = 189;
pub const arm64_reg_ARM64_REG_W3: arm64_reg = 190;
pub const arm64_reg_ARM64_REG_W4: arm64_reg = 191;
pub const arm64_reg_ARM64_REG_W5: arm64_reg = 192;
pub const arm64_reg_ARM64_REG_W6: arm64_reg = 193;
pub const arm64_reg_ARM64_REG_W7: arm64_reg = 194;
pub const arm64_reg_ARM64_REG_W8: arm64_reg = 195;
pub const arm64_reg_ARM64_REG_W9: arm64_reg = 196;
pub const arm64_reg_ARM64_REG_W10: arm64_reg = 197;
pub const arm64_reg_ARM64_REG_W11: arm64_reg = 198;
pub const arm64_reg_ARM64_REG_W12: arm64_reg = 199;
pub const arm64_reg_ARM64_REG_W13: arm64_reg = 200;
pub const arm64_reg_ARM64_REG_W14: arm64_reg = 201;
pub const arm64_reg_ARM64_REG_W15: arm64_reg = 202;
pub const arm64_reg_ARM64_REG_W16: arm64_reg = 203;
pub const arm64_reg_ARM64_REG_W17: arm64_reg = 204;
pub const arm64_reg_ARM64_REG_W18: arm64_reg = 205;
pub const arm64_reg_ARM64_REG_W19: arm64_reg = 206;
pub const arm64_reg_ARM64_REG_W20: arm64_reg = 207;
pub const arm64_reg_ARM64_REG_W21: arm64_reg = 208;
pub const arm64_reg_ARM64_REG_W22: arm64_reg = 209;
pub const arm64_reg_ARM64_REG_W23: arm64_reg = 210;
pub const arm64_reg_ARM64_REG_W24: arm64_reg = 211;
pub const arm64_reg_ARM64_REG_W25: arm64_reg = 212;
pub const arm64_reg_ARM64_REG_W26: arm64_reg = 213;
pub const arm64_reg_ARM64_REG_W27: arm64_reg = 214;
pub const arm64_reg_ARM64_REG_W28: arm64_reg = 215;
pub const arm64_reg_ARM64_REG_W29: arm64_reg = 216;
pub const arm64_reg_ARM64_REG_W30: arm64_reg = 217;
pub const arm64_reg_ARM64_REG_X0: arm64_reg = 218;
pub const arm64_reg_ARM64_REG_X1: arm64_reg = 219;
pub const arm64_reg_ARM64_REG_X2: arm64_reg = 220;
pub const arm64_reg_ARM64_REG_X3: arm64_reg = 221;
pub const arm64_reg_ARM64_REG_X4: arm64_reg = 222;
pub const arm64_reg_ARM64_REG_X5: arm64_reg = 223;
pub const arm64_reg_ARM64_REG_X6: arm64_reg = 224;
pub const arm64_reg_ARM64_REG_X7: arm64_reg = 225;
pub const arm64_reg_ARM64_REG_X8: arm64_reg = 226;
pub const arm64_reg_ARM64_REG_X9: arm64_reg = 227;
pub const arm64_reg_ARM64_REG_X10: arm64_reg = 228;
pub const arm64_reg_ARM64_REG_X11: arm64_reg = 229;
pub const arm64_reg_ARM64_REG_X12: arm64_reg = 230;
pub const arm64_reg_ARM64_REG_X13: arm64_reg = 231;
pub const arm64_reg_ARM64_REG_X14: arm64_reg = 232;
pub const arm64_reg_ARM64_REG_X15: arm64_reg = 233;
pub const arm64_reg_ARM64_REG_X16: arm64_reg = 234;
pub const arm64_reg_ARM64_REG_X17: arm64_reg = 235;
pub const arm64_reg_ARM64_REG_X18: arm64_reg = 236;
pub const arm64_reg_ARM64_REG_X19: arm64_reg = 237;
pub const arm64_reg_ARM64_REG_X20: arm64_reg = 238;
pub const arm64_reg_ARM64_REG_X21: arm64_reg = 239;
pub const arm64_reg_ARM64_REG_X22: arm64_reg = 240;
pub const arm64_reg_ARM64_REG_X23: arm64_reg = 241;
pub const arm64_reg_ARM64_REG_X24: arm64_reg = 242;
pub const arm64_reg_ARM64_REG_X25: arm64_reg = 243;
pub const arm64_reg_ARM64_REG_X26: arm64_reg = 244;
pub const arm64_reg_ARM64_REG_X27: arm64_reg = 245;
pub const arm64_reg_ARM64_REG_X28: arm64_reg = 246;
pub const arm64_reg_ARM64_REG_Z0: arm64_reg = 247;
pub const arm64_reg_ARM64_REG_Z1: arm64_reg = 248;
pub const arm64_reg_ARM64_REG_Z2: arm64_reg = 249;
pub const arm64_reg_ARM64_REG_Z3: arm64_reg = 250;
pub const arm64_reg_ARM64_REG_Z4: arm64_reg = 251;
pub const arm64_reg_ARM64_REG_Z5: arm64_reg = 252;
pub const arm64_reg_ARM64_REG_Z6: arm64_reg = 253;
pub const arm64_reg_ARM64_REG_Z7: arm64_reg = 254;
pub const arm64_reg_ARM64_REG_Z8: arm64_reg = 255;
pub const arm64_reg_ARM64_REG_Z9: arm64_reg = 256;
pub const arm64_reg_ARM64_REG_Z10: arm64_reg = 257;
pub const arm64_reg_ARM64_REG_Z11: arm64_reg = 258;
pub const arm64_reg_ARM64_REG_Z12: arm64_reg = 259;
pub const arm64_reg_ARM64_REG_Z13: arm64_reg = 260;
pub const arm64_reg_ARM64_REG_Z14: arm64_reg = 261;
pub const arm64_reg_ARM64_REG_Z15: arm64_reg = 262;
pub const arm64_reg_ARM64_REG_Z16: arm64_reg = 263;
pub const arm64_reg_ARM64_REG_Z17: arm64_reg = 264;
pub const arm64_reg_ARM64_REG_Z18: arm64_reg = 265;
pub const arm64_reg_ARM64_REG_Z19: arm64_reg = 266;
pub const arm64_reg_ARM64_REG_Z20: arm64_reg = 267;
pub const arm64_reg_ARM64_REG_Z21: arm64_reg = 268;
pub const arm64_reg_ARM64_REG_Z22: arm64_reg = 269;
pub const arm64_reg_ARM64_REG_Z23: arm64_reg = 270;
pub const arm64_reg_ARM64_REG_Z24: arm64_reg = 271;
pub const arm64_reg_ARM64_REG_Z25: arm64_reg = 272;
pub const arm64_reg_ARM64_REG_Z26: arm64_reg = 273;
pub const arm64_reg_ARM64_REG_Z27: arm64_reg = 274;
pub const arm64_reg_ARM64_REG_Z28: arm64_reg = 275;
pub const arm64_reg_ARM64_REG_Z29: arm64_reg = 276;
pub const arm64_reg_ARM64_REG_Z30: arm64_reg = 277;
pub const arm64_reg_ARM64_REG_Z31: arm64_reg = 278;
pub const arm64_reg_ARM64_REG_ZAB0: arm64_reg = 279;
pub const arm64_reg_ARM64_REG_ZAD0: arm64_reg = 280;
pub const arm64_reg_ARM64_REG_ZAD1: arm64_reg = 281;
pub const arm64_reg_ARM64_REG_ZAD2: arm64_reg = 282;
pub const arm64_reg_ARM64_REG_ZAD3: arm64_reg = 283;
pub const arm64_reg_ARM64_REG_ZAD4: arm64_reg = 284;
pub const arm64_reg_ARM64_REG_ZAD5: arm64_reg = 285;
pub const arm64_reg_ARM64_REG_ZAD6: arm64_reg = 286;
pub const arm64_reg_ARM64_REG_ZAD7: arm64_reg = 287;
pub const arm64_reg_ARM64_REG_ZAH0: arm64_reg = 288;
pub const arm64_reg_ARM64_REG_ZAH1: arm64_reg = 289;
pub const arm64_reg_ARM64_REG_ZAQ0: arm64_reg = 290;
pub const arm64_reg_ARM64_REG_ZAQ1: arm64_reg = 291;
pub const arm64_reg_ARM64_REG_ZAQ2: arm64_reg = 292;
pub const arm64_reg_ARM64_REG_ZAQ3: arm64_reg = 293;
pub const arm64_reg_ARM64_REG_ZAQ4: arm64_reg = 294;
pub const arm64_reg_ARM64_REG_ZAQ5: arm64_reg = 295;
pub const arm64_reg_ARM64_REG_ZAQ6: arm64_reg = 296;
pub const arm64_reg_ARM64_REG_ZAQ7: arm64_reg = 297;
pub const arm64_reg_ARM64_REG_ZAQ8: arm64_reg = 298;
pub const arm64_reg_ARM64_REG_ZAQ9: arm64_reg = 299;
pub const arm64_reg_ARM64_REG_ZAQ10: arm64_reg = 300;
pub const arm64_reg_ARM64_REG_ZAQ11: arm64_reg = 301;
pub const arm64_reg_ARM64_REG_ZAQ12: arm64_reg = 302;
pub const arm64_reg_ARM64_REG_ZAQ13: arm64_reg = 303;
pub const arm64_reg_ARM64_REG_ZAQ14: arm64_reg = 304;
pub const arm64_reg_ARM64_REG_ZAQ15: arm64_reg = 305;
pub const arm64_reg_ARM64_REG_ZAS0: arm64_reg = 306;
pub const arm64_reg_ARM64_REG_ZAS1: arm64_reg = 307;
pub const arm64_reg_ARM64_REG_ZAS2: arm64_reg = 308;
pub const arm64_reg_ARM64_REG_ZAS3: arm64_reg = 309;
pub const arm64_reg_ARM64_REG_V0: arm64_reg = 310;
pub const arm64_reg_ARM64_REG_V1: arm64_reg = 311;
pub const arm64_reg_ARM64_REG_V2: arm64_reg = 312;
pub const arm64_reg_ARM64_REG_V3: arm64_reg = 313;
pub const arm64_reg_ARM64_REG_V4: arm64_reg = 314;
pub const arm64_reg_ARM64_REG_V5: arm64_reg = 315;
pub const arm64_reg_ARM64_REG_V6: arm64_reg = 316;
pub const arm64_reg_ARM64_REG_V7: arm64_reg = 317;
pub const arm64_reg_ARM64_REG_V8: arm64_reg = 318;
pub const arm64_reg_ARM64_REG_V9: arm64_reg = 319;
pub const arm64_reg_ARM64_REG_V10: arm64_reg = 320;
pub const arm64_reg_ARM64_REG_V11: arm64_reg = 321;
pub const arm64_reg_ARM64_REG_V12: arm64_reg = 322;
pub const arm64_reg_ARM64_REG_V13: arm64_reg = 323;
pub const arm64_reg_ARM64_REG_V14: arm64_reg = 324;
pub const arm64_reg_ARM64_REG_V15: arm64_reg = 325;
pub const arm64_reg_ARM64_REG_V16: arm64_reg = 326;
pub const arm64_reg_ARM64_REG_V17: arm64_reg = 327;
pub const arm64_reg_ARM64_REG_V18: arm64_reg = 328;
pub const arm64_reg_ARM64_REG_V19: arm64_reg = 329;
pub const arm64_reg_ARM64_REG_V20: arm64_reg = 330;
pub const arm64_reg_ARM64_REG_V21: arm64_reg = 331;
pub const arm64_reg_ARM64_REG_V22: arm64_reg = 332;
pub const arm64_reg_ARM64_REG_V23: arm64_reg = 333;
pub const arm64_reg_ARM64_REG_V24: arm64_reg = 334;
pub const arm64_reg_ARM64_REG_V25: arm64_reg = 335;
pub const arm64_reg_ARM64_REG_V26: arm64_reg = 336;
pub const arm64_reg_ARM64_REG_V27: arm64_reg = 337;
pub const arm64_reg_ARM64_REG_V28: arm64_reg = 338;
pub const arm64_reg_ARM64_REG_V29: arm64_reg = 339;
pub const arm64_reg_ARM64_REG_V30: arm64_reg = 340;
pub const arm64_reg_ARM64_REG_V31: arm64_reg = 341;
pub const arm64_reg_ARM64_REG_ENDING: arm64_reg = 342;
pub const arm64_reg_ARM64_REG_IP0: arm64_reg = 234;
pub const arm64_reg_ARM64_REG_IP1: arm64_reg = 235;
pub const arm64_reg_ARM64_REG_X29: arm64_reg = 2;
pub const arm64_reg_ARM64_REG_X30: arm64_reg = 3;
pub type arm64_reg = cty::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arm64_op_mem {
    pub base: arm64_reg,
    pub index: arm64_reg,
    pub disp: i32,
}
const _: () = {
    ["Size of arm64_op_mem"][::std::mem::size_of::<arm64_op_mem>() - 12usize];
    ["Alignment of arm64_op_mem"][::std::mem::align_of::<arm64_op_mem>() - 4usize];
    ["Offset of field: arm64_op_mem::base"][::std::mem::offset_of!(arm64_op_mem, base) - 0usize];
    ["Offset of field: arm64_op_mem::index"][::std::mem::offset_of!(arm64_op_mem, index) - 4usize];
    ["Offset of field: arm64_op_mem::disp"][::std::mem::offset_of!(arm64_op_mem, disp) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct arm64_op_sme_index {
    pub reg: arm64_reg,
    pub base: arm64_reg,
    pub disp: i32,
}
const _: () = {
    ["Size of arm64_op_sme_index"][::std::mem::size_of::<arm64_op_sme_index>() - 12usize];
    ["Alignment of arm64_op_sme_index"][::std::mem::align_of::<arm64_op_sme_index>() - 4usize];
    ["Offset of field: arm64_op_sme_index::reg"]
        [::std::mem::offset_of!(arm64_op_sme_index, reg) - 0usize];
    ["Offset of field: arm64_op_sme_index::base"]
        [::std::mem::offset_of!(arm64_op_sme_index, base) - 4usize];
    ["Offset of field: arm64_op_sme_index::disp"]
        [::std::mem::offset_of!(arm64_op_sme_index, disp) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cs_arm64_op {
    pub vector_index: cty::c_int,
    pub vas: arm64_vas,
    pub shift: cs_arm64_op__bindgen_ty_1,
    pub ext: arm64_extender,
    pub type_: arm64_op_type,
    pub svcr: arm64_svcr_op,
    pub __bindgen_anon_1: cs_arm64_op__bindgen_ty_2,
    pub access: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cs_arm64_op__bindgen_ty_1 {
    pub type_: arm64_shifter,
    pub value: cty::c_uint,
}
const _: () = {
    ["Size of cs_arm64_op__bindgen_ty_1"]
        [::std::mem::size_of::<cs_arm64_op__bindgen_ty_1>() - 8usize];
    ["Alignment of cs_arm64_op__bindgen_ty_1"]
        [::std::mem::align_of::<cs_arm64_op__bindgen_ty_1>() - 4usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_1::type_"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_1, type_) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_1::value"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_1, value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union cs_arm64_op__bindgen_ty_2 {
    pub reg: arm64_reg,
    pub imm: i64,
    pub fp: f64,
    pub mem: arm64_op_mem,
    pub pstate: arm64_pstate,
    pub sys: arm64_sys_op,
    pub prefetch: arm64_prefetch_op,
    pub barrier: arm64_barrier_op,
    pub sme_index: arm64_op_sme_index,
}
const _: () = {
    ["Size of cs_arm64_op__bindgen_ty_2"]
        [::std::mem::size_of::<cs_arm64_op__bindgen_ty_2>() - 16usize];
    ["Alignment of cs_arm64_op__bindgen_ty_2"]
        [::std::mem::align_of::<cs_arm64_op__bindgen_ty_2>() - 8usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::reg"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, reg) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::imm"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, imm) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::fp"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, fp) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::mem"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, mem) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::pstate"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, pstate) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::sys"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, sys) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::prefetch"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, prefetch) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::barrier"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, barrier) - 0usize];
    ["Offset of field: cs_arm64_op__bindgen_ty_2::sme_index"]
        [::std::mem::offset_of!(cs_arm64_op__bindgen_ty_2, sme_index) - 0usize];
};
const _: () = {
    ["Size of cs_arm64_op"][::std::mem::size_of::<cs_arm64_op>() - 56usize];
    ["Alignment of cs_arm64_op"][::std::mem::align_of::<cs_arm64_op>() - 8usize];
    ["Offset of field: cs_arm64_op::vector_index"]
        [::std::mem::offset_of!(cs_arm64_op, vector_index) - 0usize];
    ["Offset of field: cs_arm64_op::vas"][::std::mem::offset_of!(cs_arm64_op, vas) - 4usize];
    ["Offset of field: cs_arm64_op::shift"][::std::mem::offset_of!(cs_arm64_op, shift) - 8usize];
    ["Offset of field: cs_arm64_op::ext"][::std::mem::offset_of!(cs_arm64_op, ext) - 16usize];
    ["Offset of field: cs_arm64_op::type_"][::std::mem::offset_of!(cs_arm64_op, type_) - 20usize];
    ["Offset of field: cs_arm64_op::svcr"][::std::mem::offset_of!(cs_arm64_op, svcr) - 24usize];
    ["Offset of field: cs_arm64_op::access"][::std::mem::offset_of!(cs_arm64_op, access) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct cs_arm64 {
    pub cc: arm64_cc,
    pub update_flags: bool,
    pub writeback: bool,
    pub post_index: bool,
    pub op_count: u8,
    pub operands: [cs_arm64_op; 8usize],
}
const _: () = {
    ["Size of cs_arm64"][::std::mem::size_of::<cs_arm64>() - 456usize];
    ["Alignment of cs_arm64"][::std::mem::align_of::<cs_arm64>() - 8usize];
    ["Offset of field: cs_arm64::cc"][::std::mem::offset_of!(cs_arm64, cc) - 0usize];
    ["Offset of field: cs_arm64::update_flags"]
        [::std::mem::offset_of!(cs_arm64, update_flags) - 4usize];
    ["Offset of field: cs_arm64::writeback"][::std::mem::offset_of!(cs_arm64, writeback) - 5usize];
    ["Offset of field: cs_arm64::post_index"]
        [::std::mem::offset_of!(cs_arm64, post_index) - 6usize];
    ["Offset of field: cs_arm64::op_count"][::std::mem::offset_of!(cs_arm64, op_count) - 7usize];
    ["Offset of field: cs_arm64::operands"][::std::mem::offset_of!(cs_arm64, operands) - 8usize];
};
pub const arm64_insn_ARM64_INS_INVALID: arm64_insn = 0;
pub const arm64_insn_ARM64_INS_ABS: arm64_insn = 1;
pub const arm64_insn_ARM64_INS_ADC: arm64_insn = 2;
pub const arm64_insn_ARM64_INS_ADCLB: arm64_insn = 3;
pub const arm64_insn_ARM64_INS_ADCLT: arm64_insn = 4;
pub const arm64_insn_ARM64_INS_ADCS: arm64_insn = 5;
pub const arm64_insn_ARM64_INS_ADD: arm64_insn = 6;
pub const arm64_insn_ARM64_INS_ADDG: arm64_insn = 7;
pub const arm64_insn_ARM64_INS_ADDHA: arm64_insn = 8;
pub const arm64_insn_ARM64_INS_ADDHN: arm64_insn = 9;
pub const arm64_insn_ARM64_INS_ADDHN2: arm64_insn = 10;
pub const arm64_insn_ARM64_INS_ADDHNB: arm64_insn = 11;
pub const arm64_insn_ARM64_INS_ADDHNT: arm64_insn = 12;
pub const arm64_insn_ARM64_INS_ADDP: arm64_insn = 13;
pub const arm64_insn_ARM64_INS_ADDPL: arm64_insn = 14;
pub const arm64_insn_ARM64_INS_ADDS: arm64_insn = 15;
pub const arm64_insn_ARM64_INS_ADDV: arm64_insn = 16;
pub const arm64_insn_ARM64_INS_ADDVA: arm64_insn = 17;
pub const arm64_insn_ARM64_INS_ADDVL: arm64_insn = 18;
pub const arm64_insn_ARM64_INS_ADR: arm64_insn = 19;
pub const arm64_insn_ARM64_INS_ADRP: arm64_insn = 20;
pub const arm64_insn_ARM64_INS_AESD: arm64_insn = 21;
pub const arm64_insn_ARM64_INS_AESE: arm64_insn = 22;
pub const arm64_insn_ARM64_INS_AESIMC: arm64_insn = 23;
pub const arm64_insn_ARM64_INS_AESMC: arm64_insn = 24;
pub const arm64_insn_ARM64_INS_AND: arm64_insn = 25;
pub const arm64_insn_ARM64_INS_ANDS: arm64_insn = 26;
pub const arm64_insn_ARM64_INS_ANDV: arm64_insn = 27;
pub const arm64_insn_ARM64_INS_ASR: arm64_insn = 28;
pub const arm64_insn_ARM64_INS_ASRD: arm64_insn = 29;
pub const arm64_insn_ARM64_INS_ASRR: arm64_insn = 30;
pub const arm64_insn_ARM64_INS_ASRV: arm64_insn = 31;
pub const arm64_insn_ARM64_INS_AUTDA: arm64_insn = 32;
pub const arm64_insn_ARM64_INS_AUTDB: arm64_insn = 33;
pub const arm64_insn_ARM64_INS_AUTDZA: arm64_insn = 34;
pub const arm64_insn_ARM64_INS_AUTDZB: arm64_insn = 35;
pub const arm64_insn_ARM64_INS_AUTIA: arm64_insn = 36;
pub const arm64_insn_ARM64_INS_AUTIA1716: arm64_insn = 37;
pub const arm64_insn_ARM64_INS_AUTIASP: arm64_insn = 38;
pub const arm64_insn_ARM64_INS_AUTIAZ: arm64_insn = 39;
pub const arm64_insn_ARM64_INS_AUTIB: arm64_insn = 40;
pub const arm64_insn_ARM64_INS_AUTIB1716: arm64_insn = 41;
pub const arm64_insn_ARM64_INS_AUTIBSP: arm64_insn = 42;
pub const arm64_insn_ARM64_INS_AUTIBZ: arm64_insn = 43;
pub const arm64_insn_ARM64_INS_AUTIZA: arm64_insn = 44;
pub const arm64_insn_ARM64_INS_AUTIZB: arm64_insn = 45;
pub const arm64_insn_ARM64_INS_AXFLAG: arm64_insn = 46;
pub const arm64_insn_ARM64_INS_B: arm64_insn = 47;
pub const arm64_insn_ARM64_INS_BC: arm64_insn = 48;
pub const arm64_insn_ARM64_INS_BCAX: arm64_insn = 49;
pub const arm64_insn_ARM64_INS_BDEP: arm64_insn = 50;
pub const arm64_insn_ARM64_INS_BEXT: arm64_insn = 51;
pub const arm64_insn_ARM64_INS_BFCVT: arm64_insn = 52;
pub const arm64_insn_ARM64_INS_BFCVTN: arm64_insn = 53;
pub const arm64_insn_ARM64_INS_BFCVTN2: arm64_insn = 54;
pub const arm64_insn_ARM64_INS_BFCVTNT: arm64_insn = 55;
pub const arm64_insn_ARM64_INS_BFDOT: arm64_insn = 56;
pub const arm64_insn_ARM64_INS_BFM: arm64_insn = 57;
pub const arm64_insn_ARM64_INS_BFMLALB: arm64_insn = 58;
pub const arm64_insn_ARM64_INS_BFMLALT: arm64_insn = 59;
pub const arm64_insn_ARM64_INS_BFMMLA: arm64_insn = 60;
pub const arm64_insn_ARM64_INS_BFMOPA: arm64_insn = 61;
pub const arm64_insn_ARM64_INS_BFMOPS: arm64_insn = 62;
pub const arm64_insn_ARM64_INS_BGRP: arm64_insn = 63;
pub const arm64_insn_ARM64_INS_BIC: arm64_insn = 64;
pub const arm64_insn_ARM64_INS_BICS: arm64_insn = 65;
pub const arm64_insn_ARM64_INS_BIF: arm64_insn = 66;
pub const arm64_insn_ARM64_INS_BIT: arm64_insn = 67;
pub const arm64_insn_ARM64_INS_BL: arm64_insn = 68;
pub const arm64_insn_ARM64_INS_BLR: arm64_insn = 69;
pub const arm64_insn_ARM64_INS_BLRAA: arm64_insn = 70;
pub const arm64_insn_ARM64_INS_BLRAAZ: arm64_insn = 71;
pub const arm64_insn_ARM64_INS_BLRAB: arm64_insn = 72;
pub const arm64_insn_ARM64_INS_BLRABZ: arm64_insn = 73;
pub const arm64_insn_ARM64_INS_BR: arm64_insn = 74;
pub const arm64_insn_ARM64_INS_BRAA: arm64_insn = 75;
pub const arm64_insn_ARM64_INS_BRAAZ: arm64_insn = 76;
pub const arm64_insn_ARM64_INS_BRAB: arm64_insn = 77;
pub const arm64_insn_ARM64_INS_BRABZ: arm64_insn = 78;
pub const arm64_insn_ARM64_INS_BRB: arm64_insn = 79;
pub const arm64_insn_ARM64_INS_BRK: arm64_insn = 80;
pub const arm64_insn_ARM64_INS_BRKA: arm64_insn = 81;
pub const arm64_insn_ARM64_INS_BRKAS: arm64_insn = 82;
pub const arm64_insn_ARM64_INS_BRKB: arm64_insn = 83;
pub const arm64_insn_ARM64_INS_BRKBS: arm64_insn = 84;
pub const arm64_insn_ARM64_INS_BRKN: arm64_insn = 85;
pub const arm64_insn_ARM64_INS_BRKNS: arm64_insn = 86;
pub const arm64_insn_ARM64_INS_BRKPA: arm64_insn = 87;
pub const arm64_insn_ARM64_INS_BRKPAS: arm64_insn = 88;
pub const arm64_insn_ARM64_INS_BRKPB: arm64_insn = 89;
pub const arm64_insn_ARM64_INS_BRKPBS: arm64_insn = 90;
pub const arm64_insn_ARM64_INS_BSL: arm64_insn = 91;
pub const arm64_insn_ARM64_INS_BSL1N: arm64_insn = 92;
pub const arm64_insn_ARM64_INS_BSL2N: arm64_insn = 93;
pub const arm64_insn_ARM64_INS_BTI: arm64_insn = 94;
pub const arm64_insn_ARM64_INS_CADD: arm64_insn = 95;
pub const arm64_insn_ARM64_INS_CAS: arm64_insn = 96;
pub const arm64_insn_ARM64_INS_CASA: arm64_insn = 97;
pub const arm64_insn_ARM64_INS_CASAB: arm64_insn = 98;
pub const arm64_insn_ARM64_INS_CASAH: arm64_insn = 99;
pub const arm64_insn_ARM64_INS_CASAL: arm64_insn = 100;
pub const arm64_insn_ARM64_INS_CASALB: arm64_insn = 101;
pub const arm64_insn_ARM64_INS_CASALH: arm64_insn = 102;
pub const arm64_insn_ARM64_INS_CASB: arm64_insn = 103;
pub const arm64_insn_ARM64_INS_CASH: arm64_insn = 104;
pub const arm64_insn_ARM64_INS_CASL: arm64_insn = 105;
pub const arm64_insn_ARM64_INS_CASLB: arm64_insn = 106;
pub const arm64_insn_ARM64_INS_CASLH: arm64_insn = 107;
pub const arm64_insn_ARM64_INS_CASP: arm64_insn = 108;
pub const arm64_insn_ARM64_INS_CASPA: arm64_insn = 109;
pub const arm64_insn_ARM64_INS_CASPAL: arm64_insn = 110;
pub const arm64_insn_ARM64_INS_CASPL: arm64_insn = 111;
pub const arm64_insn_ARM64_INS_CBNZ: arm64_insn = 112;
pub const arm64_insn_ARM64_INS_CBZ: arm64_insn = 113;
pub const arm64_insn_ARM64_INS_CCMN: arm64_insn = 114;
pub const arm64_insn_ARM64_INS_CCMP: arm64_insn = 115;
pub const arm64_insn_ARM64_INS_CDOT: arm64_insn = 116;
pub const arm64_insn_ARM64_INS_CFINV: arm64_insn = 117;
pub const arm64_insn_ARM64_INS_CINC: arm64_insn = 118;
pub const arm64_insn_ARM64_INS_CINV: arm64_insn = 119;
pub const arm64_insn_ARM64_INS_CLASTA: arm64_insn = 120;
pub const arm64_insn_ARM64_INS_CLASTB: arm64_insn = 121;
pub const arm64_insn_ARM64_INS_CLREX: arm64_insn = 122;
pub const arm64_insn_ARM64_INS_CLS: arm64_insn = 123;
pub const arm64_insn_ARM64_INS_CLZ: arm64_insn = 124;
pub const arm64_insn_ARM64_INS_CMEQ: arm64_insn = 125;
pub const arm64_insn_ARM64_INS_CMGE: arm64_insn = 126;
pub const arm64_insn_ARM64_INS_CMGT: arm64_insn = 127;
pub const arm64_insn_ARM64_INS_CMHI: arm64_insn = 128;
pub const arm64_insn_ARM64_INS_CMHS: arm64_insn = 129;
pub const arm64_insn_ARM64_INS_CMLA: arm64_insn = 130;
pub const arm64_insn_ARM64_INS_CMLE: arm64_insn = 131;
pub const arm64_insn_ARM64_INS_CMLO: arm64_insn = 132;
pub const arm64_insn_ARM64_INS_CMLS: arm64_insn = 133;
pub const arm64_insn_ARM64_INS_CMLT: arm64_insn = 134;
pub const arm64_insn_ARM64_INS_CMN: arm64_insn = 135;
pub const arm64_insn_ARM64_INS_CMP: arm64_insn = 136;
pub const arm64_insn_ARM64_INS_CMPEQ: arm64_insn = 137;
pub const arm64_insn_ARM64_INS_CMPGE: arm64_insn = 138;
pub const arm64_insn_ARM64_INS_CMPGT: arm64_insn = 139;
pub const arm64_insn_ARM64_INS_CMPHI: arm64_insn = 140;
pub const arm64_insn_ARM64_INS_CMPHS: arm64_insn = 141;
pub const arm64_insn_ARM64_INS_CMPLE: arm64_insn = 142;
pub const arm64_insn_ARM64_INS_CMPLO: arm64_insn = 143;
pub const arm64_insn_ARM64_INS_CMPLS: arm64_insn = 144;
pub const arm64_insn_ARM64_INS_CMPLT: arm64_insn = 145;
pub const arm64_insn_ARM64_INS_CMPNE: arm64_insn = 146;
pub const arm64_insn_ARM64_INS_CMPP: arm64_insn = 147;
pub const arm64_insn_ARM64_INS_CMTST: arm64_insn = 148;
pub const arm64_insn_ARM64_INS_CNEG: arm64_insn = 149;
pub const arm64_insn_ARM64_INS_CNOT: arm64_insn = 150;
pub const arm64_insn_ARM64_INS_CNT: arm64_insn = 151;
pub const arm64_insn_ARM64_INS_CNTB: arm64_insn = 152;
pub const arm64_insn_ARM64_INS_CNTD: arm64_insn = 153;
pub const arm64_insn_ARM64_INS_CNTH: arm64_insn = 154;
pub const arm64_insn_ARM64_INS_CNTP: arm64_insn = 155;
pub const arm64_insn_ARM64_INS_CNTW: arm64_insn = 156;
pub const arm64_insn_ARM64_INS_COMPACT: arm64_insn = 157;
pub const arm64_insn_ARM64_INS_CPY: arm64_insn = 158;
pub const arm64_insn_ARM64_INS_CPYE: arm64_insn = 159;
pub const arm64_insn_ARM64_INS_CPYEN: arm64_insn = 160;
pub const arm64_insn_ARM64_INS_CPYERN: arm64_insn = 161;
pub const arm64_insn_ARM64_INS_CPYERT: arm64_insn = 162;
pub const arm64_insn_ARM64_INS_CPYERTN: arm64_insn = 163;
pub const arm64_insn_ARM64_INS_CPYERTRN: arm64_insn = 164;
pub const arm64_insn_ARM64_INS_CPYERTWN: arm64_insn = 165;
pub const arm64_insn_ARM64_INS_CPYET: arm64_insn = 166;
pub const arm64_insn_ARM64_INS_CPYETN: arm64_insn = 167;
pub const arm64_insn_ARM64_INS_CPYETRN: arm64_insn = 168;
pub const arm64_insn_ARM64_INS_CPYETWN: arm64_insn = 169;
pub const arm64_insn_ARM64_INS_CPYEWN: arm64_insn = 170;
pub const arm64_insn_ARM64_INS_CPYEWT: arm64_insn = 171;
pub const arm64_insn_ARM64_INS_CPYEWTN: arm64_insn = 172;
pub const arm64_insn_ARM64_INS_CPYEWTRN: arm64_insn = 173;
pub const arm64_insn_ARM64_INS_CPYEWTWN: arm64_insn = 174;
pub const arm64_insn_ARM64_INS_CPYFE: arm64_insn = 175;
pub const arm64_insn_ARM64_INS_CPYFEN: arm64_insn = 176;
pub const arm64_insn_ARM64_INS_CPYFERN: arm64_insn = 177;
pub const arm64_insn_ARM64_INS_CPYFERT: arm64_insn = 178;
pub const arm64_insn_ARM64_INS_CPYFERTN: arm64_insn = 179;
pub const arm64_insn_ARM64_INS_CPYFERTRN: arm64_insn = 180;
pub const arm64_insn_ARM64_INS_CPYFERTWN: arm64_insn = 181;
pub const arm64_insn_ARM64_INS_CPYFET: arm64_insn = 182;
pub const arm64_insn_ARM64_INS_CPYFETN: arm64_insn = 183;
pub const arm64_insn_ARM64_INS_CPYFETRN: arm64_insn = 184;
pub const arm64_insn_ARM64_INS_CPYFETWN: arm64_insn = 185;
pub const arm64_insn_ARM64_INS_CPYFEWN: arm64_insn = 186;
pub const arm64_insn_ARM64_INS_CPYFEWT: arm64_insn = 187;
pub const arm64_insn_ARM64_INS_CPYFEWTN: arm64_insn = 188;
pub const arm64_insn_ARM64_INS_CPYFEWTRN: arm64_insn = 189;
pub const arm64_insn_ARM64_INS_CPYFEWTWN: arm64_insn = 190;
pub const arm64_insn_ARM64_INS_CPYFM: arm64_insn = 191;
pub const arm64_insn_ARM64_INS_CPYFMN: arm64_insn = 192;
pub const arm64_insn_ARM64_INS_CPYFMRN: arm64_insn = 193;
pub const arm64_insn_ARM64_INS_CPYFMRT: arm64_insn = 194;
pub const arm64_insn_ARM64_INS_CPYFMRTN: arm64_insn = 195;
pub const arm64_insn_ARM64_INS_CPYFMRTRN: arm64_insn = 196;
pub const arm64_insn_ARM64_INS_CPYFMRTWN: arm64_insn = 197;
pub const arm64_insn_ARM64_INS_CPYFMT: arm64_insn = 198;
pub const arm64_insn_ARM64_INS_CPYFMTN: arm64_insn = 199;
pub const arm64_insn_ARM64_INS_CPYFMTRN: arm64_insn = 200;
pub const arm64_insn_ARM64_INS_CPYFMTWN: arm64_insn = 201;
pub const arm64_insn_ARM64_INS_CPYFMWN: arm64_insn = 202;
pub const arm64_insn_ARM64_INS_CPYFMWT: arm64_insn = 203;
pub const arm64_insn_ARM64_INS_CPYFMWTN: arm64_insn = 204;
pub const arm64_insn_ARM64_INS_CPYFMWTRN: arm64_insn = 205;
pub const arm64_insn_ARM64_INS_CPYFMWTWN: arm64_insn = 206;
pub const arm64_insn_ARM64_INS_CPYFP: arm64_insn = 207;
pub const arm64_insn_ARM64_INS_CPYFPN: arm64_insn = 208;
pub const arm64_insn_ARM64_INS_CPYFPRN: arm64_insn = 209;
pub const arm64_insn_ARM64_INS_CPYFPRT: arm64_insn = 210;
pub const arm64_insn_ARM64_INS_CPYFPRTN: arm64_insn = 211;
pub const arm64_insn_ARM64_INS_CPYFPRTRN: arm64_insn = 212;
pub const arm64_insn_ARM64_INS_CPYFPRTWN: arm64_insn = 213;
pub const arm64_insn_ARM64_INS_CPYFPT: arm64_insn = 214;
pub const arm64_insn_ARM64_INS_CPYFPTN: arm64_insn = 215;
pub const arm64_insn_ARM64_INS_CPYFPTRN: arm64_insn = 216;
pub const arm64_insn_ARM64_INS_CPYFPTWN: arm64_insn = 217;
pub const arm64_insn_ARM64_INS_CPYFPWN: arm64_insn = 218;
pub const arm64_insn_ARM64_INS_CPYFPWT: arm64_insn = 219;
pub const arm64_insn_ARM64_INS_CPYFPWTN: arm64_insn = 220;
pub const arm64_insn_ARM64_INS_CPYFPWTRN: arm64_insn = 221;
pub const arm64_insn_ARM64_INS_CPYFPWTWN: arm64_insn = 222;
pub const arm64_insn_ARM64_INS_CPYM: arm64_insn = 223;
pub const arm64_insn_ARM64_INS_CPYMN: arm64_insn = 224;
pub const arm64_insn_ARM64_INS_CPYMRN: arm64_insn = 225;
pub const arm64_insn_ARM64_INS_CPYMRT: arm64_insn = 226;
pub const arm64_insn_ARM64_INS_CPYMRTN: arm64_insn = 227;
pub const arm64_insn_ARM64_INS_CPYMRTRN: arm64_insn = 228;
pub const arm64_insn_ARM64_INS_CPYMRTWN: arm64_insn = 229;
pub const arm64_insn_ARM64_INS_CPYMT: arm64_insn = 230;
pub const arm64_insn_ARM64_INS_CPYMTN: arm64_insn = 231;
pub const arm64_insn_ARM64_INS_CPYMTRN: arm64_insn = 232;
pub const arm64_insn_ARM64_INS_CPYMTWN: arm64_insn = 233;
pub const arm64_insn_ARM64_INS_CPYMWN: arm64_insn = 234;
pub const arm64_insn_ARM64_INS_CPYMWT: arm64_insn = 235;
pub const arm64_insn_ARM64_INS_CPYMWTN: arm64_insn = 236;
pub const arm64_insn_ARM64_INS_CPYMWTRN: arm64_insn = 237;
pub const arm64_insn_ARM64_INS_CPYMWTWN: arm64_insn = 238;
pub const arm64_insn_ARM64_INS_CPYP: arm64_insn = 239;
pub const arm64_insn_ARM64_INS_CPYPN: arm64_insn = 240;
pub const arm64_insn_ARM64_INS_CPYPRN: arm64_insn = 241;
pub const arm64_insn_ARM64_INS_CPYPRT: arm64_insn = 242;
pub const arm64_insn_ARM64_INS_CPYPRTN: arm64_insn = 243;
pub const arm64_insn_ARM64_INS_CPYPRTRN: arm64_insn = 244;
pub const arm64_insn_ARM64_INS_CPYPRTWN: arm64_insn = 245;
pub const arm64_insn_ARM64_INS_CPYPT: arm64_insn = 246;
pub const arm64_insn_ARM64_INS_CPYPTN: arm64_insn = 247;
pub const arm64_insn_ARM64_INS_CPYPTRN: arm64_insn = 248;
pub const arm64_insn_ARM64_INS_CPYPTWN: arm64_insn = 249;
pub const arm64_insn_ARM64_INS_CPYPWN: arm64_insn = 250;
pub const arm64_insn_ARM64_INS_CPYPWT: arm64_insn = 251;
pub const arm64_insn_ARM64_INS_CPYPWTN: arm64_insn = 252;
pub const arm64_insn_ARM64_INS_CPYPWTRN: arm64_insn = 253;
pub const arm64_insn_ARM64_INS_CPYPWTWN: arm64_insn = 254;
pub const arm64_insn_ARM64_INS_CRC32B: arm64_insn = 255;
pub const arm64_insn_ARM64_INS_CRC32CB: arm64_insn = 256;
pub const arm64_insn_ARM64_INS_CRC32CH: arm64_insn = 257;
pub const arm64_insn_ARM64_INS_CRC32CW: arm64_insn = 258;
pub const arm64_insn_ARM64_INS_CRC32CX: arm64_insn = 259;
pub const arm64_insn_ARM64_INS_CRC32H: arm64_insn = 260;
pub const arm64_insn_ARM64_INS_CRC32W: arm64_insn = 261;
pub const arm64_insn_ARM64_INS_CRC32X: arm64_insn = 262;
pub const arm64_insn_ARM64_INS_CSDB: arm64_insn = 263;
pub const arm64_insn_ARM64_INS_CSEL: arm64_insn = 264;
pub const arm64_insn_ARM64_INS_CSET: arm64_insn = 265;
pub const arm64_insn_ARM64_INS_CSETM: arm64_insn = 266;
pub const arm64_insn_ARM64_INS_CSINC: arm64_insn = 267;
pub const arm64_insn_ARM64_INS_CSINV: arm64_insn = 268;
pub const arm64_insn_ARM64_INS_CSNEG: arm64_insn = 269;
pub const arm64_insn_ARM64_INS_CTERMEQ: arm64_insn = 270;
pub const arm64_insn_ARM64_INS_CTERMNE: arm64_insn = 271;
pub const arm64_insn_ARM64_INS_DCPS1: arm64_insn = 272;
pub const arm64_insn_ARM64_INS_DCPS2: arm64_insn = 273;
pub const arm64_insn_ARM64_INS_DCPS3: arm64_insn = 274;
pub const arm64_insn_ARM64_INS_DECB: arm64_insn = 275;
pub const arm64_insn_ARM64_INS_DECD: arm64_insn = 276;
pub const arm64_insn_ARM64_INS_DECH: arm64_insn = 277;
pub const arm64_insn_ARM64_INS_DECP: arm64_insn = 278;
pub const arm64_insn_ARM64_INS_DECW: arm64_insn = 279;
pub const arm64_insn_ARM64_INS_DFB: arm64_insn = 280;
pub const arm64_insn_ARM64_INS_DGH: arm64_insn = 281;
pub const arm64_insn_ARM64_INS_DMB: arm64_insn = 282;
pub const arm64_insn_ARM64_INS_DRPS: arm64_insn = 283;
pub const arm64_insn_ARM64_INS_DSB: arm64_insn = 284;
pub const arm64_insn_ARM64_INS_DUP: arm64_insn = 285;
pub const arm64_insn_ARM64_INS_DUPM: arm64_insn = 286;
pub const arm64_insn_ARM64_INS_EON: arm64_insn = 287;
pub const arm64_insn_ARM64_INS_EOR: arm64_insn = 288;
pub const arm64_insn_ARM64_INS_EOR3: arm64_insn = 289;
pub const arm64_insn_ARM64_INS_EORBT: arm64_insn = 290;
pub const arm64_insn_ARM64_INS_EORS: arm64_insn = 291;
pub const arm64_insn_ARM64_INS_EORTB: arm64_insn = 292;
pub const arm64_insn_ARM64_INS_EORV: arm64_insn = 293;
pub const arm64_insn_ARM64_INS_ERET: arm64_insn = 294;
pub const arm64_insn_ARM64_INS_ERETAA: arm64_insn = 295;
pub const arm64_insn_ARM64_INS_ERETAB: arm64_insn = 296;
pub const arm64_insn_ARM64_INS_ESB: arm64_insn = 297;
pub const arm64_insn_ARM64_INS_EXT: arm64_insn = 298;
pub const arm64_insn_ARM64_INS_EXTR: arm64_insn = 299;
pub const arm64_insn_ARM64_INS_FABD: arm64_insn = 300;
pub const arm64_insn_ARM64_INS_FABS: arm64_insn = 301;
pub const arm64_insn_ARM64_INS_FACGE: arm64_insn = 302;
pub const arm64_insn_ARM64_INS_FACGT: arm64_insn = 303;
pub const arm64_insn_ARM64_INS_FACLE: arm64_insn = 304;
pub const arm64_insn_ARM64_INS_FACLT: arm64_insn = 305;
pub const arm64_insn_ARM64_INS_FADD: arm64_insn = 306;
pub const arm64_insn_ARM64_INS_FADDA: arm64_insn = 307;
pub const arm64_insn_ARM64_INS_FADDP: arm64_insn = 308;
pub const arm64_insn_ARM64_INS_FADDV: arm64_insn = 309;
pub const arm64_insn_ARM64_INS_FCADD: arm64_insn = 310;
pub const arm64_insn_ARM64_INS_FCCMP: arm64_insn = 311;
pub const arm64_insn_ARM64_INS_FCCMPE: arm64_insn = 312;
pub const arm64_insn_ARM64_INS_FCMEQ: arm64_insn = 313;
pub const arm64_insn_ARM64_INS_FCMGE: arm64_insn = 314;
pub const arm64_insn_ARM64_INS_FCMGT: arm64_insn = 315;
pub const arm64_insn_ARM64_INS_FCMLA: arm64_insn = 316;
pub const arm64_insn_ARM64_INS_FCMLE: arm64_insn = 317;
pub const arm64_insn_ARM64_INS_FCMLT: arm64_insn = 318;
pub const arm64_insn_ARM64_INS_FCMNE: arm64_insn = 319;
pub const arm64_insn_ARM64_INS_FCMP: arm64_insn = 320;
pub const arm64_insn_ARM64_INS_FCMPE: arm64_insn = 321;
pub const arm64_insn_ARM64_INS_FCMUO: arm64_insn = 322;
pub const arm64_insn_ARM64_INS_FCPY: arm64_insn = 323;
pub const arm64_insn_ARM64_INS_FCSEL: arm64_insn = 324;
pub const arm64_insn_ARM64_INS_FCVT: arm64_insn = 325;
pub const arm64_insn_ARM64_INS_FCVTAS: arm64_insn = 326;
pub const arm64_insn_ARM64_INS_FCVTAU: arm64_insn = 327;
pub const arm64_insn_ARM64_INS_FCVTL: arm64_insn = 328;
pub const arm64_insn_ARM64_INS_FCVTL2: arm64_insn = 329;
pub const arm64_insn_ARM64_INS_FCVTLT: arm64_insn = 330;
pub const arm64_insn_ARM64_INS_FCVTMS: arm64_insn = 331;
pub const arm64_insn_ARM64_INS_FCVTMU: arm64_insn = 332;
pub const arm64_insn_ARM64_INS_FCVTN: arm64_insn = 333;
pub const arm64_insn_ARM64_INS_FCVTN2: arm64_insn = 334;
pub const arm64_insn_ARM64_INS_FCVTNS: arm64_insn = 335;
pub const arm64_insn_ARM64_INS_FCVTNT: arm64_insn = 336;
pub const arm64_insn_ARM64_INS_FCVTNU: arm64_insn = 337;
pub const arm64_insn_ARM64_INS_FCVTPS: arm64_insn = 338;
pub const arm64_insn_ARM64_INS_FCVTPU: arm64_insn = 339;
pub const arm64_insn_ARM64_INS_FCVTX: arm64_insn = 340;
pub const arm64_insn_ARM64_INS_FCVTXN: arm64_insn = 341;
pub const arm64_insn_ARM64_INS_FCVTXN2: arm64_insn = 342;
pub const arm64_insn_ARM64_INS_FCVTXNT: arm64_insn = 343;
pub const arm64_insn_ARM64_INS_FCVTZS: arm64_insn = 344;
pub const arm64_insn_ARM64_INS_FCVTZU: arm64_insn = 345;
pub const arm64_insn_ARM64_INS_FDIV: arm64_insn = 346;
pub const arm64_insn_ARM64_INS_FDIVR: arm64_insn = 347;
pub const arm64_insn_ARM64_INS_FDUP: arm64_insn = 348;
pub const arm64_insn_ARM64_INS_FEXPA: arm64_insn = 349;
pub const arm64_insn_ARM64_INS_FJCVTZS: arm64_insn = 350;
pub const arm64_insn_ARM64_INS_FLOGB: arm64_insn = 351;
pub const arm64_insn_ARM64_INS_FMAD: arm64_insn = 352;
pub const arm64_insn_ARM64_INS_FMADD: arm64_insn = 353;
pub const arm64_insn_ARM64_INS_FMAX: arm64_insn = 354;
pub const arm64_insn_ARM64_INS_FMAXNM: arm64_insn = 355;
pub const arm64_insn_ARM64_INS_FMAXNMP: arm64_insn = 356;
pub const arm64_insn_ARM64_INS_FMAXNMV: arm64_insn = 357;
pub const arm64_insn_ARM64_INS_FMAXP: arm64_insn = 358;
pub const arm64_insn_ARM64_INS_FMAXV: arm64_insn = 359;
pub const arm64_insn_ARM64_INS_FMIN: arm64_insn = 360;
pub const arm64_insn_ARM64_INS_FMINNM: arm64_insn = 361;
pub const arm64_insn_ARM64_INS_FMINNMP: arm64_insn = 362;
pub const arm64_insn_ARM64_INS_FMINNMV: arm64_insn = 363;
pub const arm64_insn_ARM64_INS_FMINP: arm64_insn = 364;
pub const arm64_insn_ARM64_INS_FMINV: arm64_insn = 365;
pub const arm64_insn_ARM64_INS_FMLA: arm64_insn = 366;
pub const arm64_insn_ARM64_INS_FMLAL: arm64_insn = 367;
pub const arm64_insn_ARM64_INS_FMLAL2: arm64_insn = 368;
pub const arm64_insn_ARM64_INS_FMLALB: arm64_insn = 369;
pub const arm64_insn_ARM64_INS_FMLALT: arm64_insn = 370;
pub const arm64_insn_ARM64_INS_FMLS: arm64_insn = 371;
pub const arm64_insn_ARM64_INS_FMLSL: arm64_insn = 372;
pub const arm64_insn_ARM64_INS_FMLSL2: arm64_insn = 373;
pub const arm64_insn_ARM64_INS_FMLSLB: arm64_insn = 374;
pub const arm64_insn_ARM64_INS_FMLSLT: arm64_insn = 375;
pub const arm64_insn_ARM64_INS_FMMLA: arm64_insn = 376;
pub const arm64_insn_ARM64_INS_FMOPA: arm64_insn = 377;
pub const arm64_insn_ARM64_INS_FMOPS: arm64_insn = 378;
pub const arm64_insn_ARM64_INS_FMOV: arm64_insn = 379;
pub const arm64_insn_ARM64_INS_FMSB: arm64_insn = 380;
pub const arm64_insn_ARM64_INS_FMSUB: arm64_insn = 381;
pub const arm64_insn_ARM64_INS_FMUL: arm64_insn = 382;
pub const arm64_insn_ARM64_INS_FMULX: arm64_insn = 383;
pub const arm64_insn_ARM64_INS_FNEG: arm64_insn = 384;
pub const arm64_insn_ARM64_INS_FNMAD: arm64_insn = 385;
pub const arm64_insn_ARM64_INS_FNMADD: arm64_insn = 386;
pub const arm64_insn_ARM64_INS_FNMLA: arm64_insn = 387;
pub const arm64_insn_ARM64_INS_FNMLS: arm64_insn = 388;
pub const arm64_insn_ARM64_INS_FNMSB: arm64_insn = 389;
pub const arm64_insn_ARM64_INS_FNMSUB: arm64_insn = 390;
pub const arm64_insn_ARM64_INS_FNMUL: arm64_insn = 391;
pub const arm64_insn_ARM64_INS_FRECPE: arm64_insn = 392;
pub const arm64_insn_ARM64_INS_FRECPS: arm64_insn = 393;
pub const arm64_insn_ARM64_INS_FRECPX: arm64_insn = 394;
pub const arm64_insn_ARM64_INS_FRINT32X: arm64_insn = 395;
pub const arm64_insn_ARM64_INS_FRINT32Z: arm64_insn = 396;
pub const arm64_insn_ARM64_INS_FRINT64X: arm64_insn = 397;
pub const arm64_insn_ARM64_INS_FRINT64Z: arm64_insn = 398;
pub const arm64_insn_ARM64_INS_FRINTA: arm64_insn = 399;
pub const arm64_insn_ARM64_INS_FRINTI: arm64_insn = 400;
pub const arm64_insn_ARM64_INS_FRINTM: arm64_insn = 401;
pub const arm64_insn_ARM64_INS_FRINTN: arm64_insn = 402;
pub const arm64_insn_ARM64_INS_FRINTP: arm64_insn = 403;
pub const arm64_insn_ARM64_INS_FRINTX: arm64_insn = 404;
pub const arm64_insn_ARM64_INS_FRINTZ: arm64_insn = 405;
pub const arm64_insn_ARM64_INS_FRSQRTE: arm64_insn = 406;
pub const arm64_insn_ARM64_INS_FRSQRTS: arm64_insn = 407;
pub const arm64_insn_ARM64_INS_FSCALE: arm64_insn = 408;
pub const arm64_insn_ARM64_INS_FSQRT: arm64_insn = 409;
pub const arm64_insn_ARM64_INS_FSUB: arm64_insn = 410;
pub const arm64_insn_ARM64_INS_FSUBR: arm64_insn = 411;
pub const arm64_insn_ARM64_INS_FTMAD: arm64_insn = 412;
pub const arm64_insn_ARM64_INS_FTSMUL: arm64_insn = 413;
pub const arm64_insn_ARM64_INS_FTSSEL: arm64_insn = 414;
pub const arm64_insn_ARM64_INS_GMI: arm64_insn = 415;
pub const arm64_insn_ARM64_INS_HINT: arm64_insn = 416;
pub const arm64_insn_ARM64_INS_HISTCNT: arm64_insn = 417;
pub const arm64_insn_ARM64_INS_HISTSEG: arm64_insn = 418;
pub const arm64_insn_ARM64_INS_HLT: arm64_insn = 419;
pub const arm64_insn_ARM64_INS_HVC: arm64_insn = 420;
pub const arm64_insn_ARM64_INS_INCB: arm64_insn = 421;
pub const arm64_insn_ARM64_INS_INCD: arm64_insn = 422;
pub const arm64_insn_ARM64_INS_INCH: arm64_insn = 423;
pub const arm64_insn_ARM64_INS_INCP: arm64_insn = 424;
pub const arm64_insn_ARM64_INS_INCW: arm64_insn = 425;
pub const arm64_insn_ARM64_INS_INDEX: arm64_insn = 426;
pub const arm64_insn_ARM64_INS_INS: arm64_insn = 427;
pub const arm64_insn_ARM64_INS_INSR: arm64_insn = 428;
pub const arm64_insn_ARM64_INS_IRG: arm64_insn = 429;
pub const arm64_insn_ARM64_INS_ISB: arm64_insn = 430;
pub const arm64_insn_ARM64_INS_LASTA: arm64_insn = 431;
pub const arm64_insn_ARM64_INS_LASTB: arm64_insn = 432;
pub const arm64_insn_ARM64_INS_LD1: arm64_insn = 433;
pub const arm64_insn_ARM64_INS_LD1B: arm64_insn = 434;
pub const arm64_insn_ARM64_INS_LD1D: arm64_insn = 435;
pub const arm64_insn_ARM64_INS_LD1H: arm64_insn = 436;
pub const arm64_insn_ARM64_INS_LD1Q: arm64_insn = 437;
pub const arm64_insn_ARM64_INS_LD1R: arm64_insn = 438;
pub const arm64_insn_ARM64_INS_LD1RB: arm64_insn = 439;
pub const arm64_insn_ARM64_INS_LD1RD: arm64_insn = 440;
pub const arm64_insn_ARM64_INS_LD1RH: arm64_insn = 441;
pub const arm64_insn_ARM64_INS_LD1ROB: arm64_insn = 442;
pub const arm64_insn_ARM64_INS_LD1ROD: arm64_insn = 443;
pub const arm64_insn_ARM64_INS_LD1ROH: arm64_insn = 444;
pub const arm64_insn_ARM64_INS_LD1ROW: arm64_insn = 445;
pub const arm64_insn_ARM64_INS_LD1RQB: arm64_insn = 446;
pub const arm64_insn_ARM64_INS_LD1RQD: arm64_insn = 447;
pub const arm64_insn_ARM64_INS_LD1RQH: arm64_insn = 448;
pub const arm64_insn_ARM64_INS_LD1RQW: arm64_insn = 449;
pub const arm64_insn_ARM64_INS_LD1RSB: arm64_insn = 450;
pub const arm64_insn_ARM64_INS_LD1RSH: arm64_insn = 451;
pub const arm64_insn_ARM64_INS_LD1RSW: arm64_insn = 452;
pub const arm64_insn_ARM64_INS_LD1RW: arm64_insn = 453;
pub const arm64_insn_ARM64_INS_LD1SB: arm64_insn = 454;
pub const arm64_insn_ARM64_INS_LD1SH: arm64_insn = 455;
pub const arm64_insn_ARM64_INS_LD1SW: arm64_insn = 456;
pub const arm64_insn_ARM64_INS_LD1W: arm64_insn = 457;
pub const arm64_insn_ARM64_INS_LD2: arm64_insn = 458;
pub const arm64_insn_ARM64_INS_LD2B: arm64_insn = 459;
pub const arm64_insn_ARM64_INS_LD2D: arm64_insn = 460;
pub const arm64_insn_ARM64_INS_LD2H: arm64_insn = 461;
pub const arm64_insn_ARM64_INS_LD2R: arm64_insn = 462;
pub const arm64_insn_ARM64_INS_LD2W: arm64_insn = 463;
pub const arm64_insn_ARM64_INS_LD3: arm64_insn = 464;
pub const arm64_insn_ARM64_INS_LD3B: arm64_insn = 465;
pub const arm64_insn_ARM64_INS_LD3D: arm64_insn = 466;
pub const arm64_insn_ARM64_INS_LD3H: arm64_insn = 467;
pub const arm64_insn_ARM64_INS_LD3R: arm64_insn = 468;
pub const arm64_insn_ARM64_INS_LD3W: arm64_insn = 469;
pub const arm64_insn_ARM64_INS_LD4: arm64_insn = 470;
pub const arm64_insn_ARM64_INS_LD4B: arm64_insn = 471;
pub const arm64_insn_ARM64_INS_LD4D: arm64_insn = 472;
pub const arm64_insn_ARM64_INS_LD4H: arm64_insn = 473;
pub const arm64_insn_ARM64_INS_LD4R: arm64_insn = 474;
pub const arm64_insn_ARM64_INS_LD4W: arm64_insn = 475;
pub const arm64_insn_ARM64_INS_LD64B: arm64_insn = 476;
pub const arm64_insn_ARM64_INS_LDADD: arm64_insn = 477;
pub const arm64_insn_ARM64_INS_LDADDA: arm64_insn = 478;
pub const arm64_insn_ARM64_INS_LDADDAB: arm64_insn = 479;
pub const arm64_insn_ARM64_INS_LDADDAH: arm64_insn = 480;
pub const arm64_insn_ARM64_INS_LDADDAL: arm64_insn = 481;
pub const arm64_insn_ARM64_INS_LDADDALB: arm64_insn = 482;
pub const arm64_insn_ARM64_INS_LDADDALH: arm64_insn = 483;
pub const arm64_insn_ARM64_INS_LDADDB: arm64_insn = 484;
pub const arm64_insn_ARM64_INS_LDADDH: arm64_insn = 485;
pub const arm64_insn_ARM64_INS_LDADDL: arm64_insn = 486;
pub const arm64_insn_ARM64_INS_LDADDLB: arm64_insn = 487;
pub const arm64_insn_ARM64_INS_LDADDLH: arm64_insn = 488;
pub const arm64_insn_ARM64_INS_LDAPR: arm64_insn = 489;
pub const arm64_insn_ARM64_INS_LDAPRB: arm64_insn = 490;
pub const arm64_insn_ARM64_INS_LDAPRH: arm64_insn = 491;
pub const arm64_insn_ARM64_INS_LDAPUR: arm64_insn = 492;
pub const arm64_insn_ARM64_INS_LDAPURB: arm64_insn = 493;
pub const arm64_insn_ARM64_INS_LDAPURH: arm64_insn = 494;
pub const arm64_insn_ARM64_INS_LDAPURSB: arm64_insn = 495;
pub const arm64_insn_ARM64_INS_LDAPURSH: arm64_insn = 496;
pub const arm64_insn_ARM64_INS_LDAPURSW: arm64_insn = 497;
pub const arm64_insn_ARM64_INS_LDAR: arm64_insn = 498;
pub const arm64_insn_ARM64_INS_LDARB: arm64_insn = 499;
pub const arm64_insn_ARM64_INS_LDARH: arm64_insn = 500;
pub const arm64_insn_ARM64_INS_LDAXP: arm64_insn = 501;
pub const arm64_insn_ARM64_INS_LDAXR: arm64_insn = 502;
pub const arm64_insn_ARM64_INS_LDAXRB: arm64_insn = 503;
pub const arm64_insn_ARM64_INS_LDAXRH: arm64_insn = 504;
pub const arm64_insn_ARM64_INS_LDCLR: arm64_insn = 505;
pub const arm64_insn_ARM64_INS_LDCLRA: arm64_insn = 506;
pub const arm64_insn_ARM64_INS_LDCLRAB: arm64_insn = 507;
pub const arm64_insn_ARM64_INS_LDCLRAH: arm64_insn = 508;
pub const arm64_insn_ARM64_INS_LDCLRAL: arm64_insn = 509;
pub const arm64_insn_ARM64_INS_LDCLRALB: arm64_insn = 510;
pub const arm64_insn_ARM64_INS_LDCLRALH: arm64_insn = 511;
pub const arm64_insn_ARM64_INS_LDCLRB: arm64_insn = 512;
pub const arm64_insn_ARM64_INS_LDCLRH: arm64_insn = 513;
pub const arm64_insn_ARM64_INS_LDCLRL: arm64_insn = 514;
pub const arm64_insn_ARM64_INS_LDCLRLB: arm64_insn = 515;
pub const arm64_insn_ARM64_INS_LDCLRLH: arm64_insn = 516;
pub const arm64_insn_ARM64_INS_LDEOR: arm64_insn = 517;
pub const arm64_insn_ARM64_INS_LDEORA: arm64_insn = 518;
pub const arm64_insn_ARM64_INS_LDEORAB: arm64_insn = 519;
pub const arm64_insn_ARM64_INS_LDEORAH: arm64_insn = 520;
pub const arm64_insn_ARM64_INS_LDEORAL: arm64_insn = 521;
pub const arm64_insn_ARM64_INS_LDEORALB: arm64_insn = 522;
pub const arm64_insn_ARM64_INS_LDEORALH: arm64_insn = 523;
pub const arm64_insn_ARM64_INS_LDEORB: arm64_insn = 524;
pub const arm64_insn_ARM64_INS_LDEORH: arm64_insn = 525;
pub const arm64_insn_ARM64_INS_LDEORL: arm64_insn = 526;
pub const arm64_insn_ARM64_INS_LDEORLB: arm64_insn = 527;
pub const arm64_insn_ARM64_INS_LDEORLH: arm64_insn = 528;
pub const arm64_insn_ARM64_INS_LDFF1B: arm64_insn = 529;
pub const arm64_insn_ARM64_INS_LDFF1D: arm64_insn = 530;
pub const arm64_insn_ARM64_INS_LDFF1H: arm64_insn = 531;
pub const arm64_insn_ARM64_INS_LDFF1SB: arm64_insn = 532;
pub const arm64_insn_ARM64_INS_LDFF1SH: arm64_insn = 533;
pub const arm64_insn_ARM64_INS_LDFF1SW: arm64_insn = 534;
pub const arm64_insn_ARM64_INS_LDFF1W: arm64_insn = 535;
pub const arm64_insn_ARM64_INS_LDG: arm64_insn = 536;
pub const arm64_insn_ARM64_INS_LDGM: arm64_insn = 537;
pub const arm64_insn_ARM64_INS_LDLAR: arm64_insn = 538;
pub const arm64_insn_ARM64_INS_LDLARB: arm64_insn = 539;
pub const arm64_insn_ARM64_INS_LDLARH: arm64_insn = 540;
pub const arm64_insn_ARM64_INS_LDNF1B: arm64_insn = 541;
pub const arm64_insn_ARM64_INS_LDNF1D: arm64_insn = 542;
pub const arm64_insn_ARM64_INS_LDNF1H: arm64_insn = 543;
pub const arm64_insn_ARM64_INS_LDNF1SB: arm64_insn = 544;
pub const arm64_insn_ARM64_INS_LDNF1SH: arm64_insn = 545;
pub const arm64_insn_ARM64_INS_LDNF1SW: arm64_insn = 546;
pub const arm64_insn_ARM64_INS_LDNF1W: arm64_insn = 547;
pub const arm64_insn_ARM64_INS_LDNP: arm64_insn = 548;
pub const arm64_insn_ARM64_INS_LDNT1B: arm64_insn = 549;
pub const arm64_insn_ARM64_INS_LDNT1D: arm64_insn = 550;
pub const arm64_insn_ARM64_INS_LDNT1H: arm64_insn = 551;
pub const arm64_insn_ARM64_INS_LDNT1SB: arm64_insn = 552;
pub const arm64_insn_ARM64_INS_LDNT1SH: arm64_insn = 553;
pub const arm64_insn_ARM64_INS_LDNT1SW: arm64_insn = 554;
pub const arm64_insn_ARM64_INS_LDNT1W: arm64_insn = 555;
pub const arm64_insn_ARM64_INS_LDP: arm64_insn = 556;
pub const arm64_insn_ARM64_INS_LDPSW: arm64_insn = 557;
pub const arm64_insn_ARM64_INS_LDR: arm64_insn = 558;
pub const arm64_insn_ARM64_INS_LDRAA: arm64_insn = 559;
pub const arm64_insn_ARM64_INS_LDRAB: arm64_insn = 560;
pub const arm64_insn_ARM64_INS_LDRB: arm64_insn = 561;
pub const arm64_insn_ARM64_INS_LDRH: arm64_insn = 562;
pub const arm64_insn_ARM64_INS_LDRSB: arm64_insn = 563;
pub const arm64_insn_ARM64_INS_LDRSH: arm64_insn = 564;
pub const arm64_insn_ARM64_INS_LDRSW: arm64_insn = 565;
pub const arm64_insn_ARM64_INS_LDSET: arm64_insn = 566;
pub const arm64_insn_ARM64_INS_LDSETA: arm64_insn = 567;
pub const arm64_insn_ARM64_INS_LDSETAB: arm64_insn = 568;
pub const arm64_insn_ARM64_INS_LDSETAH: arm64_insn = 569;
pub const arm64_insn_ARM64_INS_LDSETAL: arm64_insn = 570;
pub const arm64_insn_ARM64_INS_LDSETALB: arm64_insn = 571;
pub const arm64_insn_ARM64_INS_LDSETALH: arm64_insn = 572;
pub const arm64_insn_ARM64_INS_LDSETB: arm64_insn = 573;
pub const arm64_insn_ARM64_INS_LDSETH: arm64_insn = 574;
pub const arm64_insn_ARM64_INS_LDSETL: arm64_insn = 575;
pub const arm64_insn_ARM64_INS_LDSETLB: arm64_insn = 576;
pub const arm64_insn_ARM64_INS_LDSETLH: arm64_insn = 577;
pub const arm64_insn_ARM64_INS_LDSMAX: arm64_insn = 578;
pub const arm64_insn_ARM64_INS_LDSMAXA: arm64_insn = 579;
pub const arm64_insn_ARM64_INS_LDSMAXAB: arm64_insn = 580;
pub const arm64_insn_ARM64_INS_LDSMAXAH: arm64_insn = 581;
pub const arm64_insn_ARM64_INS_LDSMAXAL: arm64_insn = 582;
pub const arm64_insn_ARM64_INS_LDSMAXALB: arm64_insn = 583;
pub const arm64_insn_ARM64_INS_LDSMAXALH: arm64_insn = 584;
pub const arm64_insn_ARM64_INS_LDSMAXB: arm64_insn = 585;
pub const arm64_insn_ARM64_INS_LDSMAXH: arm64_insn = 586;
pub const arm64_insn_ARM64_INS_LDSMAXL: arm64_insn = 587;
pub const arm64_insn_ARM64_INS_LDSMAXLB: arm64_insn = 588;
pub const arm64_insn_ARM64_INS_LDSMAXLH: arm64_insn = 589;
pub const arm64_insn_ARM64_INS_LDSMIN: arm64_insn = 590;
pub const arm64_insn_ARM64_INS_LDSMINA: arm64_insn = 591;
pub const arm64_insn_ARM64_INS_LDSMINAB: arm64_insn = 592;
pub const arm64_insn_ARM64_INS_LDSMINAH: arm64_insn = 593;
pub const arm64_insn_ARM64_INS_LDSMINAL: arm64_insn = 594;
pub const arm64_insn_ARM64_INS_LDSMINALB: arm64_insn = 595;
pub const arm64_insn_ARM64_INS_LDSMINALH: arm64_insn = 596;
pub const arm64_insn_ARM64_INS_LDSMINB: arm64_insn = 597;
pub const arm64_insn_ARM64_INS_LDSMINH: arm64_insn = 598;
pub const arm64_insn_ARM64_INS_LDSMINL: arm64_insn = 599;
pub const arm64_insn_ARM64_INS_LDSMINLB: arm64_insn = 600;
pub const arm64_insn_ARM64_INS_LDSMINLH: arm64_insn = 601;
pub const arm64_insn_ARM64_INS_LDTR: arm64_insn = 602;
pub const arm64_insn_ARM64_INS_LDTRB: arm64_insn = 603;
pub const arm64_insn_ARM64_INS_LDTRH: arm64_insn = 604;
pub const arm64_insn_ARM64_INS_LDTRSB: arm64_insn = 605;
pub const arm64_insn_ARM64_INS_LDTRSH: arm64_insn = 606;
pub const arm64_insn_ARM64_INS_LDTRSW: arm64_insn = 607;
pub const arm64_insn_ARM64_INS_LDUMAX: arm64_insn = 608;
pub const arm64_insn_ARM64_INS_LDUMAXA: arm64_insn = 609;
pub const arm64_insn_ARM64_INS_LDUMAXAB: arm64_insn = 610;
pub const arm64_insn_ARM64_INS_LDUMAXAH: arm64_insn = 611;
pub const arm64_insn_ARM64_INS_LDUMAXAL: arm64_insn = 612;
pub const arm64_insn_ARM64_INS_LDUMAXALB: arm64_insn = 613;
pub const arm64_insn_ARM64_INS_LDUMAXALH: arm64_insn = 614;
pub const arm64_insn_ARM64_INS_LDUMAXB: arm64_insn = 615;
pub const arm64_insn_ARM64_INS_LDUMAXH: arm64_insn = 616;
pub const arm64_insn_ARM64_INS_LDUMAXL: arm64_insn = 617;
pub const arm64_insn_ARM64_INS_LDUMAXLB: arm64_insn = 618;
pub const arm64_insn_ARM64_INS_LDUMAXLH: arm64_insn = 619;
pub const arm64_insn_ARM64_INS_LDUMIN: arm64_insn = 620;
pub const arm64_insn_ARM64_INS_LDUMINA: arm64_insn = 621;
pub const arm64_insn_ARM64_INS_LDUMINAB: arm64_insn = 622;
pub const arm64_insn_ARM64_INS_LDUMINAH: arm64_insn = 623;
pub const arm64_insn_ARM64_INS_LDUMINAL: arm64_insn = 624;
pub const arm64_insn_ARM64_INS_LDUMINALB: arm64_insn = 625;
pub const arm64_insn_ARM64_INS_LDUMINALH: arm64_insn = 626;
pub const arm64_insn_ARM64_INS_LDUMINB: arm64_insn = 627;
pub const arm64_insn_ARM64_INS_LDUMINH: arm64_insn = 628;
pub const arm64_insn_ARM64_INS_LDUMINL: arm64_insn = 629;
pub const arm64_insn_ARM64_INS_LDUMINLB: arm64_insn = 630;
pub const arm64_insn_ARM64_INS_LDUMINLH: arm64_insn = 631;
pub const arm64_insn_ARM64_INS_LDUR: arm64_insn = 632;
pub const arm64_insn_ARM64_INS_LDURB: arm64_insn = 633;
pub const arm64_insn_ARM64_INS_LDURH: arm64_insn = 634;
pub const arm64_insn_ARM64_INS_LDURSB: arm64_insn = 635;
pub const arm64_insn_ARM64_INS_LDURSH: arm64_insn = 636;
pub const arm64_insn_ARM64_INS_LDURSW: arm64_insn = 637;
pub const arm64_insn_ARM64_INS_LDXP: arm64_insn = 638;
pub const arm64_insn_ARM64_INS_LDXR: arm64_insn = 639;
pub const arm64_insn_ARM64_INS_LDXRB: arm64_insn = 640;
pub const arm64_insn_ARM64_INS_LDXRH: arm64_insn = 641;
pub const arm64_insn_ARM64_INS_LSL: arm64_insn = 642;
pub const arm64_insn_ARM64_INS_LSLR: arm64_insn = 643;
pub const arm64_insn_ARM64_INS_LSLV: arm64_insn = 644;
pub const arm64_insn_ARM64_INS_LSR: arm64_insn = 645;
pub const arm64_insn_ARM64_INS_LSRR: arm64_insn = 646;
pub const arm64_insn_ARM64_INS_LSRV: arm64_insn = 647;
pub const arm64_insn_ARM64_INS_MAD: arm64_insn = 648;
pub const arm64_insn_ARM64_INS_MADD: arm64_insn = 649;
pub const arm64_insn_ARM64_INS_MATCH: arm64_insn = 650;
pub const arm64_insn_ARM64_INS_MLA: arm64_insn = 651;
pub const arm64_insn_ARM64_INS_MLS: arm64_insn = 652;
pub const arm64_insn_ARM64_INS_MNEG: arm64_insn = 653;
pub const arm64_insn_ARM64_INS_MOV: arm64_insn = 654;
pub const arm64_insn_ARM64_INS_MOVA: arm64_insn = 655;
pub const arm64_insn_ARM64_INS_MOVI: arm64_insn = 656;
pub const arm64_insn_ARM64_INS_MOVK: arm64_insn = 657;
pub const arm64_insn_ARM64_INS_MOVN: arm64_insn = 658;
pub const arm64_insn_ARM64_INS_MOVPRFX: arm64_insn = 659;
pub const arm64_insn_ARM64_INS_MOVS: arm64_insn = 660;
pub const arm64_insn_ARM64_INS_MOVZ: arm64_insn = 661;
pub const arm64_insn_ARM64_INS_MRS: arm64_insn = 662;
pub const arm64_insn_ARM64_INS_MSB: arm64_insn = 663;
pub const arm64_insn_ARM64_INS_MSR: arm64_insn = 664;
pub const arm64_insn_ARM64_INS_MSUB: arm64_insn = 665;
pub const arm64_insn_ARM64_INS_MUL: arm64_insn = 666;
pub const arm64_insn_ARM64_INS_MVN: arm64_insn = 667;
pub const arm64_insn_ARM64_INS_MVNI: arm64_insn = 668;
pub const arm64_insn_ARM64_INS_NAND: arm64_insn = 669;
pub const arm64_insn_ARM64_INS_NANDS: arm64_insn = 670;
pub const arm64_insn_ARM64_INS_NBSL: arm64_insn = 671;
pub const arm64_insn_ARM64_INS_NEG: arm64_insn = 672;
pub const arm64_insn_ARM64_INS_NEGS: arm64_insn = 673;
pub const arm64_insn_ARM64_INS_NGC: arm64_insn = 674;
pub const arm64_insn_ARM64_INS_NGCS: arm64_insn = 675;
pub const arm64_insn_ARM64_INS_NMATCH: arm64_insn = 676;
pub const arm64_insn_ARM64_INS_NOP: arm64_insn = 677;
pub const arm64_insn_ARM64_INS_NOR: arm64_insn = 678;
pub const arm64_insn_ARM64_INS_NORS: arm64_insn = 679;
pub const arm64_insn_ARM64_INS_NOT: arm64_insn = 680;
pub const arm64_insn_ARM64_INS_NOTS: arm64_insn = 681;
pub const arm64_insn_ARM64_INS_ORN: arm64_insn = 682;
pub const arm64_insn_ARM64_INS_ORNS: arm64_insn = 683;
pub const arm64_insn_ARM64_INS_ORR: arm64_insn = 684;
pub const arm64_insn_ARM64_INS_ORRS: arm64_insn = 685;
pub const arm64_insn_ARM64_INS_ORV: arm64_insn = 686;
pub const arm64_insn_ARM64_INS_PACDA: arm64_insn = 687;
pub const arm64_insn_ARM64_INS_PACDB: arm64_insn = 688;
pub const arm64_insn_ARM64_INS_PACDZA: arm64_insn = 689;
pub const arm64_insn_ARM64_INS_PACDZB: arm64_insn = 690;
pub const arm64_insn_ARM64_INS_PACGA: arm64_insn = 691;
pub const arm64_insn_ARM64_INS_PACIA: arm64_insn = 692;
pub const arm64_insn_ARM64_INS_PACIA1716: arm64_insn = 693;
pub const arm64_insn_ARM64_INS_PACIASP: arm64_insn = 694;
pub const arm64_insn_ARM64_INS_PACIAZ: arm64_insn = 695;
pub const arm64_insn_ARM64_INS_PACIB: arm64_insn = 696;
pub const arm64_insn_ARM64_INS_PACIB1716: arm64_insn = 697;
pub const arm64_insn_ARM64_INS_PACIBSP: arm64_insn = 698;
pub const arm64_insn_ARM64_INS_PACIBZ: arm64_insn = 699;
pub const arm64_insn_ARM64_INS_PACIZA: arm64_insn = 700;
pub const arm64_insn_ARM64_INS_PACIZB: arm64_insn = 701;
pub const arm64_insn_ARM64_INS_PFALSE: arm64_insn = 702;
pub const arm64_insn_ARM64_INS_PFIRST: arm64_insn = 703;
pub const arm64_insn_ARM64_INS_PMUL: arm64_insn = 704;
pub const arm64_insn_ARM64_INS_PMULL: arm64_insn = 705;
pub const arm64_insn_ARM64_INS_PMULL2: arm64_insn = 706;
pub const arm64_insn_ARM64_INS_PMULLB: arm64_insn = 707;
pub const arm64_insn_ARM64_INS_PMULLT: arm64_insn = 708;
pub const arm64_insn_ARM64_INS_PNEXT: arm64_insn = 709;
pub const arm64_insn_ARM64_INS_PRFB: arm64_insn = 710;
pub const arm64_insn_ARM64_INS_PRFD: arm64_insn = 711;
pub const arm64_insn_ARM64_INS_PRFH: arm64_insn = 712;
pub const arm64_insn_ARM64_INS_PRFM: arm64_insn = 713;
pub const arm64_insn_ARM64_INS_PRFUM: arm64_insn = 714;
pub const arm64_insn_ARM64_INS_PRFW: arm64_insn = 715;
pub const arm64_insn_ARM64_INS_PSB: arm64_insn = 716;
pub const arm64_insn_ARM64_INS_PSEL: arm64_insn = 717;
pub const arm64_insn_ARM64_INS_PSSBB: arm64_insn = 718;
pub const arm64_insn_ARM64_INS_PTEST: arm64_insn = 719;
pub const arm64_insn_ARM64_INS_PTRUE: arm64_insn = 720;
pub const arm64_insn_ARM64_INS_PTRUES: arm64_insn = 721;
pub const arm64_insn_ARM64_INS_PUNPKHI: arm64_insn = 722;
pub const arm64_insn_ARM64_INS_PUNPKLO: arm64_insn = 723;
pub const arm64_insn_ARM64_INS_RADDHN: arm64_insn = 724;
pub const arm64_insn_ARM64_INS_RADDHN2: arm64_insn = 725;
pub const arm64_insn_ARM64_INS_RADDHNB: arm64_insn = 726;
pub const arm64_insn_ARM64_INS_RADDHNT: arm64_insn = 727;
pub const arm64_insn_ARM64_INS_RAX1: arm64_insn = 728;
pub const arm64_insn_ARM64_INS_RBIT: arm64_insn = 729;
pub const arm64_insn_ARM64_INS_RDFFR: arm64_insn = 730;
pub const arm64_insn_ARM64_INS_RDFFRS: arm64_insn = 731;
pub const arm64_insn_ARM64_INS_RDVL: arm64_insn = 732;
pub const arm64_insn_ARM64_INS_RET: arm64_insn = 733;
pub const arm64_insn_ARM64_INS_RETAA: arm64_insn = 734;
pub const arm64_insn_ARM64_INS_RETAB: arm64_insn = 735;
pub const arm64_insn_ARM64_INS_REV: arm64_insn = 736;
pub const arm64_insn_ARM64_INS_REV16: arm64_insn = 737;
pub const arm64_insn_ARM64_INS_REV32: arm64_insn = 738;
pub const arm64_insn_ARM64_INS_REV64: arm64_insn = 739;
pub const arm64_insn_ARM64_INS_REVB: arm64_insn = 740;
pub const arm64_insn_ARM64_INS_REVD: arm64_insn = 741;
pub const arm64_insn_ARM64_INS_REVH: arm64_insn = 742;
pub const arm64_insn_ARM64_INS_REVW: arm64_insn = 743;
pub const arm64_insn_ARM64_INS_RMIF: arm64_insn = 744;
pub const arm64_insn_ARM64_INS_ROR: arm64_insn = 745;
pub const arm64_insn_ARM64_INS_RORV: arm64_insn = 746;
pub const arm64_insn_ARM64_INS_RSHRN: arm64_insn = 747;
pub const arm64_insn_ARM64_INS_RSHRN2: arm64_insn = 748;
pub const arm64_insn_ARM64_INS_RSHRNB: arm64_insn = 749;
pub const arm64_insn_ARM64_INS_RSHRNT: arm64_insn = 750;
pub const arm64_insn_ARM64_INS_RSUBHN: arm64_insn = 751;
pub const arm64_insn_ARM64_INS_RSUBHN2: arm64_insn = 752;
pub const arm64_insn_ARM64_INS_RSUBHNB: arm64_insn = 753;
pub const arm64_insn_ARM64_INS_RSUBHNT: arm64_insn = 754;
pub const arm64_insn_ARM64_INS_SABA: arm64_insn = 755;
pub const arm64_insn_ARM64_INS_SABAL: arm64_insn = 756;
pub const arm64_insn_ARM64_INS_SABAL2: arm64_insn = 757;
pub const arm64_insn_ARM64_INS_SABALB: arm64_insn = 758;
pub const arm64_insn_ARM64_INS_SABALT: arm64_insn = 759;
pub const arm64_insn_ARM64_INS_SABD: arm64_insn = 760;
pub const arm64_insn_ARM64_INS_SABDL: arm64_insn = 761;
pub const arm64_insn_ARM64_INS_SABDL2: arm64_insn = 762;
pub const arm64_insn_ARM64_INS_SABDLB: arm64_insn = 763;
pub const arm64_insn_ARM64_INS_SABDLT: arm64_insn = 764;
pub const arm64_insn_ARM64_INS_SADALP: arm64_insn = 765;
pub const arm64_insn_ARM64_INS_SADDL: arm64_insn = 766;
pub const arm64_insn_ARM64_INS_SADDL2: arm64_insn = 767;
pub const arm64_insn_ARM64_INS_SADDLB: arm64_insn = 768;
pub const arm64_insn_ARM64_INS_SADDLBT: arm64_insn = 769;
pub const arm64_insn_ARM64_INS_SADDLP: arm64_insn = 770;
pub const arm64_insn_ARM64_INS_SADDLT: arm64_insn = 771;
pub const arm64_insn_ARM64_INS_SADDLV: arm64_insn = 772;
pub const arm64_insn_ARM64_INS_SADDV: arm64_insn = 773;
pub const arm64_insn_ARM64_INS_SADDW: arm64_insn = 774;
pub const arm64_insn_ARM64_INS_SADDW2: arm64_insn = 775;
pub const arm64_insn_ARM64_INS_SADDWB: arm64_insn = 776;
pub const arm64_insn_ARM64_INS_SADDWT: arm64_insn = 777;
pub const arm64_insn_ARM64_INS_SB: arm64_insn = 778;
pub const arm64_insn_ARM64_INS_SBC: arm64_insn = 779;
pub const arm64_insn_ARM64_INS_SBCLB: arm64_insn = 780;
pub const arm64_insn_ARM64_INS_SBCLT: arm64_insn = 781;
pub const arm64_insn_ARM64_INS_SBCS: arm64_insn = 782;
pub const arm64_insn_ARM64_INS_SBFM: arm64_insn = 783;
pub const arm64_insn_ARM64_INS_SCLAMP: arm64_insn = 784;
pub const arm64_insn_ARM64_INS_SCVTF: arm64_insn = 785;
pub const arm64_insn_ARM64_INS_SDIV: arm64_insn = 786;
pub const arm64_insn_ARM64_INS_SDIVR: arm64_insn = 787;
pub const arm64_insn_ARM64_INS_SDOT: arm64_insn = 788;
pub const arm64_insn_ARM64_INS_SEL: arm64_insn = 789;
pub const arm64_insn_ARM64_INS_SETE: arm64_insn = 790;
pub const arm64_insn_ARM64_INS_SETEN: arm64_insn = 791;
pub const arm64_insn_ARM64_INS_SETET: arm64_insn = 792;
pub const arm64_insn_ARM64_INS_SETETN: arm64_insn = 793;
pub const arm64_insn_ARM64_INS_SETF16: arm64_insn = 794;
pub const arm64_insn_ARM64_INS_SETF8: arm64_insn = 795;
pub const arm64_insn_ARM64_INS_SETFFR: arm64_insn = 796;
pub const arm64_insn_ARM64_INS_SETGE: arm64_insn = 797;
pub const arm64_insn_ARM64_INS_SETGEN: arm64_insn = 798;
pub const arm64_insn_ARM64_INS_SETGET: arm64_insn = 799;
pub const arm64_insn_ARM64_INS_SETGETN: arm64_insn = 800;
pub const arm64_insn_ARM64_INS_SETGM: arm64_insn = 801;
pub const arm64_insn_ARM64_INS_SETGMN: arm64_insn = 802;
pub const arm64_insn_ARM64_INS_SETGMT: arm64_insn = 803;
pub const arm64_insn_ARM64_INS_SETGMTN: arm64_insn = 804;
pub const arm64_insn_ARM64_INS_SETGP: arm64_insn = 805;
pub const arm64_insn_ARM64_INS_SETGPN: arm64_insn = 806;
pub const arm64_insn_ARM64_INS_SETGPT: arm64_insn = 807;
pub const arm64_insn_ARM64_INS_SETGPTN: arm64_insn = 808;
pub const arm64_insn_ARM64_INS_SETM: arm64_insn = 809;
pub const arm64_insn_ARM64_INS_SETMN: arm64_insn = 810;
pub const arm64_insn_ARM64_INS_SETMT: arm64_insn = 811;
pub const arm64_insn_ARM64_INS_SETMTN: arm64_insn = 812;
pub const arm64_insn_ARM64_INS_SETP: arm64_insn = 813;
pub const arm64_insn_ARM64_INS_SETPN: arm64_insn = 814;
pub const arm64_insn_ARM64_INS_SETPT: arm64_insn = 815;
pub const arm64_insn_ARM64_INS_SETPTN: arm64_insn = 816;
pub const arm64_insn_ARM64_INS_SEV: arm64_insn = 817;
pub const arm64_insn_ARM64_INS_SEVL: arm64_insn = 818;
pub const arm64_insn_ARM64_INS_SHA1C: arm64_insn = 819;
pub const arm64_insn_ARM64_INS_SHA1H: arm64_insn = 820;
pub const arm64_insn_ARM64_INS_SHA1M: arm64_insn = 821;
pub const arm64_insn_ARM64_INS_SHA1P: arm64_insn = 822;
pub const arm64_insn_ARM64_INS_SHA1SU0: arm64_insn = 823;
pub const arm64_insn_ARM64_INS_SHA1SU1: arm64_insn = 824;
pub const arm64_insn_ARM64_INS_SHA256H: arm64_insn = 825;
pub const arm64_insn_ARM64_INS_SHA256H2: arm64_insn = 826;
pub const arm64_insn_ARM64_INS_SHA256SU0: arm64_insn = 827;
pub const arm64_insn_ARM64_INS_SHA256SU1: arm64_insn = 828;
pub const arm64_insn_ARM64_INS_SHA512H: arm64_insn = 829;
pub const arm64_insn_ARM64_INS_SHA512H2: arm64_insn = 830;
pub const arm64_insn_ARM64_INS_SHA512SU0: arm64_insn = 831;
pub const arm64_insn_ARM64_INS_SHA512SU1: arm64_insn = 832;
pub const arm64_insn_ARM64_INS_SHADD: arm64_insn = 833;
pub const arm64_insn_ARM64_INS_SHL: arm64_insn = 834;
pub const arm64_insn_ARM64_INS_SHLL: arm64_insn = 835;
pub const arm64_insn_ARM64_INS_SHLL2: arm64_insn = 836;
pub const arm64_insn_ARM64_INS_SHRN: arm64_insn = 837;
pub const arm64_insn_ARM64_INS_SHRN2: arm64_insn = 838;
pub const arm64_insn_ARM64_INS_SHRNB: arm64_insn = 839;
pub const arm64_insn_ARM64_INS_SHRNT: arm64_insn = 840;
pub const arm64_insn_ARM64_INS_SHSUB: arm64_insn = 841;
pub const arm64_insn_ARM64_INS_SHSUBR: arm64_insn = 842;
pub const arm64_insn_ARM64_INS_SLI: arm64_insn = 843;
pub const arm64_insn_ARM64_INS_SM3PARTW1: arm64_insn = 844;
pub const arm64_insn_ARM64_INS_SM3PARTW2: arm64_insn = 845;
pub const arm64_insn_ARM64_INS_SM3SS1: arm64_insn = 846;
pub const arm64_insn_ARM64_INS_SM3TT1A: arm64_insn = 847;
pub const arm64_insn_ARM64_INS_SM3TT1B: arm64_insn = 848;
pub const arm64_insn_ARM64_INS_SM3TT2A: arm64_insn = 849;
pub const arm64_insn_ARM64_INS_SM3TT2B: arm64_insn = 850;
pub const arm64_insn_ARM64_INS_SM4E: arm64_insn = 851;
pub const arm64_insn_ARM64_INS_SM4EKEY: arm64_insn = 852;
pub const arm64_insn_ARM64_INS_SMADDL: arm64_insn = 853;
pub const arm64_insn_ARM64_INS_SMAX: arm64_insn = 854;
pub const arm64_insn_ARM64_INS_SMAXP: arm64_insn = 855;
pub const arm64_insn_ARM64_INS_SMAXV: arm64_insn = 856;
pub const arm64_insn_ARM64_INS_SMC: arm64_insn = 857;
pub const arm64_insn_ARM64_INS_SMIN: arm64_insn = 858;
pub const arm64_insn_ARM64_INS_SMINP: arm64_insn = 859;
pub const arm64_insn_ARM64_INS_SMINV: arm64_insn = 860;
pub const arm64_insn_ARM64_INS_SMLAL: arm64_insn = 861;
pub const arm64_insn_ARM64_INS_SMLAL2: arm64_insn = 862;
pub const arm64_insn_ARM64_INS_SMLALB: arm64_insn = 863;
pub const arm64_insn_ARM64_INS_SMLALT: arm64_insn = 864;
pub const arm64_insn_ARM64_INS_SMLSL: arm64_insn = 865;
pub const arm64_insn_ARM64_INS_SMLSL2: arm64_insn = 866;
pub const arm64_insn_ARM64_INS_SMLSLB: arm64_insn = 867;
pub const arm64_insn_ARM64_INS_SMLSLT: arm64_insn = 868;
pub const arm64_insn_ARM64_INS_SMMLA: arm64_insn = 869;
pub const arm64_insn_ARM64_INS_SMNEGL: arm64_insn = 870;
pub const arm64_insn_ARM64_INS_SMOPA: arm64_insn = 871;
pub const arm64_insn_ARM64_INS_SMOPS: arm64_insn = 872;
pub const arm64_insn_ARM64_INS_SMOV: arm64_insn = 873;
pub const arm64_insn_ARM64_INS_SMSTART: arm64_insn = 874;
pub const arm64_insn_ARM64_INS_SMSTOP: arm64_insn = 875;
pub const arm64_insn_ARM64_INS_SMSUBL: arm64_insn = 876;
pub const arm64_insn_ARM64_INS_SMULH: arm64_insn = 877;
pub const arm64_insn_ARM64_INS_SMULL: arm64_insn = 878;
pub const arm64_insn_ARM64_INS_SMULL2: arm64_insn = 879;
pub const arm64_insn_ARM64_INS_SMULLB: arm64_insn = 880;
pub const arm64_insn_ARM64_INS_SMULLT: arm64_insn = 881;
pub const arm64_insn_ARM64_INS_SPLICE: arm64_insn = 882;
pub const arm64_insn_ARM64_INS_SQABS: arm64_insn = 883;
pub const arm64_insn_ARM64_INS_SQADD: arm64_insn = 884;
pub const arm64_insn_ARM64_INS_SQCADD: arm64_insn = 885;
pub const arm64_insn_ARM64_INS_SQDECB: arm64_insn = 886;
pub const arm64_insn_ARM64_INS_SQDECD: arm64_insn = 887;
pub const arm64_insn_ARM64_INS_SQDECH: arm64_insn = 888;
pub const arm64_insn_ARM64_INS_SQDECP: arm64_insn = 889;
pub const arm64_insn_ARM64_INS_SQDECW: arm64_insn = 890;
pub const arm64_insn_ARM64_INS_SQDMLAL: arm64_insn = 891;
pub const arm64_insn_ARM64_INS_SQDMLAL2: arm64_insn = 892;
pub const arm64_insn_ARM64_INS_SQDMLALB: arm64_insn = 893;
pub const arm64_insn_ARM64_INS_SQDMLALBT: arm64_insn = 894;
pub const arm64_insn_ARM64_INS_SQDMLALT: arm64_insn = 895;
pub const arm64_insn_ARM64_INS_SQDMLSL: arm64_insn = 896;
pub const arm64_insn_ARM64_INS_SQDMLSL2: arm64_insn = 897;
pub const arm64_insn_ARM64_INS_SQDMLSLB: arm64_insn = 898;
pub const arm64_insn_ARM64_INS_SQDMLSLBT: arm64_insn = 899;
pub const arm64_insn_ARM64_INS_SQDMLSLT: arm64_insn = 900;
pub const arm64_insn_ARM64_INS_SQDMULH: arm64_insn = 901;
pub const arm64_insn_ARM64_INS_SQDMULL: arm64_insn = 902;
pub const arm64_insn_ARM64_INS_SQDMULL2: arm64_insn = 903;
pub const arm64_insn_ARM64_INS_SQDMULLB: arm64_insn = 904;
pub const arm64_insn_ARM64_INS_SQDMULLT: arm64_insn = 905;
pub const arm64_insn_ARM64_INS_SQINCB: arm64_insn = 906;
pub const arm64_insn_ARM64_INS_SQINCD: arm64_insn = 907;
pub const arm64_insn_ARM64_INS_SQINCH: arm64_insn = 908;
pub const arm64_insn_ARM64_INS_SQINCP: arm64_insn = 909;
pub const arm64_insn_ARM64_INS_SQINCW: arm64_insn = 910;
pub const arm64_insn_ARM64_INS_SQNEG: arm64_insn = 911;
pub const arm64_insn_ARM64_INS_SQRDCMLAH: arm64_insn = 912;
pub const arm64_insn_ARM64_INS_SQRDMLAH: arm64_insn = 913;
pub const arm64_insn_ARM64_INS_SQRDMLSH: arm64_insn = 914;
pub const arm64_insn_ARM64_INS_SQRDMULH: arm64_insn = 915;
pub const arm64_insn_ARM64_INS_SQRSHL: arm64_insn = 916;
pub const arm64_insn_ARM64_INS_SQRSHLR: arm64_insn = 917;
pub const arm64_insn_ARM64_INS_SQRSHRN: arm64_insn = 918;
pub const arm64_insn_ARM64_INS_SQRSHRN2: arm64_insn = 919;
pub const arm64_insn_ARM64_INS_SQRSHRNB: arm64_insn = 920;
pub const arm64_insn_ARM64_INS_SQRSHRNT: arm64_insn = 921;
pub const arm64_insn_ARM64_INS_SQRSHRUN: arm64_insn = 922;
pub const arm64_insn_ARM64_INS_SQRSHRUN2: arm64_insn = 923;
pub const arm64_insn_ARM64_INS_SQRSHRUNB: arm64_insn = 924;
pub const arm64_insn_ARM64_INS_SQRSHRUNT: arm64_insn = 925;
pub const arm64_insn_ARM64_INS_SQSHL: arm64_insn = 926;
pub const arm64_insn_ARM64_INS_SQSHLR: arm64_insn = 927;
pub const arm64_insn_ARM64_INS_SQSHLU: arm64_insn = 928;
pub const arm64_insn_ARM64_INS_SQSHRN: arm64_insn = 929;
pub const arm64_insn_ARM64_INS_SQSHRN2: arm64_insn = 930;
pub const arm64_insn_ARM64_INS_SQSHRNB: arm64_insn = 931;
pub const arm64_insn_ARM64_INS_SQSHRNT: arm64_insn = 932;
pub const arm64_insn_ARM64_INS_SQSHRUN: arm64_insn = 933;
pub const arm64_insn_ARM64_INS_SQSHRUN2: arm64_insn = 934;
pub const arm64_insn_ARM64_INS_SQSHRUNB: arm64_insn = 935;
pub const arm64_insn_ARM64_INS_SQSHRUNT: arm64_insn = 936;
pub const arm64_insn_ARM64_INS_SQSUB: arm64_insn = 937;
pub const arm64_insn_ARM64_INS_SQSUBR: arm64_insn = 938;
pub const arm64_insn_ARM64_INS_SQXTN: arm64_insn = 939;
pub const arm64_insn_ARM64_INS_SQXTN2: arm64_insn = 940;
pub const arm64_insn_ARM64_INS_SQXTNB: arm64_insn = 941;
pub const arm64_insn_ARM64_INS_SQXTNT: arm64_insn = 942;
pub const arm64_insn_ARM64_INS_SQXTUN: arm64_insn = 943;
pub const arm64_insn_ARM64_INS_SQXTUN2: arm64_insn = 944;
pub const arm64_insn_ARM64_INS_SQXTUNB: arm64_insn = 945;
pub const arm64_insn_ARM64_INS_SQXTUNT: arm64_insn = 946;
pub const arm64_insn_ARM64_INS_SRHADD: arm64_insn = 947;
pub const arm64_insn_ARM64_INS_SRI: arm64_insn = 948;
pub const arm64_insn_ARM64_INS_SRSHL: arm64_insn = 949;
pub const arm64_insn_ARM64_INS_SRSHLR: arm64_insn = 950;
pub const arm64_insn_ARM64_INS_SRSHR: arm64_insn = 951;
pub const arm64_insn_ARM64_INS_SRSRA: arm64_insn = 952;
pub const arm64_insn_ARM64_INS_SSBB: arm64_insn = 953;
pub const arm64_insn_ARM64_INS_SSHL: arm64_insn = 954;
pub const arm64_insn_ARM64_INS_SSHLL: arm64_insn = 955;
pub const arm64_insn_ARM64_INS_SSHLL2: arm64_insn = 956;
pub const arm64_insn_ARM64_INS_SSHLLB: arm64_insn = 957;
pub const arm64_insn_ARM64_INS_SSHLLT: arm64_insn = 958;
pub const arm64_insn_ARM64_INS_SSHR: arm64_insn = 959;
pub const arm64_insn_ARM64_INS_SSRA: arm64_insn = 960;
pub const arm64_insn_ARM64_INS_SSUBL: arm64_insn = 961;
pub const arm64_insn_ARM64_INS_SSUBL2: arm64_insn = 962;
pub const arm64_insn_ARM64_INS_SSUBLB: arm64_insn = 963;
pub const arm64_insn_ARM64_INS_SSUBLBT: arm64_insn = 964;
pub const arm64_insn_ARM64_INS_SSUBLT: arm64_insn = 965;
pub const arm64_insn_ARM64_INS_SSUBLTB: arm64_insn = 966;
pub const arm64_insn_ARM64_INS_SSUBW: arm64_insn = 967;
pub const arm64_insn_ARM64_INS_SSUBW2: arm64_insn = 968;
pub const arm64_insn_ARM64_INS_SSUBWB: arm64_insn = 969;
pub const arm64_insn_ARM64_INS_SSUBWT: arm64_insn = 970;
pub const arm64_insn_ARM64_INS_ST1: arm64_insn = 971;
pub const arm64_insn_ARM64_INS_ST1B: arm64_insn = 972;
pub const arm64_insn_ARM64_INS_ST1D: arm64_insn = 973;
pub const arm64_insn_ARM64_INS_ST1H: arm64_insn = 974;
pub const arm64_insn_ARM64_INS_ST1Q: arm64_insn = 975;
pub const arm64_insn_ARM64_INS_ST1W: arm64_insn = 976;
pub const arm64_insn_ARM64_INS_ST2: arm64_insn = 977;
pub const arm64_insn_ARM64_INS_ST2B: arm64_insn = 978;
pub const arm64_insn_ARM64_INS_ST2D: arm64_insn = 979;
pub const arm64_insn_ARM64_INS_ST2G: arm64_insn = 980;
pub const arm64_insn_ARM64_INS_ST2H: arm64_insn = 981;
pub const arm64_insn_ARM64_INS_ST2W: arm64_insn = 982;
pub const arm64_insn_ARM64_INS_ST3: arm64_insn = 983;
pub const arm64_insn_ARM64_INS_ST3B: arm64_insn = 984;
pub const arm64_insn_ARM64_INS_ST3D: arm64_insn = 985;
pub const arm64_insn_ARM64_INS_ST3H: arm64_insn = 986;
pub const arm64_insn_ARM64_INS_ST3W: arm64_insn = 987;
pub const arm64_insn_ARM64_INS_ST4: arm64_insn = 988;
pub const arm64_insn_ARM64_INS_ST4B: arm64_insn = 989;
pub const arm64_insn_ARM64_INS_ST4D: arm64_insn = 990;
pub const arm64_insn_ARM64_INS_ST4H: arm64_insn = 991;
pub const arm64_insn_ARM64_INS_ST4W: arm64_insn = 992;
pub const arm64_insn_ARM64_INS_ST64B: arm64_insn = 993;
pub const arm64_insn_ARM64_INS_ST64BV: arm64_insn = 994;
pub const arm64_insn_ARM64_INS_ST64BV0: arm64_insn = 995;
pub const arm64_insn_ARM64_INS_STADD: arm64_insn = 996;
pub const arm64_insn_ARM64_INS_STADDB: arm64_insn = 997;
pub const arm64_insn_ARM64_INS_STADDH: arm64_insn = 998;
pub const arm64_insn_ARM64_INS_STADDL: arm64_insn = 999;
pub const arm64_insn_ARM64_INS_STADDLB: arm64_insn = 1000;
pub const arm64_insn_ARM64_INS_STADDLH: arm64_insn = 1001;
pub const arm64_insn_ARM64_INS_STCLR: arm64_insn = 1002;
pub const arm64_insn_ARM64_INS_STCLRB: arm64_insn = 1003;
pub const arm64_insn_ARM64_INS_STCLRH: arm64_insn = 1004;
pub const arm64_insn_ARM64_INS_STCLRL: arm64_insn = 1005;
pub const arm64_insn_ARM64_INS_STCLRLB: arm64_insn = 1006;
pub const arm64_insn_ARM64_INS_STCLRLH: arm64_insn = 1007;
pub const arm64_insn_ARM64_INS_STEOR: arm64_insn = 1008;
pub const arm64_insn_ARM64_INS_STEORB: arm64_insn = 1009;
pub const arm64_insn_ARM64_INS_STEORH: arm64_insn = 1010;
pub const arm64_insn_ARM64_INS_STEORL: arm64_insn = 1011;
pub const arm64_insn_ARM64_INS_STEORLB: arm64_insn = 1012;
pub const arm64_insn_ARM64_INS_STEORLH: arm64_insn = 1013;
pub const arm64_insn_ARM64_INS_STG: arm64_insn = 1014;
pub const arm64_insn_ARM64_INS_STGM: arm64_insn = 1015;
pub const arm64_insn_ARM64_INS_STGP: arm64_insn = 1016;
pub const arm64_insn_ARM64_INS_STLLR: arm64_insn = 1017;
pub const arm64_insn_ARM64_INS_STLLRB: arm64_insn = 1018;
pub const arm64_insn_ARM64_INS_STLLRH: arm64_insn = 1019;
pub const arm64_insn_ARM64_INS_STLR: arm64_insn = 1020;
pub const arm64_insn_ARM64_INS_STLRB: arm64_insn = 1021;
pub const arm64_insn_ARM64_INS_STLRH: arm64_insn = 1022;
pub const arm64_insn_ARM64_INS_STLUR: arm64_insn = 1023;
pub const arm64_insn_ARM64_INS_STLURB: arm64_insn = 1024;
pub const arm64_insn_ARM64_INS_STLURH: arm64_insn = 1025;
pub const arm64_insn_ARM64_INS_STLXP: arm64_insn = 1026;
pub const arm64_insn_ARM64_INS_STLXR: arm64_insn = 1027;
pub const arm64_insn_ARM64_INS_STLXRB: arm64_insn = 1028;
pub const arm64_insn_ARM64_INS_STLXRH: arm64_insn = 1029;
pub const arm64_insn_ARM64_INS_STNP: arm64_insn = 1030;
pub const arm64_insn_ARM64_INS_STNT1B: arm64_insn = 1031;
pub const arm64_insn_ARM64_INS_STNT1D: arm64_insn = 1032;
pub const arm64_insn_ARM64_INS_STNT1H: arm64_insn = 1033;
pub const arm64_insn_ARM64_INS_STNT1W: arm64_insn = 1034;
pub const arm64_insn_ARM64_INS_STP: arm64_insn = 1035;
pub const arm64_insn_ARM64_INS_STR: arm64_insn = 1036;
pub const arm64_insn_ARM64_INS_STRB: arm64_insn = 1037;
pub const arm64_insn_ARM64_INS_STRH: arm64_insn = 1038;
pub const arm64_insn_ARM64_INS_STSET: arm64_insn = 1039;
pub const arm64_insn_ARM64_INS_STSETB: arm64_insn = 1040;
pub const arm64_insn_ARM64_INS_STSETH: arm64_insn = 1041;
pub const arm64_insn_ARM64_INS_STSETL: arm64_insn = 1042;
pub const arm64_insn_ARM64_INS_STSETLB: arm64_insn = 1043;
pub const arm64_insn_ARM64_INS_STSETLH: arm64_insn = 1044;
pub const arm64_insn_ARM64_INS_STSMAX: arm64_insn = 1045;
pub const arm64_insn_ARM64_INS_STSMAXB: arm64_insn = 1046;
pub const arm64_insn_ARM64_INS_STSMAXH: arm64_insn = 1047;
pub const arm64_insn_ARM64_INS_STSMAXL: arm64_insn = 1048;
pub const arm64_insn_ARM64_INS_STSMAXLB: arm64_insn = 1049;
pub const arm64_insn_ARM64_INS_STSMAXLH: arm64_insn = 1050;
pub const arm64_insn_ARM64_INS_STSMIN: arm64_insn = 1051;
pub const arm64_insn_ARM64_INS_STSMINB: arm64_insn = 1052;
pub const arm64_insn_ARM64_INS_STSMINH: arm64_insn = 1053;
pub const arm64_insn_ARM64_INS_STSMINL: arm64_insn = 1054;
pub const arm64_insn_ARM64_INS_STSMINLB: arm64_insn = 1055;
pub const arm64_insn_ARM64_INS_STSMINLH: arm64_insn = 1056;
pub const arm64_insn_ARM64_INS_STTR: arm64_insn = 1057;
pub const arm64_insn_ARM64_INS_STTRB: arm64_insn = 1058;
pub const arm64_insn_ARM64_INS_STTRH: arm64_insn = 1059;
pub const arm64_insn_ARM64_INS_STUMAX: arm64_insn = 1060;
pub const arm64_insn_ARM64_INS_STUMAXB: arm64_insn = 1061;
pub const arm64_insn_ARM64_INS_STUMAXH: arm64_insn = 1062;
pub const arm64_insn_ARM64_INS_STUMAXL: arm64_insn = 1063;
pub const arm64_insn_ARM64_INS_STUMAXLB: arm64_insn = 1064;
pub const arm64_insn_ARM64_INS_STUMAXLH: arm64_insn = 1065;
pub const arm64_insn_ARM64_INS_STUMIN: arm64_insn = 1066;
pub const arm64_insn_ARM64_INS_STUMINB: arm64_insn = 1067;
pub const arm64_insn_ARM64_INS_STUMINH: arm64_insn = 1068;
pub const arm64_insn_ARM64_INS_STUMINL: arm64_insn = 1069;
pub const arm64_insn_ARM64_INS_STUMINLB: arm64_insn = 1070;
pub const arm64_insn_ARM64_INS_STUMINLH: arm64_insn = 1071;
pub const arm64_insn_ARM64_INS_STUR: arm64_insn = 1072;
pub const arm64_insn_ARM64_INS_STURB: arm64_insn = 1073;
pub const arm64_insn_ARM64_INS_STURH: arm64_insn = 1074;
pub const arm64_insn_ARM64_INS_STXP: arm64_insn = 1075;
pub const arm64_insn_ARM64_INS_STXR: arm64_insn = 1076;
pub const arm64_insn_ARM64_INS_STXRB: arm64_insn = 1077;
pub const arm64_insn_ARM64_INS_STXRH: arm64_insn = 1078;
pub const arm64_insn_ARM64_INS_STZ2G: arm64_insn = 1079;
pub const arm64_insn_ARM64_INS_STZG: arm64_insn = 1080;
pub const arm64_insn_ARM64_INS_STZGM: arm64_insn = 1081;
pub const arm64_insn_ARM64_INS_SUB: arm64_insn = 1082;
pub const arm64_insn_ARM64_INS_SUBG: arm64_insn = 1083;
pub const arm64_insn_ARM64_INS_SUBHN: arm64_insn = 1084;
pub const arm64_insn_ARM64_INS_SUBHN2: arm64_insn = 1085;
pub const arm64_insn_ARM64_INS_SUBHNB: arm64_insn = 1086;
pub const arm64_insn_ARM64_INS_SUBHNT: arm64_insn = 1087;
pub const arm64_insn_ARM64_INS_SUBP: arm64_insn = 1088;
pub const arm64_insn_ARM64_INS_SUBPS: arm64_insn = 1089;
pub const arm64_insn_ARM64_INS_SUBR: arm64_insn = 1090;
pub const arm64_insn_ARM64_INS_SUBS: arm64_insn = 1091;
pub const arm64_insn_ARM64_INS_SUDOT: arm64_insn = 1092;
pub const arm64_insn_ARM64_INS_SUMOPA: arm64_insn = 1093;
pub const arm64_insn_ARM64_INS_SUMOPS: arm64_insn = 1094;
pub const arm64_insn_ARM64_INS_SUNPKHI: arm64_insn = 1095;
pub const arm64_insn_ARM64_INS_SUNPKLO: arm64_insn = 1096;
pub const arm64_insn_ARM64_INS_SUQADD: arm64_insn = 1097;
pub const arm64_insn_ARM64_INS_SVC: arm64_insn = 1098;
pub const arm64_insn_ARM64_INS_SWP: arm64_insn = 1099;
pub const arm64_insn_ARM64_INS_SWPA: arm64_insn = 1100;
pub const arm64_insn_ARM64_INS_SWPAB: arm64_insn = 1101;
pub const arm64_insn_ARM64_INS_SWPAH: arm64_insn = 1102;
pub const arm64_insn_ARM64_INS_SWPAL: arm64_insn = 1103;
pub const arm64_insn_ARM64_INS_SWPALB: arm64_insn = 1104;
pub const arm64_insn_ARM64_INS_SWPALH: arm64_insn = 1105;
pub const arm64_insn_ARM64_INS_SWPB: arm64_insn = 1106;
pub const arm64_insn_ARM64_INS_SWPH: arm64_insn = 1107;
pub const arm64_insn_ARM64_INS_SWPL: arm64_insn = 1108;
pub const arm64_insn_ARM64_INS_SWPLB: arm64_insn = 1109;
pub const arm64_insn_ARM64_INS_SWPLH: arm64_insn = 1110;
pub const arm64_insn_ARM64_INS_SXTB: arm64_insn = 1111;
pub const arm64_insn_ARM64_INS_SXTH: arm64_insn = 1112;
pub const arm64_insn_ARM64_INS_SXTL: arm64_insn = 1113;
pub const arm64_insn_ARM64_INS_SXTL2: arm64_insn = 1114;
pub const arm64_insn_ARM64_INS_SXTW: arm64_insn = 1115;
pub const arm64_insn_ARM64_INS_SYS: arm64_insn = 1116;
pub const arm64_insn_ARM64_INS_SYSL: arm64_insn = 1117;
pub const arm64_insn_ARM64_INS_TBL: arm64_insn = 1118;
pub const arm64_insn_ARM64_INS_TBNZ: arm64_insn = 1119;
pub const arm64_insn_ARM64_INS_TBX: arm64_insn = 1120;
pub const arm64_insn_ARM64_INS_TBZ: arm64_insn = 1121;
pub const arm64_insn_ARM64_INS_TCANCEL: arm64_insn = 1122;
pub const arm64_insn_ARM64_INS_TCOMMIT: arm64_insn = 1123;
pub const arm64_insn_ARM64_INS_TRN1: arm64_insn = 1124;
pub const arm64_insn_ARM64_INS_TRN2: arm64_insn = 1125;
pub const arm64_insn_ARM64_INS_TSB: arm64_insn = 1126;
pub const arm64_insn_ARM64_INS_TST: arm64_insn = 1127;
pub const arm64_insn_ARM64_INS_TSTART: arm64_insn = 1128;
pub const arm64_insn_ARM64_INS_TTEST: arm64_insn = 1129;
pub const arm64_insn_ARM64_INS_UABA: arm64_insn = 1130;
pub const arm64_insn_ARM64_INS_UABAL: arm64_insn = 1131;
pub const arm64_insn_ARM64_INS_UABAL2: arm64_insn = 1132;
pub const arm64_insn_ARM64_INS_UABALB: arm64_insn = 1133;
pub const arm64_insn_ARM64_INS_UABALT: arm64_insn = 1134;
pub const arm64_insn_ARM64_INS_UABD: arm64_insn = 1135;
pub const arm64_insn_ARM64_INS_UABDL: arm64_insn = 1136;
pub const arm64_insn_ARM64_INS_UABDL2: arm64_insn = 1137;
pub const arm64_insn_ARM64_INS_UABDLB: arm64_insn = 1138;
pub const arm64_insn_ARM64_INS_UABDLT: arm64_insn = 1139;
pub const arm64_insn_ARM64_INS_UADALP: arm64_insn = 1140;
pub const arm64_insn_ARM64_INS_UADDL: arm64_insn = 1141;
pub const arm64_insn_ARM64_INS_UADDL2: arm64_insn = 1142;
pub const arm64_insn_ARM64_INS_UADDLB: arm64_insn = 1143;
pub const arm64_insn_ARM64_INS_UADDLP: arm64_insn = 1144;
pub const arm64_insn_ARM64_INS_UADDLT: arm64_insn = 1145;
pub const arm64_insn_ARM64_INS_UADDLV: arm64_insn = 1146;
pub const arm64_insn_ARM64_INS_UADDV: arm64_insn = 1147;
pub const arm64_insn_ARM64_INS_UADDW: arm64_insn = 1148;
pub const arm64_insn_ARM64_INS_UADDW2: arm64_insn = 1149;
pub const arm64_insn_ARM64_INS_UADDWB: arm64_insn = 1150;
pub const arm64_insn_ARM64_INS_UADDWT: arm64_insn = 1151;
pub const arm64_insn_ARM64_INS_UBFM: arm64_insn = 1152;
pub const arm64_insn_ARM64_INS_UCLAMP: arm64_insn = 1153;
pub const arm64_insn_ARM64_INS_UCVTF: arm64_insn = 1154;
pub const arm64_insn_ARM64_INS_UDF: arm64_insn = 1155;
pub const arm64_insn_ARM64_INS_UDIV: arm64_insn = 1156;
pub const arm64_insn_ARM64_INS_UDIVR: arm64_insn = 1157;
pub const arm64_insn_ARM64_INS_UDOT: arm64_insn = 1158;
pub const arm64_insn_ARM64_INS_UHADD: arm64_insn = 1159;
pub const arm64_insn_ARM64_INS_UHSUB: arm64_insn = 1160;
pub const arm64_insn_ARM64_INS_UHSUBR: arm64_insn = 1161;
pub const arm64_insn_ARM64_INS_UMADDL: arm64_insn = 1162;
pub const arm64_insn_ARM64_INS_UMAX: arm64_insn = 1163;
pub const arm64_insn_ARM64_INS_UMAXP: arm64_insn = 1164;
pub const arm64_insn_ARM64_INS_UMAXV: arm64_insn = 1165;
pub const arm64_insn_ARM64_INS_UMIN: arm64_insn = 1166;
pub const arm64_insn_ARM64_INS_UMINP: arm64_insn = 1167;
pub const arm64_insn_ARM64_INS_UMINV: arm64_insn = 1168;
pub const arm64_insn_ARM64_INS_UMLAL: arm64_insn = 1169;
pub const arm64_insn_ARM64_INS_UMLAL2: arm64_insn = 1170;
pub const arm64_insn_ARM64_INS_UMLALB: arm64_insn = 1171;
pub const arm64_insn_ARM64_INS_UMLALT: arm64_insn = 1172;
pub const arm64_insn_ARM64_INS_UMLSL: arm64_insn = 1173;
pub const arm64_insn_ARM64_INS_UMLSL2: arm64_insn = 1174;
pub const arm64_insn_ARM64_INS_UMLSLB: arm64_insn = 1175;
pub const arm64_insn_ARM64_INS_UMLSLT: arm64_insn = 1176;
pub const arm64_insn_ARM64_INS_UMMLA: arm64_insn = 1177;
pub const arm64_insn_ARM64_INS_UMNEGL: arm64_insn = 1178;
pub const arm64_insn_ARM64_INS_UMOPA: arm64_insn = 1179;
pub const arm64_insn_ARM64_INS_UMOPS: arm64_insn = 1180;
pub const arm64_insn_ARM64_INS_UMOV: arm64_insn = 1181;
pub const arm64_insn_ARM64_INS_UMSUBL: arm64_insn = 1182;
pub const arm64_insn_ARM64_INS_UMULH: arm64_insn = 1183;
pub const arm64_insn_ARM64_INS_UMULL: arm64_insn = 1184;
pub const arm64_insn_ARM64_INS_UMULL2: arm64_insn = 1185;
pub const arm64_insn_ARM64_INS_UMULLB: arm64_insn = 1186;
pub const arm64_insn_ARM64_INS_UMULLT: arm64_insn = 1187;
pub const arm64_insn_ARM64_INS_UQADD: arm64_insn = 1188;
pub const arm64_insn_ARM64_INS_UQDECB: arm64_insn = 1189;
pub const arm64_insn_ARM64_INS_UQDECD: arm64_insn = 1190;
pub const arm64_insn_ARM64_INS_UQDECH: arm64_insn = 1191;
pub const arm64_insn_ARM64_INS_UQDECP: arm64_insn = 1192;
pub const arm64_insn_ARM64_INS_UQDECW: arm64_insn = 1193;
pub const arm64_insn_ARM64_INS_UQINCB: arm64_insn = 1194;
pub const arm64_insn_ARM64_INS_UQINCD: arm64_insn = 1195;
pub const arm64_insn_ARM64_INS_UQINCH: arm64_insn = 1196;
pub const arm64_insn_ARM64_INS_UQINCP: arm64_insn = 1197;
pub const arm64_insn_ARM64_INS_UQINCW: arm64_insn = 1198;
pub const arm64_insn_ARM64_INS_UQRSHL: arm64_insn = 1199;
pub const arm64_insn_ARM64_INS_UQRSHLR: arm64_insn = 1200;
pub const arm64_insn_ARM64_INS_UQRSHRN: arm64_insn = 1201;
pub const arm64_insn_ARM64_INS_UQRSHRN2: arm64_insn = 1202;
pub const arm64_insn_ARM64_INS_UQRSHRNB: arm64_insn = 1203;
pub const arm64_insn_ARM64_INS_UQRSHRNT: arm64_insn = 1204;
pub const arm64_insn_ARM64_INS_UQSHL: arm64_insn = 1205;
pub const arm64_insn_ARM64_INS_UQSHLR: arm64_insn = 1206;
pub const arm64_insn_ARM64_INS_UQSHRN: arm64_insn = 1207;
pub const arm64_insn_ARM64_INS_UQSHRN2: arm64_insn = 1208;
pub const arm64_insn_ARM64_INS_UQSHRNB: arm64_insn = 1209;
pub const arm64_insn_ARM64_INS_UQSHRNT: arm64_insn = 1210;
pub const arm64_insn_ARM64_INS_UQSUB: arm64_insn = 1211;
pub const arm64_insn_ARM64_INS_UQSUBR: arm64_insn = 1212;
pub const arm64_insn_ARM64_INS_UQXTN: arm64_insn = 1213;
pub const arm64_insn_ARM64_INS_UQXTN2: arm64_insn = 1214;
pub const arm64_insn_ARM64_INS_UQXTNB: arm64_insn = 1215;
pub const arm64_insn_ARM64_INS_UQXTNT: arm64_insn = 1216;
pub const arm64_insn_ARM64_INS_URECPE: arm64_insn = 1217;
pub const arm64_insn_ARM64_INS_URHADD: arm64_insn = 1218;
pub const arm64_insn_ARM64_INS_URSHL: arm64_insn = 1219;
pub const arm64_insn_ARM64_INS_URSHLR: arm64_insn = 1220;
pub const arm64_insn_ARM64_INS_URSHR: arm64_insn = 1221;
pub const arm64_insn_ARM64_INS_URSQRTE: arm64_insn = 1222;
pub const arm64_insn_ARM64_INS_URSRA: arm64_insn = 1223;
pub const arm64_insn_ARM64_INS_USDOT: arm64_insn = 1224;
pub const arm64_insn_ARM64_INS_USHL: arm64_insn = 1225;
pub const arm64_insn_ARM64_INS_USHLL: arm64_insn = 1226;
pub const arm64_insn_ARM64_INS_USHLL2: arm64_insn = 1227;
pub const arm64_insn_ARM64_INS_USHLLB: arm64_insn = 1228;
pub const arm64_insn_ARM64_INS_USHLLT: arm64_insn = 1229;
pub const arm64_insn_ARM64_INS_USHR: arm64_insn = 1230;
